<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_1799" name="xcb_get_selection_owner" returns="_1123" context="_1" location="f0:8236" file="f0" line="8236" extern="1">
    <Argument name="c" type="_1864" location="f0:8236" file="f0" line="8236"/>
    <Argument name="selection" type="_1607" location="f0:8236" file="f0" line="8236"/>
  </Function>
  <Function id="_1800" name="xcb_gcontext_end" returns="_718" context="_1" location="f0:4999" file="f0" line="4999" extern="1">
    <Argument name="i" type="_1792" location="f0:4999" file="f0" line="4999"/>
  </Function>
  <Typedef id="_1801" name="xcb_keysym_t" type="_669" context="_1" location="f0:159" file="f0" line="159"/>
  <Function id="_1802" name="pthread_mutexattr_setprotocol" returns="_172" throw="" context="_1" location="f3:858" file="f3" line="858" extern="1" attributes="__nonnull__()">
    <Argument name="__attr" type="_2722" location="f3:858" file="f3" line="858"/>
    <Argument name="__protocol" type="_172" location="f3:858" file="f3" line="858"/>
  </Function>
  <Function id="_1803" name="xcb_get_selection_owner_reply" returns="_4957" context="_1" location="f0:8297" file="f0" line="8297" extern="1">
    <Argument name="c" type="_1864" location="f0:8297" file="f0" line="8297"/>
    <Argument name="cookie" type="_1123" location="f0:8297" file="f0" line="8297"/>
    <Argument name="e" type="_2125" location="f0:8297" file="f0" line="8297"/>
  </Function>
  <Struct id="_1804" name="xcb_set_access_control_request_t" context="_1" mangled="32xcb_set_access_control_request_t" demangled="xcb_set_access_control_request_t" location="f0:4523" file="f0" line="4523" artificial="1" size="32" align="16" members="_4958 _4959 _4960 _4961 _4962 _4963 _4964 " bases=""/>
  <Typedef id="_1805" name="xcb_set_access_control_request_t" type="_1804" context="_1" location="f0:4527" file="f0" line="4527"/>
  <Struct id="_1806" name="xcb_visualtype_t" context="_1" mangled="16xcb_visualtype_t" demangled="xcb_visualtype_t" location="f0:280" file="f0" line="280" artificial="1" size="192" align="32" members="_4965 _4966 _4967 _4968 _4969 _4970 _4971 _4972 _4973 _4974 _4975 _4976 " bases=""/>
  <Typedef id="_1807" name="xcb_visualtype_t" type="_1806" context="_1" location="f0:289" file="f0" line="289"/>
  <Function id="_1808" name="pthread_mutexattr_gettype" returns="_172" throw="" context="_1" location="f3:839" file="f3" line="839" extern="1" attributes="__nonnull__(,)">
    <Argument name="__attr" type="_1874r" location="f3:839" file="f3" line="839"/>
    <Argument name="__kind" type="_1859r" location="f3:839" file="f3" line="839"/>
  </Function>
  <Function id="_1809" name="xcb_get_atom_name_reply" returns="_4977" context="_1" location="f0:7661" file="f0" line="7661" extern="1">
    <Argument name="c" type="_1864" location="f0:7661" file="f0" line="7661"/>
    <Argument name="cookie" type="_1548" location="f0:7661" file="f0" line="7661"/>
    <Argument name="e" type="_2125" location="f0:7661" file="f0" line="7661"/>
  </Function>
  <Typedef id="_1810" name="__int32_t" type="_172" context="_1" location="f13:40" file="f13" line="40"/>
  <Struct id="_1811" name="xcb_font_iterator_t" context="_1" mangled="19xcb_font_iterator_t" demangled="xcb_font_iterator_t" location="f0:76" file="f0" line="76" artificial="1" size="128" align="64" members="_4978 _4979 _4980 _4981 _4982 _4983 _4984 " bases=""/>
  <Typedef id="_1812" name="xcb_font_iterator_t" type="_1811" context="_1" location="f0:80" file="f0" line="80"/>
  <Struct id="_1813" name="xcb_extension_t" context="_1" incomplete="1" mangled="15xcb_extension_t" demangled="xcb_extension_t" location="f14:331" file="f14" line="331" artificial="1" align="8"/>
  <Typedef id="_1814" name="xcb_extension_t" type="_1813" context="_1" location="f14:331" file="f14" line="331"/>
  <Function id="_1815" name="xcb_poly_line_checked" returns="_967" context="_1" location="f0:12301" file="f0" line="12301" extern="1">
    <Argument name="c" type="_1864" location="f0:12301" file="f0" line="12301"/>
    <Argument name="coordinate_mode" type="_1416" location="f0:12301" file="f0" line="12301"/>
    <Argument name="drawable" type="_840" location="f0:12301" file="f0" line="12301"/>
    <Argument name="gc" type="_1719" location="f0:12301" file="f0" line="12301"/>
    <Argument name="points_len" type="_669" location="f0:12301" file="f0" line="12301"/>
    <Argument name="points" type="_2913" location="f0:12301" file="f0" line="12301"/>
  </Function>
  <Function id="_1816" name="xcb_free_colors_checked" returns="_967" context="_1" location="f0:14387" file="f0" line="14387" extern="1">
    <Argument name="c" type="_1864" location="f0:14387" file="f0" line="14387"/>
    <Argument name="cmap" type="_690" location="f0:14387" file="f0" line="14387"/>
    <Argument name="plane_mask" type="_669" location="f0:14387" file="f0" line="14387"/>
    <Argument name="pixels_len" type="_669" location="f0:14387" file="f0" line="14387"/>
    <Argument name="pixels" type="_1873" location="f0:14387" file="f0" line="14387"/>
  </Function>
  <Function id="_1817" name="xcb_grab_pointer_unchecked" returns="_708" context="_1" location="f0:8608" file="f0" line="8608" extern="1">
    <Argument name="c" type="_1864" location="f0:8608" file="f0" line="8608"/>
    <Argument name="owner_events" type="_1416" location="f0:8608" file="f0" line="8608"/>
    <Argument name="grab_window" type="_649" location="f0:8608" file="f0" line="8608"/>
    <Argument name="event_mask" type="_1343" location="f0:8608" file="f0" line="8608"/>
    <Argument name="pointer_mode" type="_1416" location="f0:8608" file="f0" line="8608"/>
    <Argument name="keyboard_mode" type="_1416" location="f0:8608" file="f0" line="8608"/>
    <Argument name="confine_to" type="_649" location="f0:8608" file="f0" line="8608"/>
    <Argument name="cursor" type="_1016" location="f0:8608" file="f0" line="8608"/>
    <Argument name="time" type="_1208" location="f0:8608" file="f0" line="8608"/>
  </Function>
  <Typedef id="_1818" name="__caddr_t" type="_1076" context="_1" location="f13:183" file="f13" line="183"/>
  <Field id="_1819" name="data" type="_4985" offset="0" context="_3" access="public" location="f0:3879" file="f0" line="3879"/>
  <Field id="_1820" name="rem" type="_172" offset="64" context="_3" access="public" location="f0:3880" file="f0" line="3880"/>
  <Field id="_1821" name="index" type="_172" offset="96" context="_3" access="public" location="f0:3881" file="f0" line="3881"/>
  <Destructor id="_1822" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tD1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::~xcb_coloritem_iterator_t()" location="f0:3878" file="f0" line="3878" endline="3878" inline="1">
  </Destructor>
  <OperatorMethod id="_1823" name="=" returns="_4986" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_taSERKS_" demangled="xcb_coloritem_iterator_t::operator=(xcb_coloritem_iterator_t const&amp;)" location="f0:3878" file="f0" line="3878" endline="3878" inline="1">
    <Argument type="_4987" location="f0:3878" file="f0" line="3878"/>
  </OperatorMethod>
  <Constructor id="_1824" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t(xcb_coloritem_iterator_t const&amp;)" location="f0:3878" file="f0" line="3878" endline="3878" inline="1">
    <Argument type="_4987" location="f0:3878" file="f0" line="3878"/>
  </Constructor>
  <Constructor id="_1825" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t()" location="f0:3878" file="f0" line="3878" inline="1"/>
  <Field id="_1826" name="it_interval" type="_743" offset="0" context="_5" access="public" location="f1:163" file="f1" line="163"/>
  <Field id="_1827" name="it_value" type="_743" offset="128" context="_5" access="public" location="f1:164" file="f1" line="164"/>
  <Destructor id="_1828" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecD1Ev *INTERNAL* " demangled="itimerspec::~itimerspec()" location="f1:162" file="f1" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_1829" name="=" returns="_4988" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecaSERKS_" demangled="itimerspec::operator=(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_4989" location="f1:162" file="f1" line="162"/>
  </OperatorMethod>
  <Constructor id="_1830" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1ERKS_ *INTERNAL* " demangled="itimerspec::itimerspec(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_4989" location="f1:162" file="f1" line="162"/>
  </Constructor>
  <Constructor id="_1831" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1Ev *INTERNAL* " demangled="itimerspec::itimerspec()" location="f1:162" file="f1" line="162" inline="1"/>
  <Field id="_1832" name="response_type" type="_1416" offset="0" context="_8" access="public" location="f0:1764" file="f0" line="1764"/>
  <Field id="_1833" name="pad0" type="_1416" offset="8" context="_8" access="public" location="f0:1765" file="f0" line="1765"/>
  <Field id="_1834" name="sequence" type="_1343" offset="16" context="_8" access="public" location="f0:1766" file="f0" line="1766"/>
  <Field id="_1835" name="length" type="_669" offset="32" context="_8" access="public" location="f0:1767" file="f0" line="1767"/>
  <Field id="_1836" name="root" type="_649" offset="64" context="_8" access="public" location="f0:1768" file="f0" line="1768"/>
  <Field id="_1837" name="parent" type="_649" offset="96" context="_8" access="public" location="f0:1769" file="f0" line="1769"/>
  <Field id="_1838" name="children_len" type="_1343" offset="128" context="_8" access="public" location="f0:1770" file="f0" line="1770"/>
  <Field id="_1839" name="pad1" type="_4990" offset="144" context="_8" access="public" location="f0:1771" file="f0" line="1771"/>
  <Destructor id="_1840" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tD1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::~xcb_query_tree_reply_t()" location="f0:1763" file="f0" line="1763" endline="1763" inline="1">
  </Destructor>
  <OperatorMethod id="_1841" name="=" returns="_4991" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_taSERKS_" demangled="xcb_query_tree_reply_t::operator=(xcb_query_tree_reply_t const&amp;)" location="f0:1763" file="f0" line="1763" endline="1763" inline="1">
    <Argument type="_4992" location="f0:1763" file="f0" line="1763"/>
  </OperatorMethod>
  <Constructor id="_1842" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t(xcb_query_tree_reply_t const&amp;)" location="f0:1763" file="f0" line="1763" endline="1763" inline="1">
    <Argument type="_4992" location="f0:1763" file="f0" line="1763"/>
  </Constructor>
  <Constructor id="_1843" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t()" location="f0:1763" file="f0" line="1763" inline="1"/>
  <FundamentalType id="_1844" name="double" size="64" align="64"/>
  <PointerType id="_1845" type="_3889c" size="64" align="64"/>
  <Field id="_1846" name="major_opcode" type="_1416" offset="0" context="_11" access="public" location="f0:3498" file="f0" line="3498"/>
  <Field id="_1847" name="format" type="_1416" offset="8" context="_11" access="public" location="f0:3499" file="f0" line="3499"/>
  <Field id="_1848" name="length" type="_1343" offset="16" context="_11" access="public" location="f0:3500" file="f0" line="3500"/>
  <Field id="_1849" name="drawable" type="_840" offset="32" context="_11" access="public" location="f0:3501" file="f0" line="3501"/>
  <Field id="_1850" name="x" type="_846" offset="64" context="_11" access="public" location="f0:3502" file="f0" line="3502"/>
  <Field id="_1851" name="y" type="_846" offset="80" context="_11" access="public" location="f0:3503" file="f0" line="3503"/>
  <Field id="_1852" name="width" type="_1343" offset="96" context="_11" access="public" location="f0:3504" file="f0" line="3504"/>
  <Field id="_1853" name="height" type="_1343" offset="112" context="_11" access="public" location="f0:3505" file="f0" line="3505"/>
  <Field id="_1854" name="plane_mask" type="_669" offset="128" context="_11" access="public" location="f0:3506" file="f0" line="3506"/>
  <Destructor id="_1855" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tD1Ev *INTERNAL* " demangled="xcb_get_image_request_t::~xcb_get_image_request_t()" location="f0:3497" file="f0" line="3497" endline="3497" inline="1">
  </Destructor>
  <OperatorMethod id="_1856" name="=" returns="_4994" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_taSERKS_" demangled="xcb_get_image_request_t::operator=(xcb_get_image_request_t const&amp;)" location="f0:3497" file="f0" line="3497" endline="3497" inline="1">
    <Argument type="_4995" location="f0:3497" file="f0" line="3497"/>
  </OperatorMethod>
  <Constructor id="_1857" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t(xcb_get_image_request_t const&amp;)" location="f0:3497" file="f0" line="3497" endline="3497" inline="1">
    <Argument type="_4995" location="f0:3497" file="f0" line="3497"/>
  </Constructor>
  <Constructor id="_1858" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tC1Ev *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t()" location="f0:3497" file="f0" line="3497" inline="1"/>
  <PointerType id="_1859" type="_172" size="64" align="64"/>
  <CvQualifiedType id="_1859r" type="_1859" restrict="1"/>
  <PointerType id="_1861" type="_615" size="64" align="64"/>
  <CvQualifiedType id="_1861r" type="_1861" restrict="1"/>
  <FundamentalType id="_1863" name="float" size="32" align="32"/>
  <PointerType id="_1864" type="_1425" size="64" align="64"/>
  <FundamentalType id="_1865" name="long double" size="128" align="128"/>
  <PointerType id="_1866" type="_1993c" size="64" align="64"/>
  <Field id="_1867" name="tv_sec" type="_1010" offset="0" context="_18" access="public" location="f4:32" file="f4" line="32"/>
  <Field id="_1868" name="tv_usec" type="_189" offset="64" context="_18" access="public" location="f4:33" file="f4" line="33"/>
  <Destructor id="_1869" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f4:31" file="f4" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1870" name="=" returns="_4997" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_4998" location="f4:31" file="f4" line="31"/>
  </OperatorMethod>
  <Constructor id="_1871" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_4998" location="f4:31" file="f4" line="31"/>
  </Constructor>
  <Constructor id="_1872" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f4:31" file="f4" line="31" inline="1"/>
  <PointerType id="_1873" type="_669c" size="64" align="64"/>
  <PointerType id="_1874" type="_327c" size="64" align="64"/>
  <CvQualifiedType id="_1874r" type="_1874" restrict="1"/>
  <Field id="_1876" name="tm_sec" type="_172" offset="0" context="_25" access="public" location="f1:135" file="f1" line="135"/>
  <Field id="_1877" name="tm_min" type="_172" offset="32" context="_25" access="public" location="f1:136" file="f1" line="136"/>
  <Field id="_1878" name="tm_hour" type="_172" offset="64" context="_25" access="public" location="f1:137" file="f1" line="137"/>
  <Field id="_1879" name="tm_mday" type="_172" offset="96" context="_25" access="public" location="f1:138" file="f1" line="138"/>
  <Field id="_1880" name="tm_mon" type="_172" offset="128" context="_25" access="public" location="f1:139" file="f1" line="139"/>
  <Field id="_1881" name="tm_year" type="_172" offset="160" context="_25" access="public" location="f1:140" file="f1" line="140"/>
  <Field id="_1882" name="tm_wday" type="_172" offset="192" context="_25" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_1883" name="tm_yday" type="_172" offset="224" context="_25" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_1884" name="tm_isdst" type="_172" offset="256" context="_25" access="public" location="f1:143" file="f1" line="143"/>
  <Field id="_1885" name="tm_gmtoff" type="_29" offset="320" context="_25" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_1886" name="tm_zone" type="_1845" offset="384" context="_25" access="public" location="f1:147" file="f1" line="147"/>
  <Destructor id="_1887" name="tm" artificial="1" throw="" context="_25" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f1:134" file="f1" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_1888" name="=" returns="_5001" artificial="1" throw="" context="_25" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5002" location="f1:134" file="f1" line="134"/>
  </OperatorMethod>
  <Constructor id="_1889" name="tm" artificial="1" throw="" context="_25" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5002" location="f1:134" file="f1" line="134"/>
  </Constructor>
  <Constructor id="_1890" name="tm" artificial="1" throw="" context="_25" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f1:134" file="f1" line="134" inline="1"/>
  <FundamentalType id="_1891" name="bool" size="8" align="8"/>
  <Field id="_1892" name="response_type" type="_1416" offset="0" context="_27" access="public" location="f0:1226" file="f0" line="1226"/>
  <Field id="_1893" name="error_code" type="_1416" offset="8" context="_27" access="public" location="f0:1227" file="f0" line="1227"/>
  <Field id="_1894" name="sequence" type="_1343" offset="16" context="_27" access="public" location="f0:1228" file="f0" line="1228"/>
  <Field id="_1895" name="bad_value" type="_669" offset="32" context="_27" access="public" location="f0:1229" file="f0" line="1229"/>
  <Field id="_1896" name="minor_opcode" type="_1343" offset="64" context="_27" access="public" location="f0:1230" file="f0" line="1230"/>
  <Field id="_1897" name="major_opcode" type="_1416" offset="80" context="_27" access="public" location="f0:1231" file="f0" line="1231"/>
  <Field id="_1898" name="pad0" type="_1416" offset="88" context="_27" access="public" location="f0:1232" file="f0" line="1232"/>
  <Destructor id="_1899" name="xcb_request_error_t" artificial="1" throw="" context="_27" access="public" mangled="_ZN19xcb_request_error_tD1Ev *INTERNAL* " demangled="xcb_request_error_t::~xcb_request_error_t()" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
  </Destructor>
  <OperatorMethod id="_1900" name="=" returns="_5003" artificial="1" throw="" context="_27" access="public" mangled="_ZN19xcb_request_error_taSERKS_" demangled="xcb_request_error_t::operator=(xcb_request_error_t const&amp;)" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
    <Argument type="_5004" location="f0:1225" file="f0" line="1225"/>
  </OperatorMethod>
  <Constructor id="_1901" name="xcb_request_error_t" artificial="1" throw="" context="_27" access="public" mangled="_ZN19xcb_request_error_tC1ERKS_ *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t(xcb_request_error_t const&amp;)" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
    <Argument type="_5004" location="f0:1225" file="f0" line="1225"/>
  </Constructor>
  <Constructor id="_1902" name="xcb_request_error_t" artificial="1" throw="" context="_27" access="public" mangled="_ZN19xcb_request_error_tC1Ev *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t()" location="f0:1225" file="f0" line="1225" inline="1"/>
  <Field id="_1903" name="major_opcode" type="_1416" offset="0" context="_33" access="public" location="f0:1904" file="f0" line="1904"/>
  <Field id="_1904" name="_delete" type="_1416" offset="8" context="_33" access="public" location="f0:1905" file="f0" line="1905"/>
  <Field id="_1905" name="length" type="_1343" offset="16" context="_33" access="public" location="f0:1906" file="f0" line="1906"/>
  <Field id="_1906" name="window" type="_649" offset="32" context="_33" access="public" location="f0:1907" file="f0" line="1907"/>
  <Field id="_1907" name="property" type="_1607" offset="64" context="_33" access="public" location="f0:1908" file="f0" line="1908"/>
  <Field id="_1908" name="type" type="_1607" offset="96" context="_33" access="public" location="f0:1909" file="f0" line="1909"/>
  <Field id="_1909" name="long_offset" type="_669" offset="128" context="_33" access="public" location="f0:1910" file="f0" line="1910"/>
  <Field id="_1910" name="long_length" type="_669" offset="160" context="_33" access="public" location="f0:1911" file="f0" line="1911"/>
  <Destructor id="_1911" name="xcb_get_property_request_t" artificial="1" throw="" context="_33" access="public" mangled="_ZN26xcb_get_property_request_tD1Ev *INTERNAL* " demangled="xcb_get_property_request_t::~xcb_get_property_request_t()" location="f0:1903" file="f0" line="1903" endline="1903" inline="1">
  </Destructor>
  <OperatorMethod id="_1912" name="=" returns="_5005" artificial="1" throw="" context="_33" access="public" mangled="_ZN26xcb_get_property_request_taSERKS_" demangled="xcb_get_property_request_t::operator=(xcb_get_property_request_t const&amp;)" location="f0:1903" file="f0" line="1903" endline="1903" inline="1">
    <Argument type="_5006" location="f0:1903" file="f0" line="1903"/>
  </OperatorMethod>
  <Constructor id="_1913" name="xcb_get_property_request_t" artificial="1" throw="" context="_33" access="public" mangled="_ZN26xcb_get_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t(xcb_get_property_request_t const&amp;)" location="f0:1903" file="f0" line="1903" endline="1903" inline="1">
    <Argument type="_5006" location="f0:1903" file="f0" line="1903"/>
  </Constructor>
  <Constructor id="_1914" name="xcb_get_property_request_t" artificial="1" throw="" context="_33" access="public" mangled="_ZN26xcb_get_property_request_tC1Ev *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t()" location="f0:1903" file="f0" line="1903" inline="1"/>
  <Field id="_1915" name="data" type="_5007" offset="0" context="_37" access="public" location="f0:3359" file="f0" line="3359"/>
  <Field id="_1916" name="rem" type="_172" offset="64" context="_37" access="public" location="f0:3360" file="f0" line="3360"/>
  <Field id="_1917" name="index" type="_172" offset="96" context="_37" access="public" location="f0:3361" file="f0" line="3361"/>
  <Destructor id="_1918" name="xcb_segment_iterator_t" artificial="1" throw="" context="_37" access="public" mangled="_ZN22xcb_segment_iterator_tD1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::~xcb_segment_iterator_t()" location="f0:3358" file="f0" line="3358" endline="3358" inline="1">
  </Destructor>
  <OperatorMethod id="_1919" name="=" returns="_5008" artificial="1" throw="" context="_37" access="public" mangled="_ZN22xcb_segment_iterator_taSERKS_" demangled="xcb_segment_iterator_t::operator=(xcb_segment_iterator_t const&amp;)" location="f0:3358" file="f0" line="3358" endline="3358" inline="1">
    <Argument type="_5009" location="f0:3358" file="f0" line="3358"/>
  </OperatorMethod>
  <Constructor id="_1920" name="xcb_segment_iterator_t" artificial="1" throw="" context="_37" access="public" mangled="_ZN22xcb_segment_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t(xcb_segment_iterator_t const&amp;)" location="f0:3358" file="f0" line="3358" endline="3358" inline="1">
    <Argument type="_5009" location="f0:3358" file="f0" line="3358"/>
  </Constructor>
  <Constructor id="_1921" name="xcb_segment_iterator_t" artificial="1" throw="" context="_37" access="public" mangled="_ZN22xcb_segment_iterator_tC1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t()" location="f0:3358" file="f0" line="3358" inline="1"/>
  <PointerType id="_1922" type="_345" size="64" align="64"/>
  <FundamentalType id="_1923" name="long long int" size="64" align="64"/>
  <FundamentalType id="_1924" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1925" name="complex long double" size="256" align="128"/>
  <Field id="_1926" name="data" type="_5010" offset="0" context="_49" access="public" location="f0:204" file="f0" line="204"/>
  <Field id="_1927" name="rem" type="_172" offset="64" context="_49" access="public" location="f0:205" file="f0" line="205"/>
  <Field id="_1928" name="index" type="_172" offset="96" context="_49" access="public" location="f0:206" file="f0" line="206"/>
  <Destructor id="_1929" name="xcb_point_iterator_t" artificial="1" throw="" context="_49" access="public" mangled="_ZN20xcb_point_iterator_tD1Ev *INTERNAL* " demangled="xcb_point_iterator_t::~xcb_point_iterator_t()" location="f0:203" file="f0" line="203" endline="203" inline="1">
  </Destructor>
  <OperatorMethod id="_1930" name="=" returns="_5011" artificial="1" throw="" context="_49" access="public" mangled="_ZN20xcb_point_iterator_taSERKS_" demangled="xcb_point_iterator_t::operator=(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5012" location="f0:203" file="f0" line="203"/>
  </OperatorMethod>
  <Constructor id="_1931" name="xcb_point_iterator_t" artificial="1" throw="" context="_49" access="public" mangled="_ZN20xcb_point_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5012" location="f0:203" file="f0" line="203"/>
  </Constructor>
  <Constructor id="_1932" name="xcb_point_iterator_t" artificial="1" throw="" context="_49" access="public" mangled="_ZN20xcb_point_iterator_tC1Ev *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t()" location="f0:203" file="f0" line="203" inline="1"/>
  <Field id="_1933" name="major_opcode" type="_1416" offset="0" context="_52" access="public" location="f0:3817" file="f0" line="3817"/>
  <Field id="_1934" name="contiguous" type="_1416" offset="8" context="_52" access="public" location="f0:3818" file="f0" line="3818"/>
  <Field id="_1935" name="length" type="_1343" offset="16" context="_52" access="public" location="f0:3819" file="f0" line="3819"/>
  <Field id="_1936" name="cmap" type="_690" offset="32" context="_52" access="public" location="f0:3820" file="f0" line="3820"/>
  <Field id="_1937" name="colors" type="_1343" offset="64" context="_52" access="public" location="f0:3821" file="f0" line="3821"/>
  <Field id="_1938" name="reds" type="_1343" offset="80" context="_52" access="public" location="f0:3822" file="f0" line="3822"/>
  <Field id="_1939" name="greens" type="_1343" offset="96" context="_52" access="public" location="f0:3823" file="f0" line="3823"/>
  <Field id="_1940" name="blues" type="_1343" offset="112" context="_52" access="public" location="f0:3824" file="f0" line="3824"/>
  <Destructor id="_1941" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tD1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::~xcb_alloc_color_planes_request_t()" location="f0:3816" file="f0" line="3816" endline="3816" inline="1">
  </Destructor>
  <OperatorMethod id="_1942" name="=" returns="_5013" artificial="1" throw="" context="_52" access="public" mangled="_ZN32xcb_alloc_color_planes_request_taSERKS_" demangled="xcb_alloc_color_planes_request_t::operator=(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3816" file="f0" line="3816" endline="3816" inline="1">
    <Argument type="_5014" location="f0:3816" file="f0" line="3816"/>
  </OperatorMethod>
  <Constructor id="_1943" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3816" file="f0" line="3816" endline="3816" inline="1">
    <Argument type="_5014" location="f0:3816" file="f0" line="3816"/>
  </Constructor>
  <Constructor id="_1944" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t()" location="f0:3816" file="f0" line="3816" inline="1"/>
  <Field id="_1945" name="__size" type="_5015" offset="0" context="_57" access="public" location="f8:157" file="f8" line="157"/>
  <Field id="_1946" name="__align" type="_172" offset="0" context="_57" access="public" location="f8:158" file="f8" line="158"/>
  <Destructor id="_1947" name="._7" artificial="1" throw="" context="_57" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f8:159" file="f8" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_1948" name="=" returns="_5016" artificial="1" throw="" context="_57" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f8:159" file="f8" line="159" endline="159" inline="1">
    <Argument type="_5017" location="f8:156" file="f8" line="156"/>
  </OperatorMethod>
  <Constructor id="_1949" name="._7" artificial="1" throw="" context="_57" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f8:159" file="f8" line="159" endline="159" inline="1">
    <Argument type="_5017" location="f8:156" file="f8" line="156"/>
  </Constructor>
  <Constructor id="_1950" name="._7" artificial="1" throw="" context="_57" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f8:159" file="f8" line="159" inline="1"/>
  <PointerType id="_1951" type="_675c" size="64" align="64"/>
  <PointerType id="_1952" type="_1416" size="64" align="64"/>
  <PointerType id="_1953" type="_1796c" size="64" align="64"/>
  <Field id="_1954" name="sequence" type="_90" offset="0" context="_60" access="public" location="f0:2698" file="f0" line="2698"/>
  <Destructor id="_1955" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_60" access="public" mangled="_ZN23xcb_query_font_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::~xcb_query_font_cookie_t()" location="f0:2697" file="f0" line="2697" endline="2697" inline="1">
  </Destructor>
  <OperatorMethod id="_1956" name="=" returns="_5020" artificial="1" throw="" context="_60" access="public" mangled="_ZN23xcb_query_font_cookie_taSERKS_" demangled="xcb_query_font_cookie_t::operator=(xcb_query_font_cookie_t const&amp;)" location="f0:2697" file="f0" line="2697" endline="2697" inline="1">
    <Argument type="_5021" location="f0:2697" file="f0" line="2697"/>
  </OperatorMethod>
  <Constructor id="_1957" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_60" access="public" mangled="_ZN23xcb_query_font_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t(xcb_query_font_cookie_t const&amp;)" location="f0:2697" file="f0" line="2697" endline="2697" inline="1">
    <Argument type="_5021" location="f0:2697" file="f0" line="2697"/>
  </Constructor>
  <Constructor id="_1958" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_60" access="public" mangled="_ZN23xcb_query_font_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t()" location="f0:2697" file="f0" line="2697" inline="1"/>
  <PointerType id="_1959" type="_867c" size="64" align="64"/>
  <Field id="_1960" name="major_opcode" type="_1416" offset="0" context="_64" access="public" location="f0:3978" file="f0" line="3978"/>
  <Field id="_1961" name="pad0" type="_1416" offset="8" context="_64" access="public" location="f0:3979" file="f0" line="3979"/>
  <Field id="_1962" name="length" type="_1343" offset="16" context="_64" access="public" location="f0:3980" file="f0" line="3980"/>
  <Field id="_1963" name="cmap" type="_690" offset="32" context="_64" access="public" location="f0:3981" file="f0" line="3981"/>
  <Field id="_1964" name="name_len" type="_1343" offset="64" context="_64" access="public" location="f0:3982" file="f0" line="3982"/>
  <Field id="_1965" name="pad1" type="_5023" offset="80" context="_64" access="public" location="f0:3983" file="f0" line="3983"/>
  <Destructor id="_1966" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN26xcb_lookup_color_request_tD1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::~xcb_lookup_color_request_t()" location="f0:3977" file="f0" line="3977" endline="3977" inline="1">
  </Destructor>
  <OperatorMethod id="_1967" name="=" returns="_5024" artificial="1" throw="" context="_64" access="public" mangled="_ZN26xcb_lookup_color_request_taSERKS_" demangled="xcb_lookup_color_request_t::operator=(xcb_lookup_color_request_t const&amp;)" location="f0:3977" file="f0" line="3977" endline="3977" inline="1">
    <Argument type="_5025" location="f0:3977" file="f0" line="3977"/>
  </OperatorMethod>
  <Constructor id="_1968" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN26xcb_lookup_color_request_tC1ERKS_ *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t(xcb_lookup_color_request_t const&amp;)" location="f0:3977" file="f0" line="3977" endline="3977" inline="1">
    <Argument type="_5025" location="f0:3977" file="f0" line="3977"/>
  </Constructor>
  <Constructor id="_1969" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN26xcb_lookup_color_request_tC1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t()" location="f0:3977" file="f0" line="3977" inline="1"/>
  <Field id="_1970" name="major_opcode" type="_1416" offset="0" context="_66" access="public" location="f0:1578" file="f0" line="1578"/>
  <Field id="_1971" name="mode" type="_1416" offset="8" context="_66" access="public" location="f0:1579" file="f0" line="1579"/>
  <Field id="_1972" name="length" type="_1343" offset="16" context="_66" access="public" location="f0:1580" file="f0" line="1580"/>
  <Field id="_1973" name="window" type="_649" offset="32" context="_66" access="public" location="f0:1581" file="f0" line="1581"/>
  <Destructor id="_1974" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_66" access="public" mangled="_ZN29xcb_change_save_set_request_tD1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::~xcb_change_save_set_request_t()" location="f0:1577" file="f0" line="1577" endline="1577" inline="1">
  </Destructor>
  <OperatorMethod id="_1975" name="=" returns="_5026" artificial="1" throw="" context="_66" access="public" mangled="_ZN29xcb_change_save_set_request_taSERKS_" demangled="xcb_change_save_set_request_t::operator=(xcb_change_save_set_request_t const&amp;)" location="f0:1577" file="f0" line="1577" endline="1577" inline="1">
    <Argument type="_5027" location="f0:1577" file="f0" line="1577"/>
  </OperatorMethod>
  <Constructor id="_1976" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_66" access="public" mangled="_ZN29xcb_change_save_set_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t(xcb_change_save_set_request_t const&amp;)" location="f0:1577" file="f0" line="1577" endline="1577" inline="1">
    <Argument type="_5027" location="f0:1577" file="f0" line="1577"/>
  </Constructor>
  <Constructor id="_1977" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_66" access="public" mangled="_ZN29xcb_change_save_set_request_tC1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t()" location="f0:1577" file="f0" line="1577" inline="1"/>
  <PointerType id="_1978" type="_1416c" size="64" align="64"/>
  <Field id="_1979" name="response_type" type="_1416" offset="0" context="_69" access="public" location="f0:806" file="f0" line="806"/>
  <Field id="_1980" name="pad0" type="_1416" offset="8" context="_69" access="public" location="f0:807" file="f0" line="807"/>
  <Field id="_1981" name="sequence" type="_1343" offset="16" context="_69" access="public" location="f0:808" file="f0" line="808"/>
  <Field id="_1982" name="event" type="_649" offset="32" context="_69" access="public" location="f0:809" file="f0" line="809"/>
  <Field id="_1983" name="window" type="_649" offset="64" context="_69" access="public" location="f0:810" file="f0" line="810"/>
  <Field id="_1984" name="from_configure" type="_1416" offset="96" context="_69" access="public" location="f0:811" file="f0" line="811"/>
  <Field id="_1985" name="pad1" type="_5029" offset="104" context="_69" access="public" location="f0:812" file="f0" line="812"/>
  <Destructor id="_1986" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN24xcb_unmap_notify_event_tD1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::~xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" endline="805" inline="1">
  </Destructor>
  <OperatorMethod id="_1987" name="=" returns="_5030" artificial="1" throw="" context="_69" access="public" mangled="_ZN24xcb_unmap_notify_event_taSERKS_" demangled="xcb_unmap_notify_event_t::operator=(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5031" location="f0:805" file="f0" line="805"/>
  </OperatorMethod>
  <Constructor id="_1988" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5031" location="f0:805" file="f0" line="805"/>
  </Constructor>
  <Constructor id="_1989" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" inline="1"/>
  <PointerType id="_1990" type="_669" size="64" align="64"/>
  <PointerType id="_1991" type="_1284c" size="64" align="64"/>
  <PointerType id="_1992" type="_353" size="64" align="64"/>
  <FundamentalType id="_1993" name="void" align="8"/>
  <PointerType id="_1994" type="_147" size="64" align="64"/>
  <Field id="_1995" name="response_type" type="_1416" offset="0" context="_79" access="public" location="f0:524" file="f0" line="524"/>
  <Field id="_1996" name="detail" type="_867" offset="8" context="_79" access="public" location="f0:525" file="f0" line="525"/>
  <Field id="_1997" name="sequence" type="_1343" offset="16" context="_79" access="public" location="f0:526" file="f0" line="526"/>
  <Field id="_1998" name="time" type="_1208" offset="32" context="_79" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_1999" name="root" type="_649" offset="64" context="_79" access="public" location="f0:528" file="f0" line="528"/>
  <Field id="_2000" name="event" type="_649" offset="96" context="_79" access="public" location="f0:529" file="f0" line="529"/>
  <Field id="_2001" name="child" type="_649" offset="128" context="_79" access="public" location="f0:530" file="f0" line="530"/>
  <Field id="_2002" name="root_x" type="_846" offset="160" context="_79" access="public" location="f0:531" file="f0" line="531"/>
  <Field id="_2003" name="root_y" type="_846" offset="176" context="_79" access="public" location="f0:532" file="f0" line="532"/>
  <Field id="_2004" name="event_x" type="_846" offset="192" context="_79" access="public" location="f0:533" file="f0" line="533"/>
  <Field id="_2005" name="event_y" type="_846" offset="208" context="_79" access="public" location="f0:534" file="f0" line="534"/>
  <Field id="_2006" name="state" type="_1343" offset="224" context="_79" access="public" location="f0:535" file="f0" line="535"/>
  <Field id="_2007" name="same_screen" type="_1416" offset="240" context="_79" access="public" location="f0:536" file="f0" line="536"/>
  <Field id="_2008" name="pad0" type="_1416" offset="248" context="_79" access="public" location="f0:537" file="f0" line="537"/>
  <Destructor id="_2009" name="xcb_key_press_event_t" artificial="1" throw="" context="_79" access="public" mangled="_ZN21xcb_key_press_event_tD1Ev *INTERNAL* " demangled="xcb_key_press_event_t::~xcb_key_press_event_t()" location="f0:523" file="f0" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_2010" name="=" returns="_5033" artificial="1" throw="" context="_79" access="public" mangled="_ZN21xcb_key_press_event_taSERKS_" demangled="xcb_key_press_event_t::operator=(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5034" location="f0:523" file="f0" line="523"/>
  </OperatorMethod>
  <Constructor id="_2011" name="xcb_key_press_event_t" artificial="1" throw="" context="_79" access="public" mangled="_ZN21xcb_key_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5034" location="f0:523" file="f0" line="523"/>
  </Constructor>
  <Constructor id="_2012" name="xcb_key_press_event_t" artificial="1" throw="" context="_79" access="public" mangled="_ZN21xcb_key_press_event_tC1Ev *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t()" location="f0:523" file="f0" line="523" inline="1"/>
  <Field id="_2013" name="response_type" type="_1416" offset="0" context="_81" access="public" location="f0:2216" file="f0" line="2216"/>
  <Field id="_2014" name="status" type="_1416" offset="8" context="_81" access="public" location="f0:2217" file="f0" line="2217"/>
  <Field id="_2015" name="sequence" type="_1343" offset="16" context="_81" access="public" location="f0:2218" file="f0" line="2218"/>
  <Field id="_2016" name="length" type="_669" offset="32" context="_81" access="public" location="f0:2219" file="f0" line="2219"/>
  <Destructor id="_2017" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_81" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::~xcb_grab_keyboard_reply_t()" location="f0:2215" file="f0" line="2215" endline="2215" inline="1">
  </Destructor>
  <OperatorMethod id="_2018" name="=" returns="_5035" artificial="1" throw="" context="_81" access="public" mangled="_ZN25xcb_grab_keyboard_reply_taSERKS_" demangled="xcb_grab_keyboard_reply_t::operator=(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2215" file="f0" line="2215" endline="2215" inline="1">
    <Argument type="_5036" location="f0:2215" file="f0" line="2215"/>
  </OperatorMethod>
  <Constructor id="_2019" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_81" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2215" file="f0" line="2215" endline="2215" inline="1">
    <Argument type="_5036" location="f0:2215" file="f0" line="2215"/>
  </Constructor>
  <Constructor id="_2020" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_81" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t()" location="f0:2215" file="f0" line="2215" inline="1"/>
  <PointerType id="_2021" type="_659c" size="64" align="64"/>
  <Field id="_2022" name="sequence" type="_90" offset="0" context="_85" access="public" location="f0:2889" file="f0" line="2889"/>
  <Destructor id="_2023" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_85" access="public" mangled="_ZN26xcb_get_font_path_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::~xcb_get_font_path_cookie_t()" location="f0:2888" file="f0" line="2888" endline="2888" inline="1">
  </Destructor>
  <OperatorMethod id="_2024" name="=" returns="_5038" artificial="1" throw="" context="_85" access="public" mangled="_ZN26xcb_get_font_path_cookie_taSERKS_" demangled="xcb_get_font_path_cookie_t::operator=(xcb_get_font_path_cookie_t const&amp;)" location="f0:2888" file="f0" line="2888" endline="2888" inline="1">
    <Argument type="_5039" location="f0:2888" file="f0" line="2888"/>
  </OperatorMethod>
  <Constructor id="_2025" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_85" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t(xcb_get_font_path_cookie_t const&amp;)" location="f0:2888" file="f0" line="2888" endline="2888" inline="1">
    <Argument type="_5039" location="f0:2888" file="f0" line="2888"/>
  </Constructor>
  <Constructor id="_2026" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_85" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t()" location="f0:2888" file="f0" line="2888" inline="1"/>
  <PointerType id="_2027" type="_1812" size="64" align="64"/>
  <Field id="_2028" name="response_type" type="_1416" offset="0" context="_92" access="public" location="f0:2908" file="f0" line="2908"/>
  <Field id="_2029" name="pad0" type="_1416" offset="8" context="_92" access="public" location="f0:2909" file="f0" line="2909"/>
  <Field id="_2030" name="sequence" type="_1343" offset="16" context="_92" access="public" location="f0:2910" file="f0" line="2910"/>
  <Field id="_2031" name="length" type="_669" offset="32" context="_92" access="public" location="f0:2911" file="f0" line="2911"/>
  <Field id="_2032" name="path_len" type="_1343" offset="64" context="_92" access="public" location="f0:2912" file="f0" line="2912"/>
  <Field id="_2033" name="pad1" type="_5040" offset="80" context="_92" access="public" location="f0:2913" file="f0" line="2913"/>
  <Destructor id="_2034" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN25xcb_get_font_path_reply_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::~xcb_get_font_path_reply_t()" location="f0:2907" file="f0" line="2907" endline="2907" inline="1">
  </Destructor>
  <OperatorMethod id="_2035" name="=" returns="_5041" artificial="1" throw="" context="_92" access="public" mangled="_ZN25xcb_get_font_path_reply_taSERKS_" demangled="xcb_get_font_path_reply_t::operator=(xcb_get_font_path_reply_t const&amp;)" location="f0:2907" file="f0" line="2907" endline="2907" inline="1">
    <Argument type="_5042" location="f0:2907" file="f0" line="2907"/>
  </OperatorMethod>
  <Constructor id="_2036" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t(xcb_get_font_path_reply_t const&amp;)" location="f0:2907" file="f0" line="2907" endline="2907" inline="1">
    <Argument type="_5042" location="f0:2907" file="f0" line="2907"/>
  </Constructor>
  <Constructor id="_2037" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t()" location="f0:2907" file="f0" line="2907" inline="1"/>
  <Field id="_2038" name="major_opcode" type="_1416" offset="0" context="_96" access="public" location="f0:3293" file="f0" line="3293"/>
  <Field id="_2039" name="pad0" type="_1416" offset="8" context="_96" access="public" location="f0:3294" file="f0" line="3294"/>
  <Field id="_2040" name="length" type="_1343" offset="16" context="_96" access="public" location="f0:3295" file="f0" line="3295"/>
  <Field id="_2041" name="src_drawable" type="_840" offset="32" context="_96" access="public" location="f0:3296" file="f0" line="3296"/>
  <Field id="_2042" name="dst_drawable" type="_840" offset="64" context="_96" access="public" location="f0:3297" file="f0" line="3297"/>
  <Field id="_2043" name="gc" type="_1719" offset="96" context="_96" access="public" location="f0:3298" file="f0" line="3298"/>
  <Field id="_2044" name="src_x" type="_846" offset="128" context="_96" access="public" location="f0:3299" file="f0" line="3299"/>
  <Field id="_2045" name="src_y" type="_846" offset="144" context="_96" access="public" location="f0:3300" file="f0" line="3300"/>
  <Field id="_2046" name="dst_x" type="_846" offset="160" context="_96" access="public" location="f0:3301" file="f0" line="3301"/>
  <Field id="_2047" name="dst_y" type="_846" offset="176" context="_96" access="public" location="f0:3302" file="f0" line="3302"/>
  <Field id="_2048" name="width" type="_1343" offset="192" context="_96" access="public" location="f0:3303" file="f0" line="3303"/>
  <Field id="_2049" name="height" type="_1343" offset="208" context="_96" access="public" location="f0:3304" file="f0" line="3304"/>
  <Field id="_2050" name="bit_plane" type="_669" offset="224" context="_96" access="public" location="f0:3305" file="f0" line="3305"/>
  <Destructor id="_2051" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_96" access="public" mangled="_ZN24xcb_copy_plane_request_tD1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::~xcb_copy_plane_request_t()" location="f0:3292" file="f0" line="3292" endline="3292" inline="1">
  </Destructor>
  <OperatorMethod id="_2052" name="=" returns="_5043" artificial="1" throw="" context="_96" access="public" mangled="_ZN24xcb_copy_plane_request_taSERKS_" demangled="xcb_copy_plane_request_t::operator=(xcb_copy_plane_request_t const&amp;)" location="f0:3292" file="f0" line="3292" endline="3292" inline="1">
    <Argument type="_5044" location="f0:3292" file="f0" line="3292"/>
  </OperatorMethod>
  <Constructor id="_2053" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_96" access="public" mangled="_ZN24xcb_copy_plane_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t(xcb_copy_plane_request_t const&amp;)" location="f0:3292" file="f0" line="3292" endline="3292" inline="1">
    <Argument type="_5044" location="f0:3292" file="f0" line="3292"/>
  </Constructor>
  <Constructor id="_2054" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_96" access="public" mangled="_ZN24xcb_copy_plane_request_tC1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t()" location="f0:3292" file="f0" line="3292" inline="1"/>
  <Field id="_2055" name="major_opcode" type="_1416" offset="0" context="_99" access="public" location="f0:3255" file="f0" line="3255"/>
  <Field id="_2056" name="exposures" type="_1416" offset="8" context="_99" access="public" location="f0:3256" file="f0" line="3256"/>
  <Field id="_2057" name="length" type="_1343" offset="16" context="_99" access="public" location="f0:3257" file="f0" line="3257"/>
  <Field id="_2058" name="window" type="_649" offset="32" context="_99" access="public" location="f0:3258" file="f0" line="3258"/>
  <Field id="_2059" name="x" type="_846" offset="64" context="_99" access="public" location="f0:3259" file="f0" line="3259"/>
  <Field id="_2060" name="y" type="_846" offset="80" context="_99" access="public" location="f0:3260" file="f0" line="3260"/>
  <Field id="_2061" name="width" type="_1343" offset="96" context="_99" access="public" location="f0:3261" file="f0" line="3261"/>
  <Field id="_2062" name="height" type="_1343" offset="112" context="_99" access="public" location="f0:3262" file="f0" line="3262"/>
  <Destructor id="_2063" name="xcb_clear_area_request_t" artificial="1" throw="" context="_99" access="public" mangled="_ZN24xcb_clear_area_request_tD1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::~xcb_clear_area_request_t()" location="f0:3254" file="f0" line="3254" endline="3254" inline="1">
  </Destructor>
  <OperatorMethod id="_2064" name="=" returns="_5045" artificial="1" throw="" context="_99" access="public" mangled="_ZN24xcb_clear_area_request_taSERKS_" demangled="xcb_clear_area_request_t::operator=(xcb_clear_area_request_t const&amp;)" location="f0:3254" file="f0" line="3254" endline="3254" inline="1">
    <Argument type="_5046" location="f0:3254" file="f0" line="3254"/>
  </OperatorMethod>
  <Constructor id="_2065" name="xcb_clear_area_request_t" artificial="1" throw="" context="_99" access="public" mangled="_ZN24xcb_clear_area_request_tC1ERKS_ *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t(xcb_clear_area_request_t const&amp;)" location="f0:3254" file="f0" line="3254" endline="3254" inline="1">
    <Argument type="_5046" location="f0:3254" file="f0" line="3254"/>
  </Constructor>
  <Constructor id="_2066" name="xcb_clear_area_request_t" artificial="1" throw="" context="_99" access="public" mangled="_ZN24xcb_clear_area_request_tC1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t()" location="f0:3254" file="f0" line="3254" inline="1"/>
  <Field id="_2067" name="major_opcode" type="_1416" offset="0" context="_104" access="public" location="f0:4013" file="f0" line="4013"/>
  <Field id="_2068" name="pad0" type="_1416" offset="8" context="_104" access="public" location="f0:4014" file="f0" line="4014"/>
  <Field id="_2069" name="length" type="_1343" offset="16" context="_104" access="public" location="f0:4015" file="f0" line="4015"/>
  <Field id="_2070" name="cid" type="_1016" offset="32" context="_104" access="public" location="f0:4016" file="f0" line="4016"/>
  <Field id="_2071" name="source" type="_1688" offset="64" context="_104" access="public" location="f0:4017" file="f0" line="4017"/>
  <Field id="_2072" name="mask" type="_1688" offset="96" context="_104" access="public" location="f0:4018" file="f0" line="4018"/>
  <Field id="_2073" name="fore_red" type="_1343" offset="128" context="_104" access="public" location="f0:4019" file="f0" line="4019"/>
  <Field id="_2074" name="fore_green" type="_1343" offset="144" context="_104" access="public" location="f0:4020" file="f0" line="4020"/>
  <Field id="_2075" name="fore_blue" type="_1343" offset="160" context="_104" access="public" location="f0:4021" file="f0" line="4021"/>
  <Field id="_2076" name="back_red" type="_1343" offset="176" context="_104" access="public" location="f0:4022" file="f0" line="4022"/>
  <Field id="_2077" name="back_green" type="_1343" offset="192" context="_104" access="public" location="f0:4023" file="f0" line="4023"/>
  <Field id="_2078" name="back_blue" type="_1343" offset="208" context="_104" access="public" location="f0:4024" file="f0" line="4024"/>
  <Field id="_2079" name="x" type="_1343" offset="224" context="_104" access="public" location="f0:4025" file="f0" line="4025"/>
  <Field id="_2080" name="y" type="_1343" offset="240" context="_104" access="public" location="f0:4026" file="f0" line="4026"/>
  <Destructor id="_2081" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN27xcb_create_cursor_request_tD1Ev *INTERNAL* " demangled="xcb_create_cursor_request_t::~xcb_create_cursor_request_t()" location="f0:4012" file="f0" line="4012" endline="4012" inline="1">
  </Destructor>
  <OperatorMethod id="_2082" name="=" returns="_5047" artificial="1" throw="" context="_104" access="public" mangled="_ZN27xcb_create_cursor_request_taSERKS_" demangled="xcb_create_cursor_request_t::operator=(xcb_create_cursor_request_t const&amp;)" location="f0:4012" file="f0" line="4012" endline="4012" inline="1">
    <Argument type="_5048" location="f0:4012" file="f0" line="4012"/>
  </OperatorMethod>
  <Constructor id="_2083" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN27xcb_create_cursor_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_cursor_request_t::xcb_create_cursor_request_t(xcb_create_cursor_request_t const&amp;)" location="f0:4012" file="f0" line="4012" endline="4012" inline="1">
    <Argument type="_5048" location="f0:4012" file="f0" line="4012"/>
  </Constructor>
  <Constructor id="_2084" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN27xcb_create_cursor_request_tC1Ev *INTERNAL* " demangled="xcb_create_cursor_request_t::xcb_create_cursor_request_t()" location="f0:4012" file="f0" line="4012" inline="1"/>
  <Field id="_2085" name="response_type" type="_1416" offset="0" context="_108" access="public" location="f0:1210" file="f0" line="1210"/>
  <Field id="_2086" name="extension" type="_1416" offset="8" context="_108" access="public" location="f0:1211" file="f0" line="1211"/>
  <Field id="_2087" name="sequence" type="_1343" offset="16" context="_108" access="public" location="f0:1212" file="f0" line="1212"/>
  <Field id="_2088" name="length" type="_669" offset="32" context="_108" access="public" location="f0:1213" file="f0" line="1213"/>
  <Field id="_2089" name="event_type" type="_1343" offset="64" context="_108" access="public" location="f0:1214" file="f0" line="1214"/>
  <Field id="_2090" name="pad0" type="_5040" offset="80" context="_108" access="public" location="f0:1215" file="f0" line="1215"/>
  <Field id="_2091" name="full_sequence" type="_669" offset="256" context="_108" access="public" location="f0:1216" file="f0" line="1216"/>
  <Destructor id="_2092" name="xcb_ge_generic_event_t" artificial="1" throw="" context="_108" access="public" mangled="_ZN22xcb_ge_generic_event_tD1Ev *INTERNAL* " demangled="xcb_ge_generic_event_t::~xcb_ge_generic_event_t()" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
  </Destructor>
  <OperatorMethod id="_2093" name="=" returns="_5049" artificial="1" throw="" context="_108" access="public" mangled="_ZN22xcb_ge_generic_event_taSERKS_" demangled="xcb_ge_generic_event_t::operator=(xcb_ge_generic_event_t const&amp;)" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
    <Argument type="_5050" location="f0:1209" file="f0" line="1209"/>
  </OperatorMethod>
  <Constructor id="_2094" name="xcb_ge_generic_event_t" artificial="1" throw="" context="_108" access="public" mangled="_ZN22xcb_ge_generic_event_tC1ERKS_ *INTERNAL* " demangled="xcb_ge_generic_event_t::xcb_ge_generic_event_t(xcb_ge_generic_event_t const&amp;)" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
    <Argument type="_5050" location="f0:1209" file="f0" line="1209"/>
  </Constructor>
  <Constructor id="_2095" name="xcb_ge_generic_event_t" artificial="1" throw="" context="_108" access="public" mangled="_ZN22xcb_ge_generic_event_tC1Ev *INTERNAL* " demangled="xcb_ge_generic_event_t::xcb_ge_generic_event_t()" location="f0:1209" file="f0" line="1209" inline="1"/>
  <PointerType id="_2096" type="_1742" size="64" align="64"/>
  <Field id="_2097" name="response_type" type="_1416" offset="0" context="_112" access="public" location="f0:1090" file="f0" line="1090"/>
  <Field id="_2098" name="pad0" type="_1416" offset="8" context="_112" access="public" location="f0:1091" file="f0" line="1091"/>
  <Field id="_2099" name="sequence" type="_1343" offset="16" context="_112" access="public" location="f0:1092" file="f0" line="1092"/>
  <Field id="_2100" name="time" type="_1208" offset="32" context="_112" access="public" location="f0:1093" file="f0" line="1093"/>
  <Field id="_2101" name="owner" type="_649" offset="64" context="_112" access="public" location="f0:1094" file="f0" line="1094"/>
  <Field id="_2102" name="requestor" type="_649" offset="96" context="_112" access="public" location="f0:1095" file="f0" line="1095"/>
  <Field id="_2103" name="selection" type="_1607" offset="128" context="_112" access="public" location="f0:1096" file="f0" line="1096"/>
  <Field id="_2104" name="target" type="_1607" offset="160" context="_112" access="public" location="f0:1097" file="f0" line="1097"/>
  <Field id="_2105" name="property" type="_1607" offset="192" context="_112" access="public" location="f0:1098" file="f0" line="1098"/>
  <Destructor id="_2106" name="xcb_selection_request_event_t" artificial="1" throw="" context="_112" access="public" mangled="_ZN29xcb_selection_request_event_tD1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::~xcb_selection_request_event_t()" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
  </Destructor>
  <OperatorMethod id="_2107" name="=" returns="_5051" artificial="1" throw="" context="_112" access="public" mangled="_ZN29xcb_selection_request_event_taSERKS_" demangled="xcb_selection_request_event_t::operator=(xcb_selection_request_event_t const&amp;)" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
    <Argument type="_5052" location="f0:1089" file="f0" line="1089"/>
  </OperatorMethod>
  <Constructor id="_2108" name="xcb_selection_request_event_t" artificial="1" throw="" context="_112" access="public" mangled="_ZN29xcb_selection_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t(xcb_selection_request_event_t const&amp;)" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
    <Argument type="_5052" location="f0:1089" file="f0" line="1089"/>
  </Constructor>
  <Constructor id="_2109" name="xcb_selection_request_event_t" artificial="1" throw="" context="_112" access="public" mangled="_ZN29xcb_selection_request_event_tC1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t()" location="f0:1089" file="f0" line="1089" inline="1"/>
  <PointerType id="_2110" type="_537c" size="64" align="64"/>
  <Field id="_2111" name="major_opcode" type="_1416" offset="0" context="_117" access="public" location="f0:2939" file="f0" line="2939"/>
  <Field id="_2112" name="pad0" type="_1416" offset="8" context="_117" access="public" location="f0:2940" file="f0" line="2940"/>
  <Field id="_2113" name="length" type="_1343" offset="16" context="_117" access="public" location="f0:2941" file="f0" line="2941"/>
  <Field id="_2114" name="pixmap" type="_1688" offset="32" context="_117" access="public" location="f0:2942" file="f0" line="2942"/>
  <Destructor id="_2115" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_117" access="public" mangled="_ZN25xcb_free_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::~xcb_free_pixmap_request_t()" location="f0:2938" file="f0" line="2938" endline="2938" inline="1">
  </Destructor>
  <OperatorMethod id="_2116" name="=" returns="_5054" artificial="1" throw="" context="_117" access="public" mangled="_ZN25xcb_free_pixmap_request_taSERKS_" demangled="xcb_free_pixmap_request_t::operator=(xcb_free_pixmap_request_t const&amp;)" location="f0:2938" file="f0" line="2938" endline="2938" inline="1">
    <Argument type="_5055" location="f0:2938" file="f0" line="2938"/>
  </OperatorMethod>
  <Constructor id="_2117" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_117" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t(xcb_free_pixmap_request_t const&amp;)" location="f0:2938" file="f0" line="2938" endline="2938" inline="1">
    <Argument type="_5055" location="f0:2938" file="f0" line="2938"/>
  </Constructor>
  <Constructor id="_2118" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_117" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t()" location="f0:2938" file="f0" line="2938" inline="1"/>
  <Field id="_2119" name="__val" type="_5056" offset="0" context="_120" access="public" location="f10:29" file="f10" line="29"/>
  <Destructor id="_2120" name="._1" artificial="1" throw="" context="_120" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f10:30" file="f10" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_2121" name="=" returns="_5057" artificial="1" throw="" context="_120" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f10:30" file="f10" line="30" endline="30" inline="1">
    <Argument type="_5058" location="f10:28" file="f10" line="28"/>
  </OperatorMethod>
  <Constructor id="_2122" name="._1" artificial="1" throw="" context="_120" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f10:30" file="f10" line="30" endline="30" inline="1">
    <Argument type="_5058" location="f10:28" file="f10" line="28"/>
  </Constructor>
  <Constructor id="_2123" name="._1" artificial="1" throw="" context="_120" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f10:30" file="f10" line="30" inline="1"/>
  <PointerType id="_2124" type="_998" size="64" align="64"/>
  <PointerType id="_2125" type="_3882" size="64" align="64"/>
  <Field id="_2126" name="response_type" type="_1416" offset="0" context="_131" access="public" location="f0:1242" file="f0" line="1242"/>
  <Field id="_2127" name="error_code" type="_1416" offset="8" context="_131" access="public" location="f0:1243" file="f0" line="1243"/>
  <Field id="_2128" name="sequence" type="_1343" offset="16" context="_131" access="public" location="f0:1244" file="f0" line="1244"/>
  <Field id="_2129" name="bad_value" type="_669" offset="32" context="_131" access="public" location="f0:1245" file="f0" line="1245"/>
  <Field id="_2130" name="minor_opcode" type="_1343" offset="64" context="_131" access="public" location="f0:1246" file="f0" line="1246"/>
  <Field id="_2131" name="major_opcode" type="_1416" offset="80" context="_131" access="public" location="f0:1247" file="f0" line="1247"/>
  <Field id="_2132" name="pad0" type="_1416" offset="88" context="_131" access="public" location="f0:1248" file="f0" line="1248"/>
  <Destructor id="_2133" name="xcb_value_error_t" artificial="1" throw="" context="_131" access="public" mangled="_ZN17xcb_value_error_tD1Ev *INTERNAL* " demangled="xcb_value_error_t::~xcb_value_error_t()" location="f0:1241" file="f0" line="1241" endline="1241" inline="1">
  </Destructor>
  <OperatorMethod id="_2134" name="=" returns="_5059" artificial="1" throw="" context="_131" access="public" mangled="_ZN17xcb_value_error_taSERKS_" demangled="xcb_value_error_t::operator=(xcb_value_error_t const&amp;)" location="f0:1241" file="f0" line="1241" endline="1241" inline="1">
    <Argument type="_5060" location="f0:1241" file="f0" line="1241"/>
  </OperatorMethod>
  <Constructor id="_2135" name="xcb_value_error_t" artificial="1" throw="" context="_131" access="public" mangled="_ZN17xcb_value_error_tC1ERKS_ *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t(xcb_value_error_t const&amp;)" location="f0:1241" file="f0" line="1241" endline="1241" inline="1">
    <Argument type="_5060" location="f0:1241" file="f0" line="1241"/>
  </Constructor>
  <Constructor id="_2136" name="xcb_value_error_t" artificial="1" throw="" context="_131" access="public" mangled="_ZN17xcb_value_error_tC1Ev *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t()" location="f0:1241" file="f0" line="1241" inline="1"/>
  <Field id="_2137" name="major_opcode" type="_1416" offset="0" context="_133" access="public" location="f0:4269" file="f0" line="4269"/>
  <Field id="_2138" name="pad0" type="_1416" offset="8" context="_133" access="public" location="f0:4270" file="f0" line="4270"/>
  <Field id="_2139" name="length" type="_1343" offset="16" context="_133" access="public" location="f0:4271" file="f0" line="4271"/>
  <Field id="_2140" name="value_mask" type="_669" offset="32" context="_133" access="public" location="f0:4272" file="f0" line="4272"/>
  <Destructor id="_2141" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_133" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::~xcb_change_keyboard_control_request_t()" location="f0:4268" file="f0" line="4268" endline="4268" inline="1">
  </Destructor>
  <OperatorMethod id="_2142" name="=" returns="_5061" artificial="1" throw="" context="_133" access="public" mangled="_ZN37xcb_change_keyboard_control_request_taSERKS_" demangled="xcb_change_keyboard_control_request_t::operator=(xcb_change_keyboard_control_request_t const&amp;)" location="f0:4268" file="f0" line="4268" endline="4268" inline="1">
    <Argument type="_5062" location="f0:4268" file="f0" line="4268"/>
  </OperatorMethod>
  <Constructor id="_2143" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_133" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t(xcb_change_keyboard_control_request_t const&amp;)" location="f0:4268" file="f0" line="4268" endline="4268" inline="1">
    <Argument type="_5062" location="f0:4268" file="f0" line="4268"/>
  </Constructor>
  <Constructor id="_2144" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_133" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t()" location="f0:4268" file="f0" line="4268" inline="1"/>
  <FundamentalType id="_2145" name="complex double" size="128" align="64"/>
  <PointerType id="_2146" type="_442" size="64" align="64"/>
  <Field id="_2147" name="data" type="_5063" offset="0" context="_146" access="public" location="f0:2787" file="f0" line="2787"/>
  <Field id="_2148" name="rem" type="_172" offset="64" context="_146" access="public" location="f0:2788" file="f0" line="2788"/>
  <Field id="_2149" name="index" type="_172" offset="96" context="_146" access="public" location="f0:2789" file="f0" line="2789"/>
  <Destructor id="_2150" name="xcb_str_iterator_t" artificial="1" throw="" context="_146" access="public" mangled="_ZN18xcb_str_iterator_tD1Ev *INTERNAL* " demangled="xcb_str_iterator_t::~xcb_str_iterator_t()" location="f0:2786" file="f0" line="2786" endline="2786" inline="1">
  </Destructor>
  <OperatorMethod id="_2151" name="=" returns="_5064" artificial="1" throw="" context="_146" access="public" mangled="_ZN18xcb_str_iterator_taSERKS_" demangled="xcb_str_iterator_t::operator=(xcb_str_iterator_t const&amp;)" location="f0:2786" file="f0" line="2786" endline="2786" inline="1">
    <Argument type="_5065" location="f0:2786" file="f0" line="2786"/>
  </OperatorMethod>
  <Constructor id="_2152" name="xcb_str_iterator_t" artificial="1" throw="" context="_146" access="public" mangled="_ZN18xcb_str_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t(xcb_str_iterator_t const&amp;)" location="f0:2786" file="f0" line="2786" endline="2786" inline="1">
    <Argument type="_5065" location="f0:2786" file="f0" line="2786"/>
  </Constructor>
  <Constructor id="_2153" name="xcb_str_iterator_t" artificial="1" throw="" context="_146" access="public" mangled="_ZN18xcb_str_iterator_tC1Ev *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t()" location="f0:2786" file="f0" line="2786" inline="1"/>
  <PointerType id="_2154" type="_320c" size="64" align="64"/>
  <PointerType id="_2155" type="_1607c" size="64" align="64"/>
  <Field id="_2156" name="major_opcode" type="_1416" offset="0" context="_151" access="public" location="f0:3176" file="f0" line="3176"/>
  <Field id="_2157" name="pad0" type="_1416" offset="8" context="_151" access="public" location="f0:3177" file="f0" line="3177"/>
  <Field id="_2158" name="length" type="_1343" offset="16" context="_151" access="public" location="f0:3178" file="f0" line="3178"/>
  <Field id="_2159" name="gc" type="_1719" offset="32" context="_151" access="public" location="f0:3179" file="f0" line="3179"/>
  <Field id="_2160" name="value_mask" type="_669" offset="64" context="_151" access="public" location="f0:3180" file="f0" line="3180"/>
  <Destructor id="_2161" name="xcb_change_gc_request_t" artificial="1" throw="" context="_151" access="public" mangled="_ZN23xcb_change_gc_request_tD1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::~xcb_change_gc_request_t()" location="f0:3175" file="f0" line="3175" endline="3175" inline="1">
  </Destructor>
  <OperatorMethod id="_2162" name="=" returns="_5068" artificial="1" throw="" context="_151" access="public" mangled="_ZN23xcb_change_gc_request_taSERKS_" demangled="xcb_change_gc_request_t::operator=(xcb_change_gc_request_t const&amp;)" location="f0:3175" file="f0" line="3175" endline="3175" inline="1">
    <Argument type="_5069" location="f0:3175" file="f0" line="3175"/>
  </OperatorMethod>
  <Constructor id="_2163" name="xcb_change_gc_request_t" artificial="1" throw="" context="_151" access="public" mangled="_ZN23xcb_change_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t(xcb_change_gc_request_t const&amp;)" location="f0:3175" file="f0" line="3175" endline="3175" inline="1">
    <Argument type="_5069" location="f0:3175" file="f0" line="3175"/>
  </Constructor>
  <Constructor id="_2164" name="xcb_change_gc_request_t" artificial="1" throw="" context="_151" access="public" mangled="_ZN23xcb_change_gc_request_tC1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t()" location="f0:3175" file="f0" line="3175" inline="1"/>
  <PointerType id="_2165" type="_1233" size="64" align="64"/>
  <PointerType id="_2166" type="_1264c" size="64" align="64"/>
  <Field id="_2167" name="sequence" type="_90" offset="0" context="_161" access="public" location="f0:2597" file="f0" line="2597"/>
  <Destructor id="_2168" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN25xcb_query_keymap_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::~xcb_query_keymap_cookie_t()" location="f0:2596" file="f0" line="2596" endline="2596" inline="1">
  </Destructor>
  <OperatorMethod id="_2169" name="=" returns="_5071" artificial="1" throw="" context="_161" access="public" mangled="_ZN25xcb_query_keymap_cookie_taSERKS_" demangled="xcb_query_keymap_cookie_t::operator=(xcb_query_keymap_cookie_t const&amp;)" location="f0:2596" file="f0" line="2596" endline="2596" inline="1">
    <Argument type="_5072" location="f0:2596" file="f0" line="2596"/>
  </OperatorMethod>
  <Constructor id="_2170" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t(xcb_query_keymap_cookie_t const&amp;)" location="f0:2596" file="f0" line="2596" endline="2596" inline="1">
    <Argument type="_5072" location="f0:2596" file="f0" line="2596"/>
  </Constructor>
  <Constructor id="_2171" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t()" location="f0:2596" file="f0" line="2596" inline="1"/>
  <Field id="_2172" name="response_type" type="_1416" offset="0" context="_163" access="public" location="f0:713" file="f0" line="713"/>
  <Field id="_2173" name="pad0" type="_1416" offset="8" context="_163" access="public" location="f0:714" file="f0" line="714"/>
  <Field id="_2174" name="sequence" type="_1343" offset="16" context="_163" access="public" location="f0:715" file="f0" line="715"/>
  <Field id="_2175" name="drawable" type="_840" offset="32" context="_163" access="public" location="f0:716" file="f0" line="716"/>
  <Field id="_2176" name="x" type="_1343" offset="64" context="_163" access="public" location="f0:717" file="f0" line="717"/>
  <Field id="_2177" name="y" type="_1343" offset="80" context="_163" access="public" location="f0:718" file="f0" line="718"/>
  <Field id="_2178" name="width" type="_1343" offset="96" context="_163" access="public" location="f0:719" file="f0" line="719"/>
  <Field id="_2179" name="height" type="_1343" offset="112" context="_163" access="public" location="f0:720" file="f0" line="720"/>
  <Field id="_2180" name="minor_opcode" type="_1343" offset="128" context="_163" access="public" location="f0:721" file="f0" line="721"/>
  <Field id="_2181" name="count" type="_1343" offset="144" context="_163" access="public" location="f0:722" file="f0" line="722"/>
  <Field id="_2182" name="major_opcode" type="_1416" offset="160" context="_163" access="public" location="f0:723" file="f0" line="723"/>
  <Field id="_2183" name="pad1" type="_5029" offset="168" context="_163" access="public" location="f0:724" file="f0" line="724"/>
  <Destructor id="_2184" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_163" access="public" mangled="_ZN29xcb_graphics_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::~xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" endline="712" inline="1">
  </Destructor>
  <OperatorMethod id="_2185" name="=" returns="_5073" artificial="1" throw="" context="_163" access="public" mangled="_ZN29xcb_graphics_exposure_event_taSERKS_" demangled="xcb_graphics_exposure_event_t::operator=(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5074" location="f0:712" file="f0" line="712"/>
  </OperatorMethod>
  <Constructor id="_2186" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_163" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5074" location="f0:712" file="f0" line="712"/>
  </Constructor>
  <Constructor id="_2187" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_163" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" inline="1"/>
  <Field id="_2188" name="sequence" type="_90" offset="0" context="_166" access="public" location="f0:2796" file="f0" line="2796"/>
  <Destructor id="_2189" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_166" access="public" mangled="_ZN23xcb_list_fonts_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::~xcb_list_fonts_cookie_t()" location="f0:2795" file="f0" line="2795" endline="2795" inline="1">
  </Destructor>
  <OperatorMethod id="_2190" name="=" returns="_5075" artificial="1" throw="" context="_166" access="public" mangled="_ZN23xcb_list_fonts_cookie_taSERKS_" demangled="xcb_list_fonts_cookie_t::operator=(xcb_list_fonts_cookie_t const&amp;)" location="f0:2795" file="f0" line="2795" endline="2795" inline="1">
    <Argument type="_5076" location="f0:2795" file="f0" line="2795"/>
  </OperatorMethod>
  <Constructor id="_2191" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_166" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t(xcb_list_fonts_cookie_t const&amp;)" location="f0:2795" file="f0" line="2795" endline="2795" inline="1">
    <Argument type="_5076" location="f0:2795" file="f0" line="2795"/>
  </Constructor>
  <Constructor id="_2192" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_166" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t()" location="f0:2795" file="f0" line="2795" inline="1"/>
  <PointerType id="_2193" type="_57" size="64" align="64"/>
  <PointerType id="_2194" type="_1695" size="64" align="64"/>
  <CvQualifiedType id="_2194r" type="_2194" restrict="1"/>
  <PointerType id="_2196" type="_1233c" size="64" align="64"/>
  <CvQualifiedType id="_2196r" type="_2196" restrict="1"/>
  <PointerType id="_2198" type="_5078" size="64" align="64"/>
  <CvQualifiedType id="_477r" type="_477" restrict="1"/>
  <Field id="_2200" name="response_type" type="_1416" offset="0" context="_180" access="public" location="f0:4504" file="f0" line="4504"/>
  <Field id="_2201" name="mode" type="_1416" offset="8" context="_180" access="public" location="f0:4505" file="f0" line="4505"/>
  <Field id="_2202" name="sequence" type="_1343" offset="16" context="_180" access="public" location="f0:4506" file="f0" line="4506"/>
  <Field id="_2203" name="length" type="_669" offset="32" context="_180" access="public" location="f0:4507" file="f0" line="4507"/>
  <Field id="_2204" name="hosts_len" type="_1343" offset="64" context="_180" access="public" location="f0:4508" file="f0" line="4508"/>
  <Field id="_2205" name="pad0" type="_5040" offset="80" context="_180" access="public" location="f0:4509" file="f0" line="4509"/>
  <Destructor id="_2206" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_180" access="public" mangled="_ZN22xcb_list_hosts_reply_tD1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::~xcb_list_hosts_reply_t()" location="f0:4503" file="f0" line="4503" endline="4503" inline="1">
  </Destructor>
  <OperatorMethod id="_2207" name="=" returns="_5079" artificial="1" throw="" context="_180" access="public" mangled="_ZN22xcb_list_hosts_reply_taSERKS_" demangled="xcb_list_hosts_reply_t::operator=(xcb_list_hosts_reply_t const&amp;)" location="f0:4503" file="f0" line="4503" endline="4503" inline="1">
    <Argument type="_5080" location="f0:4503" file="f0" line="4503"/>
  </OperatorMethod>
  <Constructor id="_2208" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_180" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t(xcb_list_hosts_reply_t const&amp;)" location="f0:4503" file="f0" line="4503" endline="4503" inline="1">
    <Argument type="_5080" location="f0:4503" file="f0" line="4503"/>
  </Constructor>
  <Constructor id="_2209" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_180" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t()" location="f0:4503" file="f0" line="4503" inline="1"/>
  <Field id="_2210" name="response_type" type="_1416" offset="0" context="_185" access="public" location="f0:771" file="f0" line="771"/>
  <Field id="_2211" name="pad0" type="_1416" offset="8" context="_185" access="public" location="f0:772" file="f0" line="772"/>
  <Field id="_2212" name="sequence" type="_1343" offset="16" context="_185" access="public" location="f0:773" file="f0" line="773"/>
  <Field id="_2213" name="parent" type="_649" offset="32" context="_185" access="public" location="f0:774" file="f0" line="774"/>
  <Field id="_2214" name="window" type="_649" offset="64" context="_185" access="public" location="f0:775" file="f0" line="775"/>
  <Field id="_2215" name="x" type="_846" offset="96" context="_185" access="public" location="f0:776" file="f0" line="776"/>
  <Field id="_2216" name="y" type="_846" offset="112" context="_185" access="public" location="f0:777" file="f0" line="777"/>
  <Field id="_2217" name="width" type="_1343" offset="128" context="_185" access="public" location="f0:778" file="f0" line="778"/>
  <Field id="_2218" name="height" type="_1343" offset="144" context="_185" access="public" location="f0:779" file="f0" line="779"/>
  <Field id="_2219" name="border_width" type="_1343" offset="160" context="_185" access="public" location="f0:780" file="f0" line="780"/>
  <Field id="_2220" name="override_redirect" type="_1416" offset="176" context="_185" access="public" location="f0:781" file="f0" line="781"/>
  <Field id="_2221" name="pad1" type="_1416" offset="184" context="_185" access="public" location="f0:782" file="f0" line="782"/>
  <Destructor id="_2222" name="xcb_create_notify_event_t" artificial="1" throw="" context="_185" access="public" mangled="_ZN25xcb_create_notify_event_tD1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::~xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" endline="770" inline="1">
  </Destructor>
  <OperatorMethod id="_2223" name="=" returns="_5081" artificial="1" throw="" context="_185" access="public" mangled="_ZN25xcb_create_notify_event_taSERKS_" demangled="xcb_create_notify_event_t::operator=(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5082" location="f0:770" file="f0" line="770"/>
  </OperatorMethod>
  <Constructor id="_2224" name="xcb_create_notify_event_t" artificial="1" throw="" context="_185" access="public" mangled="_ZN25xcb_create_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5082" location="f0:770" file="f0" line="770"/>
  </Constructor>
  <Constructor id="_2225" name="xcb_create_notify_event_t" artificial="1" throw="" context="_185" access="public" mangled="_ZN25xcb_create_notify_event_tC1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" inline="1"/>
  <PointerType id="_2226" type="_1195" size="64" align="64"/>
  <PointerType id="_2227" type="_57c" size="64" align="64"/>
  <CvQualifiedType id="_2227r" type="_2227" restrict="1"/>
  <PointerType id="_2229" type="_1124" size="64" align="64"/>
  <CvQualifiedType id="_2229r" type="_2229" restrict="1"/>
  <Field id="_2231" name="response_type" type="_1416" offset="0" context="_192" access="public" location="f0:4625" file="f0" line="4625"/>
  <Field id="_2232" name="status" type="_1416" offset="8" context="_192" access="public" location="f0:4626" file="f0" line="4626"/>
  <Field id="_2233" name="sequence" type="_1343" offset="16" context="_192" access="public" location="f0:4627" file="f0" line="4627"/>
  <Field id="_2234" name="length" type="_669" offset="32" context="_192" access="public" location="f0:4628" file="f0" line="4628"/>
  <Destructor id="_2235" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::~xcb_set_pointer_mapping_reply_t()" location="f0:4624" file="f0" line="4624" endline="4624" inline="1">
  </Destructor>
  <OperatorMethod id="_2236" name="=" returns="_5084" artificial="1" throw="" context="_192" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_taSERKS_" demangled="xcb_set_pointer_mapping_reply_t::operator=(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4624" file="f0" line="4624" endline="4624" inline="1">
    <Argument type="_5085" location="f0:4624" file="f0" line="4624"/>
  </OperatorMethod>
  <Constructor id="_2237" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4624" file="f0" line="4624" endline="4624" inline="1">
    <Argument type="_5085" location="f0:4624" file="f0" line="4624"/>
  </Constructor>
  <Constructor id="_2238" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t()" location="f0:4624" file="f0" line="4624" inline="1"/>
  <PointerType id="_2239" type="_366c" size="64" align="64"/>
  <Field id="_2240" name="data" type="_4407" offset="0" context="_199" access="public" location="f0:44" file="f0" line="44"/>
  <Field id="_2241" name="rem" type="_172" offset="64" context="_199" access="public" location="f0:45" file="f0" line="45"/>
  <Field id="_2242" name="index" type="_172" offset="96" context="_199" access="public" location="f0:46" file="f0" line="46"/>
  <Destructor id="_2243" name="xcb_window_iterator_t" artificial="1" throw="" context="_199" access="public" mangled="_ZN21xcb_window_iterator_tD1Ev *INTERNAL* " demangled="xcb_window_iterator_t::~xcb_window_iterator_t()" location="f0:43" file="f0" line="43" endline="43" inline="1">
  </Destructor>
  <OperatorMethod id="_2244" name="=" returns="_5087" artificial="1" throw="" context="_199" access="public" mangled="_ZN21xcb_window_iterator_taSERKS_" demangled="xcb_window_iterator_t::operator=(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5088" location="f0:43" file="f0" line="43"/>
  </OperatorMethod>
  <Constructor id="_2245" name="xcb_window_iterator_t" artificial="1" throw="" context="_199" access="public" mangled="_ZN21xcb_window_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5088" location="f0:43" file="f0" line="43"/>
  </Constructor>
  <Constructor id="_2246" name="xcb_window_iterator_t" artificial="1" throw="" context="_199" access="public" mangled="_ZN21xcb_window_iterator_tC1Ev *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t()" location="f0:43" file="f0" line="43" inline="1"/>
  <Field id="_2247" name="response_type" type="_1416" offset="0" context="_201" access="public" location="f0:1952" file="f0" line="1952"/>
  <Field id="_2248" name="pad0" type="_1416" offset="8" context="_201" access="public" location="f0:1953" file="f0" line="1953"/>
  <Field id="_2249" name="sequence" type="_1343" offset="16" context="_201" access="public" location="f0:1954" file="f0" line="1954"/>
  <Field id="_2250" name="length" type="_669" offset="32" context="_201" access="public" location="f0:1955" file="f0" line="1955"/>
  <Field id="_2251" name="atoms_len" type="_1343" offset="64" context="_201" access="public" location="f0:1956" file="f0" line="1956"/>
  <Field id="_2252" name="pad1" type="_5040" offset="80" context="_201" access="public" location="f0:1957" file="f0" line="1957"/>
  <Destructor id="_2253" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN27xcb_list_properties_reply_tD1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::~xcb_list_properties_reply_t()" location="f0:1951" file="f0" line="1951" endline="1951" inline="1">
  </Destructor>
  <OperatorMethod id="_2254" name="=" returns="_5089" artificial="1" throw="" context="_201" access="public" mangled="_ZN27xcb_list_properties_reply_taSERKS_" demangled="xcb_list_properties_reply_t::operator=(xcb_list_properties_reply_t const&amp;)" location="f0:1951" file="f0" line="1951" endline="1951" inline="1">
    <Argument type="_5090" location="f0:1951" file="f0" line="1951"/>
  </OperatorMethod>
  <Constructor id="_2255" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN27xcb_list_properties_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t(xcb_list_properties_reply_t const&amp;)" location="f0:1951" file="f0" line="1951" endline="1951" inline="1">
    <Argument type="_5090" location="f0:1951" file="f0" line="1951"/>
  </Constructor>
  <Constructor id="_2256" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN27xcb_list_properties_reply_tC1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t()" location="f0:1951" file="f0" line="1951" inline="1"/>
  <PointerType id="_2257" type="_1604" size="64" align="64"/>
  <PointerType id="_2258" type="_1419c" size="64" align="64"/>
  <Field id="_2259" name="sequence" type="_90" offset="0" context="_217" access="public" location="f0:2192" file="f0" line="2192"/>
  <Destructor id="_2260" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::~xcb_grab_keyboard_cookie_t()" location="f0:2191" file="f0" line="2191" endline="2191" inline="1">
  </Destructor>
  <OperatorMethod id="_2261" name="=" returns="_5092" artificial="1" throw="" context="_217" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_taSERKS_" demangled="xcb_grab_keyboard_cookie_t::operator=(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2191" file="f0" line="2191" endline="2191" inline="1">
    <Argument type="_5093" location="f0:2191" file="f0" line="2191"/>
  </OperatorMethod>
  <Constructor id="_2262" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2191" file="f0" line="2191" endline="2191" inline="1">
    <Argument type="_5093" location="f0:2191" file="f0" line="2191"/>
  </Constructor>
  <Constructor id="_2263" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t()" location="f0:2191" file="f0" line="2191" inline="1"/>
  <PointerType id="_2264" type="_558" size="64" align="64"/>
  <PointerType id="_2265" type="_839" size="64" align="64"/>
  <PointerType id="_2266" type="_25" size="64" align="64"/>
  <Field id="_2267" name="sequence" type="_90" offset="0" context="_229" access="public" location="f0:1707" file="f0" line="1707"/>
  <Destructor id="_2268" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_229" access="public" mangled="_ZN25xcb_get_geometry_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::~xcb_get_geometry_cookie_t()" location="f0:1706" file="f0" line="1706" endline="1706" inline="1">
  </Destructor>
  <OperatorMethod id="_2269" name="=" returns="_5094" artificial="1" throw="" context="_229" access="public" mangled="_ZN25xcb_get_geometry_cookie_taSERKS_" demangled="xcb_get_geometry_cookie_t::operator=(xcb_get_geometry_cookie_t const&amp;)" location="f0:1706" file="f0" line="1706" endline="1706" inline="1">
    <Argument type="_5095" location="f0:1706" file="f0" line="1706"/>
  </OperatorMethod>
  <Constructor id="_2270" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_229" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t(xcb_get_geometry_cookie_t const&amp;)" location="f0:1706" file="f0" line="1706" endline="1706" inline="1">
    <Argument type="_5095" location="f0:1706" file="f0" line="1706"/>
  </Constructor>
  <Constructor id="_2271" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_229" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t()" location="f0:1706" file="f0" line="1706" inline="1"/>
  <PointerType id="_2272" type="_897" size="64" align="64"/>
  <Field id="_2273" name="data" type="_5096" offset="0" context="_239" access="public" location="f0:380" file="f0" line="380"/>
  <Field id="_2274" name="rem" type="_172" offset="64" context="_239" access="public" location="f0:381" file="f0" line="381"/>
  <Field id="_2275" name="index" type="_172" offset="96" context="_239" access="public" location="f0:382" file="f0" line="382"/>
  <Destructor id="_2276" name="xcb_screen_iterator_t" artificial="1" throw="" context="_239" access="public" mangled="_ZN21xcb_screen_iterator_tD1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::~xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" endline="379" inline="1">
  </Destructor>
  <OperatorMethod id="_2277" name="=" returns="_5097" artificial="1" throw="" context="_239" access="public" mangled="_ZN21xcb_screen_iterator_taSERKS_" demangled="xcb_screen_iterator_t::operator=(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5098" location="f0:379" file="f0" line="379"/>
  </OperatorMethod>
  <Constructor id="_2278" name="xcb_screen_iterator_t" artificial="1" throw="" context="_239" access="public" mangled="_ZN21xcb_screen_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5098" location="f0:379" file="f0" line="379"/>
  </Constructor>
  <Constructor id="_2279" name="xcb_screen_iterator_t" artificial="1" throw="" context="_239" access="public" mangled="_ZN21xcb_screen_iterator_tC1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" inline="1"/>
  <PointerType id="_2280" type="_477" size="64" align="64"/>
  <PointerType id="_2281" type="_700c" size="64" align="64"/>
  <Field id="_2282" name="data" type="_5100" offset="0" context="_248" access="public" location="f0:480" file="f0" line="480"/>
  <Field id="_2283" name="rem" type="_172" offset="64" context="_248" access="public" location="f0:481" file="f0" line="481"/>
  <Field id="_2284" name="index" type="_172" offset="96" context="_248" access="public" location="f0:482" file="f0" line="482"/>
  <Destructor id="_2285" name="xcb_setup_iterator_t" artificial="1" throw="" context="_248" access="public" mangled="_ZN20xcb_setup_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::~xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" endline="479" inline="1">
  </Destructor>
  <OperatorMethod id="_2286" name="=" returns="_5101" artificial="1" throw="" context="_248" access="public" mangled="_ZN20xcb_setup_iterator_taSERKS_" demangled="xcb_setup_iterator_t::operator=(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5102" location="f0:479" file="f0" line="479"/>
  </OperatorMethod>
  <Constructor id="_2287" name="xcb_setup_iterator_t" artificial="1" throw="" context="_248" access="public" mangled="_ZN20xcb_setup_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5102" location="f0:479" file="f0" line="479"/>
  </Constructor>
  <Constructor id="_2288" name="xcb_setup_iterator_t" artificial="1" throw="" context="_248" access="public" mangled="_ZN20xcb_setup_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" inline="1"/>
  <PointerType id="_2289" type="_512" size="64" align="64"/>
  <PointerType id="_2290" type="_1814" size="64" align="64"/>
  <PointerType id="_2291" type="_202c" size="64" align="64"/>
  <PointerType id="_2292" type="_1441c" size="64" align="64"/>
  <Field id="_2293" name="major_opcode" type="_1416" offset="0" context="_269" access="public" location="f0:1989" file="f0" line="1989"/>
  <Field id="_2294" name="pad0" type="_1416" offset="8" context="_269" access="public" location="f0:1990" file="f0" line="1990"/>
  <Field id="_2295" name="length" type="_1343" offset="16" context="_269" access="public" location="f0:1991" file="f0" line="1991"/>
  <Field id="_2296" name="selection" type="_1607" offset="32" context="_269" access="public" location="f0:1992" file="f0" line="1992"/>
  <Destructor id="_2297" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_269" access="public" mangled="_ZN33xcb_get_selection_owner_request_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::~xcb_get_selection_owner_request_t()" location="f0:1988" file="f0" line="1988" endline="1988" inline="1">
  </Destructor>
  <OperatorMethod id="_2298" name="=" returns="_5105" artificial="1" throw="" context="_269" access="public" mangled="_ZN33xcb_get_selection_owner_request_taSERKS_" demangled="xcb_get_selection_owner_request_t::operator=(xcb_get_selection_owner_request_t const&amp;)" location="f0:1988" file="f0" line="1988" endline="1988" inline="1">
    <Argument type="_5106" location="f0:1988" file="f0" line="1988"/>
  </OperatorMethod>
  <Constructor id="_2299" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_269" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t(xcb_get_selection_owner_request_t const&amp;)" location="f0:1988" file="f0" line="1988" endline="1988" inline="1">
    <Argument type="_5106" location="f0:1988" file="f0" line="1988"/>
  </Constructor>
  <Constructor id="_2300" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_269" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t()" location="f0:1988" file="f0" line="1988" inline="1"/>
  <Field id="_2301" name="major_opcode" type="_1416" offset="0" context="_272" access="public" location="f0:4289" file="f0" line="4289"/>
  <Field id="_2302" name="pad0" type="_1416" offset="8" context="_272" access="public" location="f0:4290" file="f0" line="4290"/>
  <Field id="_2303" name="length" type="_1343" offset="16" context="_272" access="public" location="f0:4291" file="f0" line="4291"/>
  <Destructor id="_2304" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_272" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::~xcb_get_keyboard_control_request_t()" location="f0:4288" file="f0" line="4288" endline="4288" inline="1">
  </Destructor>
  <OperatorMethod id="_2305" name="=" returns="_5107" artificial="1" throw="" context="_272" access="public" mangled="_ZN34xcb_get_keyboard_control_request_taSERKS_" demangled="xcb_get_keyboard_control_request_t::operator=(xcb_get_keyboard_control_request_t const&amp;)" location="f0:4288" file="f0" line="4288" endline="4288" inline="1">
    <Argument type="_5108" location="f0:4288" file="f0" line="4288"/>
  </OperatorMethod>
  <Constructor id="_2306" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_272" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t(xcb_get_keyboard_control_request_t const&amp;)" location="f0:4288" file="f0" line="4288" endline="4288" inline="1">
    <Argument type="_5108" location="f0:4288" file="f0" line="4288"/>
  </Constructor>
  <Constructor id="_2307" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_272" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t()" location="f0:4288" file="f0" line="4288" inline="1"/>
  <PointerType id="_2308" type="_1051c" size="64" align="64"/>
  <PointerType id="_2309" type="_648" size="64" align="64"/>
  <PointerType id="_2310" type="_622c" size="64" align="64"/>
  <Field id="_2311" name="major_opcode" type="_1416" offset="0" context="_280" access="public" location="f0:3652" file="f0" line="3652"/>
  <Field id="_2312" name="pad0" type="_1416" offset="8" context="_280" access="public" location="f0:3653" file="f0" line="3653"/>
  <Field id="_2313" name="length" type="_1343" offset="16" context="_280" access="public" location="f0:3654" file="f0" line="3654"/>
  <Field id="_2314" name="cmap" type="_690" offset="32" context="_280" access="public" location="f0:3655" file="f0" line="3655"/>
  <Destructor id="_2315" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_280" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::~xcb_uninstall_colormap_request_t()" location="f0:3651" file="f0" line="3651" endline="3651" inline="1">
  </Destructor>
  <OperatorMethod id="_2316" name="=" returns="_5111" artificial="1" throw="" context="_280" access="public" mangled="_ZN32xcb_uninstall_colormap_request_taSERKS_" demangled="xcb_uninstall_colormap_request_t::operator=(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3651" file="f0" line="3651" endline="3651" inline="1">
    <Argument type="_5112" location="f0:3651" file="f0" line="3651"/>
  </OperatorMethod>
  <Constructor id="_2317" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_280" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3651" file="f0" line="3651" endline="3651" inline="1">
    <Argument type="_5112" location="f0:3651" file="f0" line="3651"/>
  </Constructor>
  <Constructor id="_2318" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_280" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t()" location="f0:3651" file="f0" line="3651" inline="1"/>
  <CvQualifiedType id="_1922r" type="_1922" restrict="1"/>
  <PointerType id="_2320" type="_743c" size="64" align="64"/>
  <CvQualifiedType id="_2320r" type="_2320" restrict="1"/>
  <PointerType id="_2322" type="_1677" size="64" align="64"/>
  <PointerType id="_2323" type="_519" size="64" align="64"/>
  <PointerType id="_2324" type="_693" size="64" align="64"/>
  <Field id="_2325" name="major_opcode" type="_1416" offset="0" context="_289" access="public" location="f0:4571" file="f0" line="4571"/>
  <Field id="_2326" name="pad0" type="_1416" offset="8" context="_289" access="public" location="f0:4572" file="f0" line="4572"/>
  <Field id="_2327" name="length" type="_1343" offset="16" context="_289" access="public" location="f0:4573" file="f0" line="4573"/>
  <Field id="_2328" name="window" type="_649" offset="32" context="_289" access="public" location="f0:4574" file="f0" line="4574"/>
  <Field id="_2329" name="atoms_len" type="_1343" offset="64" context="_289" access="public" location="f0:4575" file="f0" line="4575"/>
  <Field id="_2330" name="delta" type="_846" offset="80" context="_289" access="public" location="f0:4576" file="f0" line="4576"/>
  <Destructor id="_2331" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_289" access="public" mangled="_ZN31xcb_rotate_properties_request_tD1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::~xcb_rotate_properties_request_t()" location="f0:4570" file="f0" line="4570" endline="4570" inline="1">
  </Destructor>
  <OperatorMethod id="_2332" name="=" returns="_5114" artificial="1" throw="" context="_289" access="public" mangled="_ZN31xcb_rotate_properties_request_taSERKS_" demangled="xcb_rotate_properties_request_t::operator=(xcb_rotate_properties_request_t const&amp;)" location="f0:4570" file="f0" line="4570" endline="4570" inline="1">
    <Argument type="_5115" location="f0:4570" file="f0" line="4570"/>
  </OperatorMethod>
  <Constructor id="_2333" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_289" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t(xcb_rotate_properties_request_t const&amp;)" location="f0:4570" file="f0" line="4570" endline="4570" inline="1">
    <Argument type="_5115" location="f0:4570" file="f0" line="4570"/>
  </Constructor>
  <Constructor id="_2334" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_289" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t()" location="f0:4570" file="f0" line="4570" inline="1"/>
  <PointerType id="_2335" type="_849" size="64" align="64"/>
  <Field id="_2336" name="major_opcode" type="_1416" offset="0" context="_293" access="public" location="f0:2380" file="f0" line="2380"/>
  <Field id="_2337" name="pad0" type="_1416" offset="8" context="_293" access="public" location="f0:2381" file="f0" line="2381"/>
  <Field id="_2338" name="length" type="_1343" offset="16" context="_293" access="public" location="f0:2382" file="f0" line="2382"/>
  <Destructor id="_2339" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_293" access="public" mangled="_ZN27xcb_ungrab_server_request_tD1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::~xcb_ungrab_server_request_t()" location="f0:2379" file="f0" line="2379" endline="2379" inline="1">
  </Destructor>
  <OperatorMethod id="_2340" name="=" returns="_5116" artificial="1" throw="" context="_293" access="public" mangled="_ZN27xcb_ungrab_server_request_taSERKS_" demangled="xcb_ungrab_server_request_t::operator=(xcb_ungrab_server_request_t const&amp;)" location="f0:2379" file="f0" line="2379" endline="2379" inline="1">
    <Argument type="_5117" location="f0:2379" file="f0" line="2379"/>
  </OperatorMethod>
  <Constructor id="_2341" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_293" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1ERKS_ *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t(xcb_ungrab_server_request_t const&amp;)" location="f0:2379" file="f0" line="2379" endline="2379" inline="1">
    <Argument type="_5117" location="f0:2379" file="f0" line="2379"/>
  </Constructor>
  <Constructor id="_2342" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_293" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t()" location="f0:2379" file="f0" line="2379" inline="1"/>
  <PointerType id="_2343" type="_1663" size="64" align="64"/>
  <PointerType id="_2344" type="_9c" size="64" align="64"/>
  <ArrayType id="_2345" min="0" max="1u" type="_1076" size="128" align="64"/>
  <Field id="_2346" name="response_type" type="_1416" offset="0" context="_303" access="public" location="f0:838" file="f0" line="838"/>
  <Field id="_2347" name="pad0" type="_1416" offset="8" context="_303" access="public" location="f0:839" file="f0" line="839"/>
  <Field id="_2348" name="sequence" type="_1343" offset="16" context="_303" access="public" location="f0:840" file="f0" line="840"/>
  <Field id="_2349" name="parent" type="_649" offset="32" context="_303" access="public" location="f0:841" file="f0" line="841"/>
  <Field id="_2350" name="window" type="_649" offset="64" context="_303" access="public" location="f0:842" file="f0" line="842"/>
  <Destructor id="_2351" name="xcb_map_request_event_t" artificial="1" throw="" context="_303" access="public" mangled="_ZN23xcb_map_request_event_tD1Ev *INTERNAL* " demangled="xcb_map_request_event_t::~xcb_map_request_event_t()" location="f0:837" file="f0" line="837" endline="837" inline="1">
  </Destructor>
  <OperatorMethod id="_2352" name="=" returns="_5119" artificial="1" throw="" context="_303" access="public" mangled="_ZN23xcb_map_request_event_taSERKS_" demangled="xcb_map_request_event_t::operator=(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5120" location="f0:837" file="f0" line="837"/>
  </OperatorMethod>
  <Constructor id="_2353" name="xcb_map_request_event_t" artificial="1" throw="" context="_303" access="public" mangled="_ZN23xcb_map_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5120" location="f0:837" file="f0" line="837"/>
  </Constructor>
  <Constructor id="_2354" name="xcb_map_request_event_t" artificial="1" throw="" context="_303" access="public" mangled="_ZN23xcb_map_request_event_tC1Ev *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t()" location="f0:837" file="f0" line="837" inline="1"/>
  <Field id="_2355" name="sequence" type="_90" offset="0" context="_305" access="public" location="f0:1499" file="f0" line="1499"/>
  <Destructor id="_2356" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_305" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::~xcb_get_window_attributes_cookie_t()" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
  </Destructor>
  <OperatorMethod id="_2357" name="=" returns="_5121" artificial="1" throw="" context="_305" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_taSERKS_" demangled="xcb_get_window_attributes_cookie_t::operator=(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
    <Argument type="_5122" location="f0:1498" file="f0" line="1498"/>
  </OperatorMethod>
  <Constructor id="_2358" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_305" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
    <Argument type="_5122" location="f0:1498" file="f0" line="1498"/>
  </Constructor>
  <Constructor id="_2359" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_305" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t()" location="f0:1498" file="f0" line="1498" inline="1"/>
  <Field id="_2360" name="data8" type="_5123" offset="0" context="_317" access="public" location="f0:1152" file="f0" line="1152"/>
  <Field id="_2361" name="data16" type="_5124" offset="0" context="_317" access="public" location="f0:1153" file="f0" line="1153"/>
  <Field id="_2362" name="data32" type="_5125" offset="0" context="_317" access="public" location="f0:1154" file="f0" line="1154"/>
  <Destructor id="_2363" name="xcb_client_message_data_t" artificial="1" throw="" context="_317" access="public" mangled="_ZN25xcb_client_message_data_tD1Ev *INTERNAL* " demangled="xcb_client_message_data_t::~xcb_client_message_data_t()" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
  </Destructor>
  <OperatorMethod id="_2364" name="=" returns="_5126" artificial="1" throw="" context="_317" access="public" mangled="_ZN25xcb_client_message_data_taSERKS_" demangled="xcb_client_message_data_t::operator=(xcb_client_message_data_t const&amp;)" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
    <Argument type="_5127" location="f0:1151" file="f0" line="1151"/>
  </OperatorMethod>
  <Constructor id="_2365" name="xcb_client_message_data_t" artificial="1" throw="" context="_317" access="public" mangled="_ZN25xcb_client_message_data_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t(xcb_client_message_data_t const&amp;)" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
    <Argument type="_5127" location="f0:1151" file="f0" line="1151"/>
  </Constructor>
  <Constructor id="_2366" name="xcb_client_message_data_t" artificial="1" throw="" context="_317" access="public" mangled="_ZN25xcb_client_message_data_tC1Ev *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t()" location="f0:1151" file="f0" line="1151" inline="1"/>
  <Field id="_2367" name="response_type" type="_1416" offset="0" context="_319" access="public" location="f0:1918" file="f0" line="1918"/>
  <Field id="_2368" name="format" type="_1416" offset="8" context="_319" access="public" location="f0:1919" file="f0" line="1919"/>
  <Field id="_2369" name="sequence" type="_1343" offset="16" context="_319" access="public" location="f0:1920" file="f0" line="1920"/>
  <Field id="_2370" name="length" type="_669" offset="32" context="_319" access="public" location="f0:1921" file="f0" line="1921"/>
  <Field id="_2371" name="type" type="_1607" offset="64" context="_319" access="public" location="f0:1922" file="f0" line="1922"/>
  <Field id="_2372" name="bytes_after" type="_669" offset="96" context="_319" access="public" location="f0:1923" file="f0" line="1923"/>
  <Field id="_2373" name="value_len" type="_669" offset="128" context="_319" access="public" location="f0:1924" file="f0" line="1924"/>
  <Field id="_2374" name="pad0" type="_5128" offset="160" context="_319" access="public" location="f0:1925" file="f0" line="1925"/>
  <Destructor id="_2375" name="xcb_get_property_reply_t" artificial="1" throw="" context="_319" access="public" mangled="_ZN24xcb_get_property_reply_tD1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::~xcb_get_property_reply_t()" location="f0:1917" file="f0" line="1917" endline="1917" inline="1">
  </Destructor>
  <OperatorMethod id="_2376" name="=" returns="_5129" artificial="1" throw="" context="_319" access="public" mangled="_ZN24xcb_get_property_reply_taSERKS_" demangled="xcb_get_property_reply_t::operator=(xcb_get_property_reply_t const&amp;)" location="f0:1917" file="f0" line="1917" endline="1917" inline="1">
    <Argument type="_5130" location="f0:1917" file="f0" line="1917"/>
  </OperatorMethod>
  <Constructor id="_2377" name="xcb_get_property_reply_t" artificial="1" throw="" context="_319" access="public" mangled="_ZN24xcb_get_property_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t(xcb_get_property_reply_t const&amp;)" location="f0:1917" file="f0" line="1917" endline="1917" inline="1">
    <Argument type="_5130" location="f0:1917" file="f0" line="1917"/>
  </Constructor>
  <Constructor id="_2378" name="xcb_get_property_reply_t" artificial="1" throw="" context="_319" access="public" mangled="_ZN24xcb_get_property_reply_tC1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t()" location="f0:1917" file="f0" line="1917" inline="1"/>
  <Field id="_2379" name="sequence" type="_90" offset="0" context="_322" access="public" location="f0:4279" file="f0" line="4279"/>
  <Destructor id="_2380" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_322" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::~xcb_get_keyboard_control_cookie_t()" location="f0:4278" file="f0" line="4278" endline="4278" inline="1">
  </Destructor>
  <OperatorMethod id="_2381" name="=" returns="_5131" artificial="1" throw="" context="_322" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_taSERKS_" demangled="xcb_get_keyboard_control_cookie_t::operator=(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:4278" file="f0" line="4278" endline="4278" inline="1">
    <Argument type="_5132" location="f0:4278" file="f0" line="4278"/>
  </OperatorMethod>
  <Constructor id="_2382" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_322" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:4278" file="f0" line="4278" endline="4278" inline="1">
    <Argument type="_5132" location="f0:4278" file="f0" line="4278"/>
  </Constructor>
  <Constructor id="_2383" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_322" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t()" location="f0:4278" file="f0" line="4278" inline="1"/>
  <Field id="_2384" name="__size" type="_5015" offset="0" context="_327" access="public" location="f8:131" file="f8" line="131"/>
  <Field id="_2385" name="__align" type="_172" offset="0" context="_327" access="public" location="f8:132" file="f8" line="132"/>
  <Destructor id="_2386" name="._4" artificial="1" throw="" context="_327" access="public" mangled="_ZN19pthread_mutexattr_tD1Ev *INTERNAL* " demangled="pthread_mutexattr_t::~pthread_mutexattr_t()" location="f8:133" file="f8" line="133" endline="133" inline="1">
  </Destructor>
  <OperatorMethod id="_2387" name="=" returns="_5133" artificial="1" throw="" context="_327" access="public" mangled="_ZN19pthread_mutexattr_taSERKS_" demangled="pthread_mutexattr_t::operator=(pthread_mutexattr_t const&amp;)" location="f8:133" file="f8" line="133" endline="133" inline="1">
    <Argument type="_5134" location="f8:130" file="f8" line="130"/>
  </OperatorMethod>
  <Constructor id="_2388" name="._4" artificial="1" throw="" context="_327" access="public" mangled="_ZN19pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t(pthread_mutexattr_t const&amp;)" location="f8:133" file="f8" line="133" endline="133" inline="1">
    <Argument type="_5134" location="f8:130" file="f8" line="130"/>
  </Constructor>
  <Constructor id="_2389" name="._4" artificial="1" throw="" context="_327" access="public" mangled="_ZN19pthread_mutexattr_tC1Ev *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t()" location="f8:133" file="f8" line="133" inline="1"/>
  <PointerType id="_2390" type="_93" size="64" align="64"/>
  <Field id="_2391" name="response_type" type="_1416" offset="0" context="_332" access="public" location="f0:954" file="f0" line="954"/>
  <Field id="_2392" name="pad0" type="_1416" offset="8" context="_332" access="public" location="f0:955" file="f0" line="955"/>
  <Field id="_2393" name="sequence" type="_1343" offset="16" context="_332" access="public" location="f0:956" file="f0" line="956"/>
  <Field id="_2394" name="event" type="_649" offset="32" context="_332" access="public" location="f0:957" file="f0" line="957"/>
  <Field id="_2395" name="window" type="_649" offset="64" context="_332" access="public" location="f0:958" file="f0" line="958"/>
  <Field id="_2396" name="pad1" type="_5135" offset="96" context="_332" access="public" location="f0:959" file="f0" line="959"/>
  <Field id="_2397" name="place" type="_1416" offset="128" context="_332" access="public" location="f0:960" file="f0" line="960"/>
  <Field id="_2398" name="pad2" type="_5029" offset="136" context="_332" access="public" location="f0:961" file="f0" line="961"/>
  <Destructor id="_2399" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_332" access="public" mangled="_ZN28xcb_circulate_notify_event_tD1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::~xcb_circulate_notify_event_t()" location="f0:953" file="f0" line="953" endline="953" inline="1">
  </Destructor>
  <OperatorMethod id="_2400" name="=" returns="_5136" artificial="1" throw="" context="_332" access="public" mangled="_ZN28xcb_circulate_notify_event_taSERKS_" demangled="xcb_circulate_notify_event_t::operator=(xcb_circulate_notify_event_t const&amp;)" location="f0:953" file="f0" line="953" endline="953" inline="1">
    <Argument type="_5137" location="f0:953" file="f0" line="953"/>
  </OperatorMethod>
  <Constructor id="_2401" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_332" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t(xcb_circulate_notify_event_t const&amp;)" location="f0:953" file="f0" line="953" endline="953" inline="1">
    <Argument type="_5137" location="f0:953" file="f0" line="953"/>
  </Constructor>
  <Constructor id="_2402" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_332" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t()" location="f0:953" file="f0" line="953" inline="1"/>
  <Field id="_2403" name="response_type" type="_1416" offset="0" context="_334" access="public" location="f0:594" file="f0" line="594"/>
  <Field id="_2404" name="detail" type="_1416" offset="8" context="_334" access="public" location="f0:595" file="f0" line="595"/>
  <Field id="_2405" name="sequence" type="_1343" offset="16" context="_334" access="public" location="f0:596" file="f0" line="596"/>
  <Field id="_2406" name="time" type="_1208" offset="32" context="_334" access="public" location="f0:597" file="f0" line="597"/>
  <Field id="_2407" name="root" type="_649" offset="64" context="_334" access="public" location="f0:598" file="f0" line="598"/>
  <Field id="_2408" name="event" type="_649" offset="96" context="_334" access="public" location="f0:599" file="f0" line="599"/>
  <Field id="_2409" name="child" type="_649" offset="128" context="_334" access="public" location="f0:600" file="f0" line="600"/>
  <Field id="_2410" name="root_x" type="_846" offset="160" context="_334" access="public" location="f0:601" file="f0" line="601"/>
  <Field id="_2411" name="root_y" type="_846" offset="176" context="_334" access="public" location="f0:602" file="f0" line="602"/>
  <Field id="_2412" name="event_x" type="_846" offset="192" context="_334" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_2413" name="event_y" type="_846" offset="208" context="_334" access="public" location="f0:604" file="f0" line="604"/>
  <Field id="_2414" name="state" type="_1343" offset="224" context="_334" access="public" location="f0:605" file="f0" line="605"/>
  <Field id="_2415" name="same_screen" type="_1416" offset="240" context="_334" access="public" location="f0:606" file="f0" line="606"/>
  <Field id="_2416" name="pad0" type="_1416" offset="248" context="_334" access="public" location="f0:607" file="f0" line="607"/>
  <Destructor id="_2417" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_334" access="public" mangled="_ZN25xcb_motion_notify_event_tD1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::~xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" endline="593" inline="1">
  </Destructor>
  <OperatorMethod id="_2418" name="=" returns="_5138" artificial="1" throw="" context="_334" access="public" mangled="_ZN25xcb_motion_notify_event_taSERKS_" demangled="xcb_motion_notify_event_t::operator=(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5139" location="f0:593" file="f0" line="593"/>
  </OperatorMethod>
  <Constructor id="_2419" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_334" access="public" mangled="_ZN25xcb_motion_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5139" location="f0:593" file="f0" line="593"/>
  </Constructor>
  <Constructor id="_2420" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_334" access="public" mangled="_ZN25xcb_motion_notify_event_tC1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" inline="1"/>
  <PointerType id="_2421" type="_1189" size="64" align="64"/>
  <PointerType id="_2422" type="_1014" size="64" align="64"/>
  <PointerType id="_2423" type="_639" size="64" align="64"/>
  <Field id="_2424" name="fds_bits" type="_5140" offset="0" context="_343" access="public" location="f11:69" file="f11" line="69"/>
  <Destructor id="_2425" name="._2" artificial="1" throw="" context="_343" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f11:75" file="f11" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_2426" name="=" returns="_5141" artificial="1" throw="" context="_343" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f11:75" file="f11" line="75" endline="75" inline="1">
    <Argument type="_5142" location="f11:65" file="f11" line="65"/>
  </OperatorMethod>
  <Constructor id="_2427" name="._2" artificial="1" throw="" context="_343" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f11:75" file="f11" line="75" endline="75" inline="1">
    <Argument type="_5142" location="f11:65" file="f11" line="65"/>
  </Constructor>
  <Constructor id="_2428" name="._2" artificial="1" throw="" context="_343" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f11:75" file="f11" line="75" inline="1"/>
  <Field id="_2429" name="__data" type="_2432" offset="0" context="_345" access="public" location="f8:124" file="f8" line="124"/>
  <Field id="_2430" name="__size" type="_5143" offset="0" context="_345" access="public" location="f8:125" file="f8" line="125"/>
  <Field id="_2431" name="__align" type="_29" offset="0" context="_345" access="public" location="f8:126" file="f8" line="126"/>
  <Struct id="_2432" name="__pthread_mutex_s" context="_345" access="public" mangled="N15pthread_mutex_t17__pthread_mutex_sE" demangled="pthread_mutex_t::__pthread_mutex_s" location="f8:93" file="f8" line="93" artificial="1" size="320" align="64" members="_5144 _5145 _5146 _5147 _5148 _5149 _5150 _5151 _5152 _5153 _5154 _5155 " bases=""/>
  <Destructor id="_2433" name="._3" artificial="1" throw="" context="_345" access="public" mangled="_ZN15pthread_mutex_tD1Ev *INTERNAL* " demangled="pthread_mutex_t::~pthread_mutex_t()" location="f8:127" file="f8" line="127" endline="127" inline="1">
  </Destructor>
  <OperatorMethod id="_2434" name="=" returns="_5156" artificial="1" throw="" context="_345" access="public" mangled="_ZN15pthread_mutex_taSERKS_" demangled="pthread_mutex_t::operator=(pthread_mutex_t const&amp;)" location="f8:127" file="f8" line="127" endline="127" inline="1">
    <Argument type="_5157" location="f8:91" file="f8" line="91"/>
  </OperatorMethod>
  <Constructor id="_2435" name="._3" artificial="1" throw="" context="_345" access="public" mangled="_ZN15pthread_mutex_tC1ERKS_ *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t(pthread_mutex_t const&amp;)" location="f8:127" file="f8" line="127" endline="127" inline="1">
    <Argument type="_5157" location="f8:91" file="f8" line="91"/>
  </Constructor>
  <Constructor id="_2436" name="._3" artificial="1" throw="" context="_345" access="public" mangled="_ZN15pthread_mutex_tC1Ev *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t()" location="f8:127" file="f8" line="127" inline="1"/>
  <PointerType id="_2437" type="_200" size="64" align="64"/>
  <Field id="_2438" name="sequence" type="_90" offset="0" context="_349" access="public" location="f0:3936" file="f0" line="3936"/>
  <Destructor id="_2439" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_349" access="public" mangled="_ZN25xcb_query_colors_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::~xcb_query_colors_cookie_t()" location="f0:3935" file="f0" line="3935" endline="3935" inline="1">
  </Destructor>
  <OperatorMethod id="_2440" name="=" returns="_5158" artificial="1" throw="" context="_349" access="public" mangled="_ZN25xcb_query_colors_cookie_taSERKS_" demangled="xcb_query_colors_cookie_t::operator=(xcb_query_colors_cookie_t const&amp;)" location="f0:3935" file="f0" line="3935" endline="3935" inline="1">
    <Argument type="_5159" location="f0:3935" file="f0" line="3935"/>
  </OperatorMethod>
  <Constructor id="_2441" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_349" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t(xcb_query_colors_cookie_t const&amp;)" location="f0:3935" file="f0" line="3935" endline="3935" inline="1">
    <Argument type="_5159" location="f0:3935" file="f0" line="3935"/>
  </Constructor>
  <Constructor id="_2442" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_349" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t()" location="f0:3935" file="f0" line="3935" inline="1"/>
  <Field id="_2443" name="__data" type="_2446" offset="0" context="_353" access="public" location="f8:150" file="f8" line="150"/>
  <Field id="_2444" name="__size" type="_5160" offset="0" context="_353" access="public" location="f8:151" file="f8" line="151"/>
  <Field id="_2445" name="__align" type="_1923" offset="0" context="_353" access="public" location="f8:152" file="f8" line="152"/>
  <Struct id="_2446" context="_353" access="public" mangled="N14pthread_cond_t3._6E" demangled="pthread_cond_t::._6" location="f8:141" file="f8" line="141" artificial="1" size="384" align="64" members="_5161 _5162 _5163 _5164 _5165 _5166 _5167 _5168 _5169 _5170 _5171 _5172 " bases=""/>
  <Destructor id="_2447" name="._5" artificial="1" throw="" context="_353" access="public" mangled="_ZN14pthread_cond_tD1Ev *INTERNAL* " demangled="pthread_cond_t::~pthread_cond_t()" location="f8:153" file="f8" line="153" endline="153" inline="1">
  </Destructor>
  <OperatorMethod id="_2448" name="=" returns="_5173" artificial="1" throw="" context="_353" access="public" mangled="_ZN14pthread_cond_taSERKS_" demangled="pthread_cond_t::operator=(pthread_cond_t const&amp;)" location="f8:153" file="f8" line="153" endline="153" inline="1">
    <Argument type="_5174" location="f8:139" file="f8" line="139"/>
  </OperatorMethod>
  <Constructor id="_2449" name="._5" artificial="1" throw="" context="_353" access="public" mangled="_ZN14pthread_cond_tC1ERKS_ *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t(pthread_cond_t const&amp;)" location="f8:153" file="f8" line="153" endline="153" inline="1">
    <Argument type="_5174" location="f8:139" file="f8" line="139"/>
  </Constructor>
  <Constructor id="_2450" name="._5" artificial="1" throw="" context="_353" access="public" mangled="_ZN14pthread_cond_tC1Ev *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t()" location="f8:153" file="f8" line="153" inline="1"/>
  <PointerType id="_2451" type="_181" size="64" align="64"/>
  <PointerType id="_2452" type="_165c" size="64" align="64"/>
  <Field id="_2453" name="sequence" type="_90" offset="0" context="_360" access="public" location="f0:1894" file="f0" line="1894"/>
  <Destructor id="_2454" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_360" access="public" mangled="_ZN25xcb_get_property_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::~xcb_get_property_cookie_t()" location="f0:1893" file="f0" line="1893" endline="1893" inline="1">
  </Destructor>
  <OperatorMethod id="_2455" name="=" returns="_5176" artificial="1" throw="" context="_360" access="public" mangled="_ZN25xcb_get_property_cookie_taSERKS_" demangled="xcb_get_property_cookie_t::operator=(xcb_get_property_cookie_t const&amp;)" location="f0:1893" file="f0" line="1893" endline="1893" inline="1">
    <Argument type="_5177" location="f0:1893" file="f0" line="1893"/>
  </OperatorMethod>
  <Constructor id="_2456" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_360" access="public" mangled="_ZN25xcb_get_property_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t(xcb_get_property_cookie_t const&amp;)" location="f0:1893" file="f0" line="1893" endline="1893" inline="1">
    <Argument type="_5177" location="f0:1893" file="f0" line="1893"/>
  </Constructor>
  <Constructor id="_2457" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_360" access="public" mangled="_ZN25xcb_get_property_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t()" location="f0:1893" file="f0" line="1893" inline="1"/>
  <Field id="_2458" name="major_opcode" type="_1416" offset="0" context="_363" access="public" location="f0:3190" file="f0" line="3190"/>
  <Field id="_2459" name="pad0" type="_1416" offset="8" context="_363" access="public" location="f0:3191" file="f0" line="3191"/>
  <Field id="_2460" name="length" type="_1343" offset="16" context="_363" access="public" location="f0:3192" file="f0" line="3192"/>
  <Field id="_2461" name="src_gc" type="_1719" offset="32" context="_363" access="public" location="f0:3193" file="f0" line="3193"/>
  <Field id="_2462" name="dst_gc" type="_1719" offset="64" context="_363" access="public" location="f0:3194" file="f0" line="3194"/>
  <Field id="_2463" name="value_mask" type="_669" offset="96" context="_363" access="public" location="f0:3195" file="f0" line="3195"/>
  <Destructor id="_2464" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_363" access="public" mangled="_ZN21xcb_copy_gc_request_tD1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::~xcb_copy_gc_request_t()" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
  </Destructor>
  <OperatorMethod id="_2465" name="=" returns="_5178" artificial="1" throw="" context="_363" access="public" mangled="_ZN21xcb_copy_gc_request_taSERKS_" demangled="xcb_copy_gc_request_t::operator=(xcb_copy_gc_request_t const&amp;)" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
    <Argument type="_5179" location="f0:3189" file="f0" line="3189"/>
  </OperatorMethod>
  <Constructor id="_2466" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_363" access="public" mangled="_ZN21xcb_copy_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t(xcb_copy_gc_request_t const&amp;)" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
    <Argument type="_5179" location="f0:3189" file="f0" line="3189"/>
  </Constructor>
  <Constructor id="_2467" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_363" access="public" mangled="_ZN21xcb_copy_gc_request_tC1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t()" location="f0:3189" file="f0" line="3189" inline="1"/>
  <Field id="_2468" name="iov_base" type="_477" offset="0" context="_366" access="public" location="f16:45" file="f16" line="45"/>
  <Field id="_2469" name="iov_len" type="_1148" offset="64" context="_366" access="public" location="f16:46" file="f16" line="46"/>
  <Destructor id="_2470" name="iovec" artificial="1" throw="" context="_366" access="public" mangled="_ZN5iovecD1Ev *INTERNAL* " demangled="iovec::~iovec()" location="f16:44" file="f16" line="44" endline="44" inline="1">
  </Destructor>
  <OperatorMethod id="_2471" name="=" returns="_5180" artificial="1" throw="" context="_366" access="public" mangled="_ZN5iovecaSERKS_" demangled="iovec::operator=(iovec const&amp;)" location="f16:44" file="f16" line="44" endline="44" inline="1">
    <Argument type="_5181" location="f16:44" file="f16" line="44"/>
  </OperatorMethod>
  <Constructor id="_2472" name="iovec" artificial="1" throw="" context="_366" access="public" mangled="_ZN5iovecC1ERKS_ *INTERNAL* " demangled="iovec::iovec(iovec const&amp;)" location="f16:44" file="f16" line="44" endline="44" inline="1">
    <Argument type="_5181" location="f16:44" file="f16" line="44"/>
  </Constructor>
  <Constructor id="_2473" name="iovec" artificial="1" throw="" context="_366" access="public" mangled="_ZN5iovecC1Ev *INTERNAL* " demangled="iovec::iovec()" location="f16:44" file="f16" line="44" inline="1"/>
  <Field id="_2474" name="sequence" type="_90" offset="0" context="_367" access="public" location="f0:3662" file="f0" line="3662"/>
  <Destructor id="_2475" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_367" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::~xcb_list_installed_colormaps_cookie_t()" location="f0:3661" file="f0" line="3661" endline="3661" inline="1">
  </Destructor>
  <OperatorMethod id="_2476" name="=" returns="_5182" artificial="1" throw="" context="_367" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_taSERKS_" demangled="xcb_list_installed_colormaps_cookie_t::operator=(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3661" file="f0" line="3661" endline="3661" inline="1">
    <Argument type="_5183" location="f0:3661" file="f0" line="3661"/>
  </OperatorMethod>
  <Constructor id="_2477" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_367" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3661" file="f0" line="3661" endline="3661" inline="1">
    <Argument type="_5183" location="f0:3661" file="f0" line="3661"/>
  </Constructor>
  <Constructor id="_2478" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_367" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t()" location="f0:3661" file="f0" line="3661" inline="1"/>
  <CvQualifiedType id="_2165r" type="_2165" restrict="1"/>
  <PointerType id="_2480" type="_615c" size="64" align="64"/>
  <CvQualifiedType id="_2480r" type="_2480" restrict="1"/>
  <Field id="_2482" name="depth" type="_1416" offset="0" context="_370" access="public" location="f0:304" file="f0" line="304"/>
  <Field id="_2483" name="pad0" type="_1416" offset="8" context="_370" access="public" location="f0:305" file="f0" line="305"/>
  <Field id="_2484" name="visuals_len" type="_1343" offset="16" context="_370" access="public" location="f0:306" file="f0" line="306"/>
  <Field id="_2485" name="pad1" type="_5135" offset="32" context="_370" access="public" location="f0:307" file="f0" line="307"/>
  <Destructor id="_2486" name="xcb_depth_t" artificial="1" throw="" context="_370" access="public" mangled="_ZN11xcb_depth_tD1Ev *INTERNAL* " demangled="xcb_depth_t::~xcb_depth_t()" location="f0:303" file="f0" line="303" endline="303" inline="1">
  </Destructor>
  <OperatorMethod id="_2487" name="=" returns="_5185" artificial="1" throw="" context="_370" access="public" mangled="_ZN11xcb_depth_taSERKS_" demangled="xcb_depth_t::operator=(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5186" location="f0:303" file="f0" line="303"/>
  </OperatorMethod>
  <Constructor id="_2488" name="xcb_depth_t" artificial="1" throw="" context="_370" access="public" mangled="_ZN11xcb_depth_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5186" location="f0:303" file="f0" line="303"/>
  </Constructor>
  <Constructor id="_2489" name="xcb_depth_t" artificial="1" throw="" context="_370" access="public" mangled="_ZN11xcb_depth_tC1Ev *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t()" location="f0:303" file="f0" line="303" inline="1"/>
  <Field id="_2490" name="__locales" type="_5187" offset="0" context="_372" access="public" location="f18:30" file="f18" line="30"/>
  <Field id="_2491" name="__ctype_b" type="_5188" offset="832" context="_372" access="public" location="f18:33" file="f18" line="33"/>
  <Field id="_2492" name="__ctype_tolower" type="_5189" offset="896" context="_372" access="public" location="f18:34" file="f18" line="34"/>
  <Field id="_2493" name="__ctype_toupper" type="_5189" offset="960" context="_372" access="public" location="f18:35" file="f18" line="35"/>
  <Field id="_2494" name="__names" type="_5190" offset="1024" context="_372" access="public" location="f18:38" file="f18" line="38"/>
  <Destructor id="_2495" name="__locale_struct" artificial="1" throw="" context="_372" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f18:28" file="f18" line="28" endline="28" inline="1">
  </Destructor>
  <OperatorMethod id="_2496" name="=" returns="_5191" artificial="1" throw="" context="_372" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f18:28" file="f18" line="28" endline="28" inline="1">
    <Argument type="_5192" location="f18:28" file="f18" line="28"/>
  </OperatorMethod>
  <Constructor id="_2497" name="__locale_struct" artificial="1" throw="" context="_372" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f18:28" file="f18" line="28" endline="28" inline="1">
    <Argument type="_5192" location="f18:28" file="f18" line="28"/>
  </Constructor>
  <Constructor id="_2498" name="__locale_struct" artificial="1" throw="" context="_372" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f18:28" file="f18" line="28" inline="1"/>
  <PointerType id="_2499" type="_867" size="64" align="64"/>
  <PointerType id="_2500" type="_998c" size="64" align="64"/>
  <Field id="_2501" name="response_type" type="_1416" offset="0" context="_381" access="public" location="f0:981" file="f0" line="981"/>
  <Field id="_2502" name="pad0" type="_1416" offset="8" context="_381" access="public" location="f0:982" file="f0" line="982"/>
  <Field id="_2503" name="sequence" type="_1343" offset="16" context="_381" access="public" location="f0:983" file="f0" line="983"/>
  <Field id="_2504" name="window" type="_649" offset="32" context="_381" access="public" location="f0:984" file="f0" line="984"/>
  <Field id="_2505" name="atom" type="_1607" offset="64" context="_381" access="public" location="f0:985" file="f0" line="985"/>
  <Field id="_2506" name="time" type="_1208" offset="96" context="_381" access="public" location="f0:986" file="f0" line="986"/>
  <Field id="_2507" name="state" type="_1416" offset="128" context="_381" access="public" location="f0:987" file="f0" line="987"/>
  <Field id="_2508" name="pad1" type="_5029" offset="136" context="_381" access="public" location="f0:988" file="f0" line="988"/>
  <Destructor id="_2509" name="xcb_property_notify_event_t" artificial="1" throw="" context="_381" access="public" mangled="_ZN27xcb_property_notify_event_tD1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::~xcb_property_notify_event_t()" location="f0:980" file="f0" line="980" endline="980" inline="1">
  </Destructor>
  <OperatorMethod id="_2510" name="=" returns="_5194" artificial="1" throw="" context="_381" access="public" mangled="_ZN27xcb_property_notify_event_taSERKS_" demangled="xcb_property_notify_event_t::operator=(xcb_property_notify_event_t const&amp;)" location="f0:980" file="f0" line="980" endline="980" inline="1">
    <Argument type="_5195" location="f0:980" file="f0" line="980"/>
  </OperatorMethod>
  <Constructor id="_2511" name="xcb_property_notify_event_t" artificial="1" throw="" context="_381" access="public" mangled="_ZN27xcb_property_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t(xcb_property_notify_event_t const&amp;)" location="f0:980" file="f0" line="980" endline="980" inline="1">
    <Argument type="_5195" location="f0:980" file="f0" line="980"/>
  </Constructor>
  <Constructor id="_2512" name="xcb_property_notify_event_t" artificial="1" throw="" context="_381" access="public" mangled="_ZN27xcb_property_notify_event_tC1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t()" location="f0:980" file="f0" line="980" inline="1"/>
  <CvQualifiedType id="_1845r" type="_1845" restrict="1"/>
  <CvQualifiedType id="_2266r" type="_2266" restrict="1"/>
  <PointerType id="_2515" type="_743" size="64" align="64"/>
  <PointerType id="_2516" type="_753c" size="64" align="64"/>
  <Field id="_2517" name="response_type" type="_1416" offset="0" context="_395" access="public" location="f0:561" file="f0" line="561"/>
  <Field id="_2518" name="detail" type="_561" offset="8" context="_395" access="public" location="f0:562" file="f0" line="562"/>
  <Field id="_2519" name="sequence" type="_1343" offset="16" context="_395" access="public" location="f0:563" file="f0" line="563"/>
  <Field id="_2520" name="time" type="_1208" offset="32" context="_395" access="public" location="f0:564" file="f0" line="564"/>
  <Field id="_2521" name="root" type="_649" offset="64" context="_395" access="public" location="f0:565" file="f0" line="565"/>
  <Field id="_2522" name="event" type="_649" offset="96" context="_395" access="public" location="f0:566" file="f0" line="566"/>
  <Field id="_2523" name="child" type="_649" offset="128" context="_395" access="public" location="f0:567" file="f0" line="567"/>
  <Field id="_2524" name="root_x" type="_846" offset="160" context="_395" access="public" location="f0:568" file="f0" line="568"/>
  <Field id="_2525" name="root_y" type="_846" offset="176" context="_395" access="public" location="f0:569" file="f0" line="569"/>
  <Field id="_2526" name="event_x" type="_846" offset="192" context="_395" access="public" location="f0:570" file="f0" line="570"/>
  <Field id="_2527" name="event_y" type="_846" offset="208" context="_395" access="public" location="f0:571" file="f0" line="571"/>
  <Field id="_2528" name="state" type="_1343" offset="224" context="_395" access="public" location="f0:572" file="f0" line="572"/>
  <Field id="_2529" name="same_screen" type="_1416" offset="240" context="_395" access="public" location="f0:573" file="f0" line="573"/>
  <Field id="_2530" name="pad0" type="_1416" offset="248" context="_395" access="public" location="f0:574" file="f0" line="574"/>
  <Destructor id="_2531" name="xcb_button_press_event_t" artificial="1" throw="" context="_395" access="public" mangled="_ZN24xcb_button_press_event_tD1Ev *INTERNAL* " demangled="xcb_button_press_event_t::~xcb_button_press_event_t()" location="f0:560" file="f0" line="560" endline="560" inline="1">
  </Destructor>
  <OperatorMethod id="_2532" name="=" returns="_5197" artificial="1" throw="" context="_395" access="public" mangled="_ZN24xcb_button_press_event_taSERKS_" demangled="xcb_button_press_event_t::operator=(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5198" location="f0:560" file="f0" line="560"/>
  </OperatorMethod>
  <Constructor id="_2533" name="xcb_button_press_event_t" artificial="1" throw="" context="_395" access="public" mangled="_ZN24xcb_button_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5198" location="f0:560" file="f0" line="560"/>
  </Constructor>
  <Constructor id="_2534" name="xcb_button_press_event_t" artificial="1" throw="" context="_395" access="public" mangled="_ZN24xcb_button_press_event_tC1Ev *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t()" location="f0:560" file="f0" line="560" inline="1"/>
  <PointerType id="_2535" type="_821c" size="64" align="64"/>
  <CvQualifiedType id="_2535r" type="_2535" restrict="1"/>
  <PointerType id="_2537" type="_1745" size="64" align="64"/>
  <FundamentalType id="_2538" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_2539" type="_1439" size="64" align="64"/>
  <PointerType id="_2540" type="_5200" size="64" align="64"/>
  <Field id="_2541" name="left_side_bearing" type="_846" offset="0" context="_409" access="public" location="f0:2677" file="f0" line="2677"/>
  <Field id="_2542" name="right_side_bearing" type="_846" offset="16" context="_409" access="public" location="f0:2678" file="f0" line="2678"/>
  <Field id="_2543" name="character_width" type="_846" offset="32" context="_409" access="public" location="f0:2679" file="f0" line="2679"/>
  <Field id="_2544" name="ascent" type="_846" offset="48" context="_409" access="public" location="f0:2680" file="f0" line="2680"/>
  <Field id="_2545" name="descent" type="_846" offset="64" context="_409" access="public" location="f0:2681" file="f0" line="2681"/>
  <Field id="_2546" name="attributes" type="_1343" offset="80" context="_409" access="public" location="f0:2682" file="f0" line="2682"/>
  <Destructor id="_2547" name="xcb_charinfo_t" artificial="1" throw="" context="_409" access="public" mangled="_ZN14xcb_charinfo_tD1Ev *INTERNAL* " demangled="xcb_charinfo_t::~xcb_charinfo_t()" location="f0:2676" file="f0" line="2676" endline="2676" inline="1">
  </Destructor>
  <OperatorMethod id="_2548" name="=" returns="_5201" artificial="1" throw="" context="_409" access="public" mangled="_ZN14xcb_charinfo_taSERKS_" demangled="xcb_charinfo_t::operator=(xcb_charinfo_t const&amp;)" location="f0:2676" file="f0" line="2676" endline="2676" inline="1">
    <Argument type="_5202" location="f0:2676" file="f0" line="2676"/>
  </OperatorMethod>
  <Constructor id="_2549" name="xcb_charinfo_t" artificial="1" throw="" context="_409" access="public" mangled="_ZN14xcb_charinfo_tC1ERKS_ *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t(xcb_charinfo_t const&amp;)" location="f0:2676" file="f0" line="2676" endline="2676" inline="1">
    <Argument type="_5202" location="f0:2676" file="f0" line="2676"/>
  </Constructor>
  <Constructor id="_2550" name="xcb_charinfo_t" artificial="1" throw="" context="_409" access="public" mangled="_ZN14xcb_charinfo_tC1Ev *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t()" location="f0:2676" file="f0" line="2676" inline="1"/>
  <Field id="_2551" name="major_opcode" type="_1416" offset="0" context="_413" access="public" location="f0:4645" file="f0" line="4645"/>
  <Field id="_2552" name="pad0" type="_1416" offset="8" context="_413" access="public" location="f0:4646" file="f0" line="4646"/>
  <Field id="_2553" name="length" type="_1343" offset="16" context="_413" access="public" location="f0:4647" file="f0" line="4647"/>
  <Destructor id="_2554" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_413" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::~xcb_get_pointer_mapping_request_t()" location="f0:4644" file="f0" line="4644" endline="4644" inline="1">
  </Destructor>
  <OperatorMethod id="_2555" name="=" returns="_5203" artificial="1" throw="" context="_413" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_taSERKS_" demangled="xcb_get_pointer_mapping_request_t::operator=(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4644" file="f0" line="4644" endline="4644" inline="1">
    <Argument type="_5204" location="f0:4644" file="f0" line="4644"/>
  </OperatorMethod>
  <Constructor id="_2556" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_413" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4644" file="f0" line="4644" endline="4644" inline="1">
    <Argument type="_5204" location="f0:4644" file="f0" line="4644"/>
  </Constructor>
  <Constructor id="_2557" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_413" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t()" location="f0:4644" file="f0" line="4644" inline="1"/>
  <Field id="_2558" name="response_type" type="_1416" offset="0" context="_415" access="public" location="f0:2718" file="f0" line="2718"/>
  <Field id="_2559" name="pad0" type="_1416" offset="8" context="_415" access="public" location="f0:2719" file="f0" line="2719"/>
  <Field id="_2560" name="sequence" type="_1343" offset="16" context="_415" access="public" location="f0:2720" file="f0" line="2720"/>
  <Field id="_2561" name="length" type="_669" offset="32" context="_415" access="public" location="f0:2721" file="f0" line="2721"/>
  <Field id="_2562" name="min_bounds" type="_410" offset="64" context="_415" access="public" location="f0:2722" file="f0" line="2722"/>
  <Field id="_2563" name="pad1" type="_5135" offset="160" context="_415" access="public" location="f0:2723" file="f0" line="2723"/>
  <Field id="_2564" name="max_bounds" type="_410" offset="192" context="_415" access="public" location="f0:2724" file="f0" line="2724"/>
  <Field id="_2565" name="pad2" type="_5135" offset="288" context="_415" access="public" location="f0:2725" file="f0" line="2725"/>
  <Field id="_2566" name="min_char_or_byte2" type="_1343" offset="320" context="_415" access="public" location="f0:2726" file="f0" line="2726"/>
  <Field id="_2567" name="max_char_or_byte2" type="_1343" offset="336" context="_415" access="public" location="f0:2727" file="f0" line="2727"/>
  <Field id="_2568" name="default_char" type="_1343" offset="352" context="_415" access="public" location="f0:2728" file="f0" line="2728"/>
  <Field id="_2569" name="properties_len" type="_1343" offset="368" context="_415" access="public" location="f0:2729" file="f0" line="2729"/>
  <Field id="_2570" name="draw_direction" type="_1416" offset="384" context="_415" access="public" location="f0:2730" file="f0" line="2730"/>
  <Field id="_2571" name="min_byte1" type="_1416" offset="392" context="_415" access="public" location="f0:2731" file="f0" line="2731"/>
  <Field id="_2572" name="max_byte1" type="_1416" offset="400" context="_415" access="public" location="f0:2732" file="f0" line="2732"/>
  <Field id="_2573" name="all_chars_exist" type="_1416" offset="408" context="_415" access="public" location="f0:2733" file="f0" line="2733"/>
  <Field id="_2574" name="font_ascent" type="_846" offset="416" context="_415" access="public" location="f0:2734" file="f0" line="2734"/>
  <Field id="_2575" name="font_descent" type="_846" offset="432" context="_415" access="public" location="f0:2735" file="f0" line="2735"/>
  <Field id="_2576" name="char_infos_len" type="_669" offset="448" context="_415" access="public" location="f0:2736" file="f0" line="2736"/>
  <Destructor id="_2577" name="xcb_query_font_reply_t" artificial="1" throw="" context="_415" access="public" mangled="_ZN22xcb_query_font_reply_tD1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::~xcb_query_font_reply_t()" location="f0:2717" file="f0" line="2717" endline="2717" inline="1">
  </Destructor>
  <OperatorMethod id="_2578" name="=" returns="_5205" artificial="1" throw="" context="_415" access="public" mangled="_ZN22xcb_query_font_reply_taSERKS_" demangled="xcb_query_font_reply_t::operator=(xcb_query_font_reply_t const&amp;)" location="f0:2717" file="f0" line="2717" endline="2717" inline="1">
    <Argument type="_5206" location="f0:2717" file="f0" line="2717"/>
  </OperatorMethod>
  <Constructor id="_2579" name="xcb_query_font_reply_t" artificial="1" throw="" context="_415" access="public" mangled="_ZN22xcb_query_font_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t(xcb_query_font_reply_t const&amp;)" location="f0:2717" file="f0" line="2717" endline="2717" inline="1">
    <Argument type="_5206" location="f0:2717" file="f0" line="2717"/>
  </Constructor>
  <Constructor id="_2580" name="xcb_query_font_reply_t" artificial="1" throw="" context="_415" access="public" mangled="_ZN22xcb_query_font_reply_tC1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t()" location="f0:2717" file="f0" line="2717" inline="1"/>
  <PointerType id="_2581" type="_1035" size="64" align="64"/>
  <Field id="_2582" name="major_opcode" type="_1416" offset="0" context="_425" access="public" location="f0:1620" file="f0" line="1620"/>
  <Field id="_2583" name="pad0" type="_1416" offset="8" context="_425" access="public" location="f0:1621" file="f0" line="1621"/>
  <Field id="_2584" name="length" type="_1343" offset="16" context="_425" access="public" location="f0:1622" file="f0" line="1622"/>
  <Field id="_2585" name="window" type="_649" offset="32" context="_425" access="public" location="f0:1623" file="f0" line="1623"/>
  <Destructor id="_2586" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_425" access="public" mangled="_ZN28xcb_map_subwindows_request_tD1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::~xcb_map_subwindows_request_t()" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
  </Destructor>
  <OperatorMethod id="_2587" name="=" returns="_5207" artificial="1" throw="" context="_425" access="public" mangled="_ZN28xcb_map_subwindows_request_taSERKS_" demangled="xcb_map_subwindows_request_t::operator=(xcb_map_subwindows_request_t const&amp;)" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
    <Argument type="_5208" location="f0:1619" file="f0" line="1619"/>
  </OperatorMethod>
  <Constructor id="_2588" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_425" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1ERKS_ *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t(xcb_map_subwindows_request_t const&amp;)" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
    <Argument type="_5208" location="f0:1619" file="f0" line="1619"/>
  </Constructor>
  <Constructor id="_2589" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_425" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t()" location="f0:1619" file="f0" line="1619" inline="1"/>
  <Field id="_2590" name="major_opcode" type="_1416" offset="0" context="_427" access="public" location="f0:1879" file="f0" line="1879"/>
  <Field id="_2591" name="pad0" type="_1416" offset="8" context="_427" access="public" location="f0:1880" file="f0" line="1880"/>
  <Field id="_2592" name="length" type="_1343" offset="16" context="_427" access="public" location="f0:1881" file="f0" line="1881"/>
  <Field id="_2593" name="window" type="_649" offset="32" context="_427" access="public" location="f0:1882" file="f0" line="1882"/>
  <Field id="_2594" name="property" type="_1607" offset="64" context="_427" access="public" location="f0:1883" file="f0" line="1883"/>
  <Destructor id="_2595" name="xcb_delete_property_request_t" artificial="1" throw="" context="_427" access="public" mangled="_ZN29xcb_delete_property_request_tD1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::~xcb_delete_property_request_t()" location="f0:1878" file="f0" line="1878" endline="1878" inline="1">
  </Destructor>
  <OperatorMethod id="_2596" name="=" returns="_5209" artificial="1" throw="" context="_427" access="public" mangled="_ZN29xcb_delete_property_request_taSERKS_" demangled="xcb_delete_property_request_t::operator=(xcb_delete_property_request_t const&amp;)" location="f0:1878" file="f0" line="1878" endline="1878" inline="1">
    <Argument type="_5210" location="f0:1878" file="f0" line="1878"/>
  </OperatorMethod>
  <Constructor id="_2597" name="xcb_delete_property_request_t" artificial="1" throw="" context="_427" access="public" mangled="_ZN29xcb_delete_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t(xcb_delete_property_request_t const&amp;)" location="f0:1878" file="f0" line="1878" endline="1878" inline="1">
    <Argument type="_5210" location="f0:1878" file="f0" line="1878"/>
  </Constructor>
  <Constructor id="_2598" name="xcb_delete_property_request_t" artificial="1" throw="" context="_427" access="public" mangled="_ZN29xcb_delete_property_request_tC1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t()" location="f0:1878" file="f0" line="1878" inline="1"/>
  <PointerType id="_2599" type="_1197" size="64" align="64"/>
  <Field id="_2600" name="data" type="_5211" offset="0" context="_435" access="public" location="f0:314" file="f0" line="314"/>
  <Field id="_2601" name="rem" type="_172" offset="64" context="_435" access="public" location="f0:315" file="f0" line="315"/>
  <Field id="_2602" name="index" type="_172" offset="96" context="_435" access="public" location="f0:316" file="f0" line="316"/>
  <Destructor id="_2603" name="xcb_depth_iterator_t" artificial="1" throw="" context="_435" access="public" mangled="_ZN20xcb_depth_iterator_tD1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::~xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" endline="313" inline="1">
  </Destructor>
  <OperatorMethod id="_2604" name="=" returns="_5212" artificial="1" throw="" context="_435" access="public" mangled="_ZN20xcb_depth_iterator_taSERKS_" demangled="xcb_depth_iterator_t::operator=(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5213" location="f0:313" file="f0" line="313"/>
  </OperatorMethod>
  <Constructor id="_2605" name="xcb_depth_iterator_t" artificial="1" throw="" context="_435" access="public" mangled="_ZN20xcb_depth_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5213" location="f0:313" file="f0" line="313"/>
  </Constructor>
  <Constructor id="_2606" name="xcb_depth_iterator_t" artificial="1" throw="" context="_435" access="public" mangled="_ZN20xcb_depth_iterator_tC1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" inline="1"/>
  <Field id="_2607" name="major_opcode" type="_1416" offset="0" context="_438" access="public" location="f0:3528" file="f0" line="3528"/>
  <Field id="_2608" name="pad0" type="_1416" offset="8" context="_438" access="public" location="f0:3529" file="f0" line="3529"/>
  <Field id="_2609" name="length" type="_1343" offset="16" context="_438" access="public" location="f0:3530" file="f0" line="3530"/>
  <Field id="_2610" name="drawable" type="_840" offset="32" context="_438" access="public" location="f0:3531" file="f0" line="3531"/>
  <Field id="_2611" name="gc" type="_1719" offset="64" context="_438" access="public" location="f0:3532" file="f0" line="3532"/>
  <Field id="_2612" name="x" type="_846" offset="96" context="_438" access="public" location="f0:3533" file="f0" line="3533"/>
  <Field id="_2613" name="y" type="_846" offset="112" context="_438" access="public" location="f0:3534" file="f0" line="3534"/>
  <Destructor id="_2614" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_438" access="public" mangled="_ZN25xcb_poly_text_8_request_tD1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::~xcb_poly_text_8_request_t()" location="f0:3527" file="f0" line="3527" endline="3527" inline="1">
  </Destructor>
  <OperatorMethod id="_2615" name="=" returns="_5214" artificial="1" throw="" context="_438" access="public" mangled="_ZN25xcb_poly_text_8_request_taSERKS_" demangled="xcb_poly_text_8_request_t::operator=(xcb_poly_text_8_request_t const&amp;)" location="f0:3527" file="f0" line="3527" endline="3527" inline="1">
    <Argument type="_5215" location="f0:3527" file="f0" line="3527"/>
  </OperatorMethod>
  <Constructor id="_2616" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_438" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t(xcb_poly_text_8_request_t const&amp;)" location="f0:3527" file="f0" line="3527" endline="3527" inline="1">
    <Argument type="_5215" location="f0:3527" file="f0" line="3527"/>
  </Constructor>
  <Constructor id="_2617" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_438" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t()" location="f0:3527" file="f0" line="3527" inline="1"/>
  <PointerType id="_2618" type="_1043" size="64" align="64"/>
  <CvQualifiedType id="_2452r" type="_2452" restrict="1"/>
  <CvQualifiedType id="_1076r" type="_1076" restrict="1"/>
  <CvQualifiedType id="_172v" type="_172" volatile="1"/>
  <PointerType id="_2622" type="_1660" size="64" align="64"/>
  <PointerType id="_2623" type="_93c" size="64" align="64"/>
  <Field id="_2624" name="response_type" type="_1416" offset="0" context="_449" access="public" location="f0:1173" file="f0" line="1173"/>
  <Field id="_2625" name="format" type="_1416" offset="8" context="_449" access="public" location="f0:1174" file="f0" line="1174"/>
  <Field id="_2626" name="sequence" type="_1343" offset="16" context="_449" access="public" location="f0:1175" file="f0" line="1175"/>
  <Field id="_2627" name="window" type="_649" offset="32" context="_449" access="public" location="f0:1176" file="f0" line="1176"/>
  <Field id="_2628" name="type" type="_1607" offset="64" context="_449" access="public" location="f0:1177" file="f0" line="1177"/>
  <Field id="_2629" name="data" type="_318" offset="96" context="_449" access="public" location="f0:1178" file="f0" line="1178"/>
  <Destructor id="_2630" name="xcb_client_message_event_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN26xcb_client_message_event_tD1Ev *INTERNAL* " demangled="xcb_client_message_event_t::~xcb_client_message_event_t()" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
  </Destructor>
  <OperatorMethod id="_2631" name="=" returns="_5217" artificial="1" throw="" context="_449" access="public" mangled="_ZN26xcb_client_message_event_taSERKS_" demangled="xcb_client_message_event_t::operator=(xcb_client_message_event_t const&amp;)" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
    <Argument type="_5218" location="f0:1172" file="f0" line="1172"/>
  </OperatorMethod>
  <Constructor id="_2632" name="xcb_client_message_event_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN26xcb_client_message_event_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t(xcb_client_message_event_t const&amp;)" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
    <Argument type="_5218" location="f0:1172" file="f0" line="1172"/>
  </Constructor>
  <Constructor id="_2633" name="xcb_client_message_event_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN26xcb_client_message_event_tC1Ev *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t()" location="f0:1172" file="f0" line="1172" inline="1"/>
  <Field id="_2634" name="major_opcode" type="_1416" offset="0" context="_451" access="public" location="f0:4330" file="f0" line="4330"/>
  <Field id="_2635" name="pad0" type="_1416" offset="8" context="_451" access="public" location="f0:4331" file="f0" line="4331"/>
  <Field id="_2636" name="length" type="_1343" offset="16" context="_451" access="public" location="f0:4332" file="f0" line="4332"/>
  <Field id="_2637" name="acceleration_numerator" type="_846" offset="32" context="_451" access="public" location="f0:4333" file="f0" line="4333"/>
  <Field id="_2638" name="acceleration_denominator" type="_846" offset="48" context="_451" access="public" location="f0:4334" file="f0" line="4334"/>
  <Field id="_2639" name="threshold" type="_846" offset="64" context="_451" access="public" location="f0:4335" file="f0" line="4335"/>
  <Field id="_2640" name="do_acceleration" type="_1416" offset="80" context="_451" access="public" location="f0:4336" file="f0" line="4336"/>
  <Field id="_2641" name="do_threshold" type="_1416" offset="88" context="_451" access="public" location="f0:4337" file="f0" line="4337"/>
  <Destructor id="_2642" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_451" access="public" mangled="_ZN36xcb_change_pointer_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::~xcb_change_pointer_control_request_t()" location="f0:4329" file="f0" line="4329" endline="4329" inline="1">
  </Destructor>
  <OperatorMethod id="_2643" name="=" returns="_5219" artificial="1" throw="" context="_451" access="public" mangled="_ZN36xcb_change_pointer_control_request_taSERKS_" demangled="xcb_change_pointer_control_request_t::operator=(xcb_change_pointer_control_request_t const&amp;)" location="f0:4329" file="f0" line="4329" endline="4329" inline="1">
    <Argument type="_5220" location="f0:4329" file="f0" line="4329"/>
  </OperatorMethod>
  <Constructor id="_2644" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_451" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t(xcb_change_pointer_control_request_t const&amp;)" location="f0:4329" file="f0" line="4329" endline="4329" inline="1">
    <Argument type="_5220" location="f0:4329" file="f0" line="4329"/>
  </Constructor>
  <Constructor id="_2645" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_451" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t()" location="f0:4329" file="f0" line="4329" inline="1"/>
  <Field id="_2646" name="response_type" type="_1416" offset="0" context="_460" access="public" location="f0:4363" file="f0" line="4363"/>
  <Field id="_2647" name="pad0" type="_1416" offset="8" context="_460" access="public" location="f0:4364" file="f0" line="4364"/>
  <Field id="_2648" name="sequence" type="_1343" offset="16" context="_460" access="public" location="f0:4365" file="f0" line="4365"/>
  <Field id="_2649" name="length" type="_669" offset="32" context="_460" access="public" location="f0:4366" file="f0" line="4366"/>
  <Field id="_2650" name="acceleration_numerator" type="_1343" offset="64" context="_460" access="public" location="f0:4367" file="f0" line="4367"/>
  <Field id="_2651" name="acceleration_denominator" type="_1343" offset="80" context="_460" access="public" location="f0:4368" file="f0" line="4368"/>
  <Field id="_2652" name="threshold" type="_1343" offset="96" context="_460" access="public" location="f0:4369" file="f0" line="4369"/>
  <Field id="_2653" name="pad1" type="_5221" offset="112" context="_460" access="public" location="f0:4370" file="f0" line="4370"/>
  <Destructor id="_2654" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::~xcb_get_pointer_control_reply_t()" location="f0:4362" file="f0" line="4362" endline="4362" inline="1">
  </Destructor>
  <OperatorMethod id="_2655" name="=" returns="_5222" artificial="1" throw="" context="_460" access="public" mangled="_ZN31xcb_get_pointer_control_reply_taSERKS_" demangled="xcb_get_pointer_control_reply_t::operator=(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4362" file="f0" line="4362" endline="4362" inline="1">
    <Argument type="_5223" location="f0:4362" file="f0" line="4362"/>
  </OperatorMethod>
  <Constructor id="_2656" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4362" file="f0" line="4362" endline="4362" inline="1">
    <Argument type="_5223" location="f0:4362" file="f0" line="4362"/>
  </Constructor>
  <Constructor id="_2657" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t()" location="f0:4362" file="f0" line="4362" inline="1"/>
  <Field id="_2658" name="__cancel_routine" type="_2540" offset="0" context="_463" access="public" location="f3:553" file="f3" line="553"/>
  <Field id="_2659" name="__cancel_arg" type="_477" offset="64" context="_463" access="public" location="f3:554" file="f3" line="554"/>
  <Field id="_2660" name="__do_it" type="_172" offset="128" context="_463" access="public" location="f3:555" file="f3" line="555"/>
  <Field id="_2661" name="__cancel_type" type="_172" offset="160" context="_463" access="public" location="f3:556" file="f3" line="556"/>
  <Destructor id="_2662" name="__pthread_cleanup_frame" artificial="1" throw="" context="_463" access="public" mangled="_ZN23__pthread_cleanup_frameD1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::~__pthread_cleanup_frame()" location="f3:552" file="f3" line="552" endline="552" inline="1">
  </Destructor>
  <OperatorMethod id="_2663" name="=" returns="_5224" artificial="1" throw="" context="_463" access="public" mangled="_ZN23__pthread_cleanup_frameaSERKS_" demangled="__pthread_cleanup_frame::operator=(__pthread_cleanup_frame const&amp;)" location="f3:552" file="f3" line="552" endline="552" inline="1">
    <Argument type="_5225" location="f3:552" file="f3" line="552"/>
  </OperatorMethod>
  <Constructor id="_2664" name="__pthread_cleanup_frame" artificial="1" throw="" context="_463" access="public" mangled="_ZN23__pthread_cleanup_frameC1ERKS_ *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame(__pthread_cleanup_frame const&amp;)" location="f3:552" file="f3" line="552" endline="552" inline="1">
    <Argument type="_5225" location="f3:552" file="f3" line="552"/>
  </Constructor>
  <Constructor id="_2665" name="__pthread_cleanup_frame" artificial="1" throw="" context="_463" access="public" mangled="_ZN23__pthread_cleanup_frameC1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame()" location="f3:552" file="f3" line="552" inline="1"/>
  <Field id="_2666" name="response_type" type="_1416" offset="0" context="_466" access="public" location="f0:1999" file="f0" line="1999"/>
  <Field id="_2667" name="pad0" type="_1416" offset="8" context="_466" access="public" location="f0:2000" file="f0" line="2000"/>
  <Field id="_2668" name="sequence" type="_1343" offset="16" context="_466" access="public" location="f0:2001" file="f0" line="2001"/>
  <Field id="_2669" name="length" type="_669" offset="32" context="_466" access="public" location="f0:2002" file="f0" line="2002"/>
  <Field id="_2670" name="owner" type="_649" offset="64" context="_466" access="public" location="f0:2003" file="f0" line="2003"/>
  <Destructor id="_2671" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_466" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::~xcb_get_selection_owner_reply_t()" location="f0:1998" file="f0" line="1998" endline="1998" inline="1">
  </Destructor>
  <OperatorMethod id="_2672" name="=" returns="_5226" artificial="1" throw="" context="_466" access="public" mangled="_ZN31xcb_get_selection_owner_reply_taSERKS_" demangled="xcb_get_selection_owner_reply_t::operator=(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1998" file="f0" line="1998" endline="1998" inline="1">
    <Argument type="_5227" location="f0:1998" file="f0" line="1998"/>
  </OperatorMethod>
  <Constructor id="_2673" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_466" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1998" file="f0" line="1998" endline="1998" inline="1">
    <Argument type="_5227" location="f0:1998" file="f0" line="1998"/>
  </Constructor>
  <Constructor id="_2674" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_466" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t()" location="f0:1998" file="f0" line="1998" inline="1"/>
  <Field id="_2675" name="major_opcode" type="_1416" offset="0" context="_470" access="public" location="f0:4108" file="f0" line="4108"/>
  <Field id="_2676" name="_class" type="_1416" offset="8" context="_470" access="public" location="f0:4109" file="f0" line="4109"/>
  <Field id="_2677" name="length" type="_1343" offset="16" context="_470" access="public" location="f0:4110" file="f0" line="4110"/>
  <Field id="_2678" name="drawable" type="_840" offset="32" context="_470" access="public" location="f0:4111" file="f0" line="4111"/>
  <Field id="_2679" name="width" type="_1343" offset="64" context="_470" access="public" location="f0:4112" file="f0" line="4112"/>
  <Field id="_2680" name="height" type="_1343" offset="80" context="_470" access="public" location="f0:4113" file="f0" line="4113"/>
  <Destructor id="_2681" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_470" access="public" mangled="_ZN29xcb_query_best_size_request_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::~xcb_query_best_size_request_t()" location="f0:4107" file="f0" line="4107" endline="4107" inline="1">
  </Destructor>
  <OperatorMethod id="_2682" name="=" returns="_5228" artificial="1" throw="" context="_470" access="public" mangled="_ZN29xcb_query_best_size_request_taSERKS_" demangled="xcb_query_best_size_request_t::operator=(xcb_query_best_size_request_t const&amp;)" location="f0:4107" file="f0" line="4107" endline="4107" inline="1">
    <Argument type="_5229" location="f0:4107" file="f0" line="4107"/>
  </OperatorMethod>
  <Constructor id="_2683" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_470" access="public" mangled="_ZN29xcb_query_best_size_request_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t(xcb_query_best_size_request_t const&amp;)" location="f0:4107" file="f0" line="4107" endline="4107" inline="1">
    <Argument type="_5229" location="f0:4107" file="f0" line="4107"/>
  </Constructor>
  <Constructor id="_2684" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_470" access="public" mangled="_ZN29xcb_query_best_size_request_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t()" location="f0:4107" file="f0" line="4107" inline="1"/>
  <CvQualifiedType id="_1992r" type="_1992" restrict="1"/>
  <PointerType id="_2686" type="_1090c" size="64" align="64"/>
  <PointerType id="_2687" type="_520" size="64" align="64"/>
  <Field id="_2688" name="major_opcode" type="_1416" offset="0" context="_482" access="public" location="f0:2556" file="f0" line="2556"/>
  <Field id="_2689" name="revert_to" type="_1416" offset="8" context="_482" access="public" location="f0:2557" file="f0" line="2557"/>
  <Field id="_2690" name="length" type="_1343" offset="16" context="_482" access="public" location="f0:2558" file="f0" line="2558"/>
  <Field id="_2691" name="focus" type="_649" offset="32" context="_482" access="public" location="f0:2559" file="f0" line="2559"/>
  <Field id="_2692" name="time" type="_1208" offset="64" context="_482" access="public" location="f0:2560" file="f0" line="2560"/>
  <Destructor id="_2693" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_482" access="public" mangled="_ZN29xcb_set_input_focus_request_tD1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::~xcb_set_input_focus_request_t()" location="f0:2555" file="f0" line="2555" endline="2555" inline="1">
  </Destructor>
  <OperatorMethod id="_2694" name="=" returns="_5231" artificial="1" throw="" context="_482" access="public" mangled="_ZN29xcb_set_input_focus_request_taSERKS_" demangled="xcb_set_input_focus_request_t::operator=(xcb_set_input_focus_request_t const&amp;)" location="f0:2555" file="f0" line="2555" endline="2555" inline="1">
    <Argument type="_5232" location="f0:2555" file="f0" line="2555"/>
  </OperatorMethod>
  <Constructor id="_2695" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_482" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1ERKS_ *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t(xcb_set_input_focus_request_t const&amp;)" location="f0:2555" file="f0" line="2555" endline="2555" inline="1">
    <Argument type="_5232" location="f0:2555" file="f0" line="2555"/>
  </Constructor>
  <Constructor id="_2696" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_482" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t()" location="f0:2555" file="f0" line="2555" inline="1"/>
  <PointerType id="_2697" type="_1020c" size="64" align="64"/>
  <Field id="_2698" name="response_type" type="_1416" offset="0" context="_485" access="public" location="f0:1519" file="f0" line="1519"/>
  <Field id="_2699" name="backing_store" type="_1416" offset="8" context="_485" access="public" location="f0:1520" file="f0" line="1520"/>
  <Field id="_2700" name="sequence" type="_1343" offset="16" context="_485" access="public" location="f0:1521" file="f0" line="1521"/>
  <Field id="_2701" name="length" type="_669" offset="32" context="_485" access="public" location="f0:1522" file="f0" line="1522"/>
  <Field id="_2702" name="visual" type="_1707" offset="64" context="_485" access="public" location="f0:1523" file="f0" line="1523"/>
  <Field id="_2703" name="_class" type="_1343" offset="96" context="_485" access="public" location="f0:1524" file="f0" line="1524"/>
  <Field id="_2704" name="bit_gravity" type="_1416" offset="112" context="_485" access="public" location="f0:1525" file="f0" line="1525"/>
  <Field id="_2705" name="win_gravity" type="_1416" offset="120" context="_485" access="public" location="f0:1526" file="f0" line="1526"/>
  <Field id="_2706" name="backing_planes" type="_669" offset="128" context="_485" access="public" location="f0:1527" file="f0" line="1527"/>
  <Field id="_2707" name="backing_pixel" type="_669" offset="160" context="_485" access="public" location="f0:1528" file="f0" line="1528"/>
  <Field id="_2708" name="save_under" type="_1416" offset="192" context="_485" access="public" location="f0:1529" file="f0" line="1529"/>
  <Field id="_2709" name="map_is_installed" type="_1416" offset="200" context="_485" access="public" location="f0:1530" file="f0" line="1530"/>
  <Field id="_2710" name="map_state" type="_1416" offset="208" context="_485" access="public" location="f0:1531" file="f0" line="1531"/>
  <Field id="_2711" name="override_redirect" type="_1416" offset="216" context="_485" access="public" location="f0:1532" file="f0" line="1532"/>
  <Field id="_2712" name="colormap" type="_690" offset="224" context="_485" access="public" location="f0:1533" file="f0" line="1533"/>
  <Field id="_2713" name="all_event_masks" type="_669" offset="256" context="_485" access="public" location="f0:1534" file="f0" line="1534"/>
  <Field id="_2714" name="your_event_mask" type="_669" offset="288" context="_485" access="public" location="f0:1535" file="f0" line="1535"/>
  <Field id="_2715" name="do_not_propagate_mask" type="_1343" offset="320" context="_485" access="public" location="f0:1536" file="f0" line="1536"/>
  <Field id="_2716" name="pad0" type="_5023" offset="336" context="_485" access="public" location="f0:1537" file="f0" line="1537"/>
  <Destructor id="_2717" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::~xcb_get_window_attributes_reply_t()" location="f0:1518" file="f0" line="1518" endline="1518" inline="1">
  </Destructor>
  <OperatorMethod id="_2718" name="=" returns="_5234" artificial="1" throw="" context="_485" access="public" mangled="_ZN33xcb_get_window_attributes_reply_taSERKS_" demangled="xcb_get_window_attributes_reply_t::operator=(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1518" file="f0" line="1518" endline="1518" inline="1">
    <Argument type="_5235" location="f0:1518" file="f0" line="1518"/>
  </OperatorMethod>
  <Constructor id="_2719" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1518" file="f0" line="1518" endline="1518" inline="1">
    <Argument type="_5235" location="f0:1518" file="f0" line="1518"/>
  </Constructor>
  <Constructor id="_2720" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t()" location="f0:1518" file="f0" line="1518" inline="1"/>
  <PointerType id="_2721" type="_965" size="64" align="64"/>
  <PointerType id="_2722" type="_327" size="64" align="64"/>
  <Field id="_2723" name="response_type" type="_1416" offset="0" context="_511" access="public" location="f0:4120" file="f0" line="4120"/>
  <Field id="_2724" name="pad0" type="_1416" offset="8" context="_511" access="public" location="f0:4121" file="f0" line="4121"/>
  <Field id="_2725" name="sequence" type="_1343" offset="16" context="_511" access="public" location="f0:4122" file="f0" line="4122"/>
  <Field id="_2726" name="length" type="_669" offset="32" context="_511" access="public" location="f0:4123" file="f0" line="4123"/>
  <Field id="_2727" name="width" type="_1343" offset="64" context="_511" access="public" location="f0:4124" file="f0" line="4124"/>
  <Field id="_2728" name="height" type="_1343" offset="80" context="_511" access="public" location="f0:4125" file="f0" line="4125"/>
  <Destructor id="_2729" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN27xcb_query_best_size_reply_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::~xcb_query_best_size_reply_t()" location="f0:4119" file="f0" line="4119" endline="4119" inline="1">
  </Destructor>
  <OperatorMethod id="_2730" name="=" returns="_5236" artificial="1" throw="" context="_511" access="public" mangled="_ZN27xcb_query_best_size_reply_taSERKS_" demangled="xcb_query_best_size_reply_t::operator=(xcb_query_best_size_reply_t const&amp;)" location="f0:4119" file="f0" line="4119" endline="4119" inline="1">
    <Argument type="_5237" location="f0:4119" file="f0" line="4119"/>
  </OperatorMethod>
  <Constructor id="_2731" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t(xcb_query_best_size_reply_t const&amp;)" location="f0:4119" file="f0" line="4119" endline="4119" inline="1">
    <Argument type="_5237" location="f0:4119" file="f0" line="4119"/>
  </Constructor>
  <Constructor id="_2732" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t()" location="f0:4119" file="f0" line="4119" inline="1"/>
  <Field id="_2733" name="data" type="_5238" offset="0" context="_516" access="public" location="f0:55" file="f0" line="55"/>
  <Field id="_2734" name="rem" type="_172" offset="64" context="_516" access="public" location="f0:56" file="f0" line="56"/>
  <Field id="_2735" name="index" type="_172" offset="96" context="_516" access="public" location="f0:57" file="f0" line="57"/>
  <Destructor id="_2736" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_516" access="public" mangled="_ZN21xcb_pixmap_iterator_tD1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::~xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" endline="54" inline="1">
  </Destructor>
  <OperatorMethod id="_2737" name="=" returns="_5239" artificial="1" throw="" context="_516" access="public" mangled="_ZN21xcb_pixmap_iterator_taSERKS_" demangled="xcb_pixmap_iterator_t::operator=(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5240" location="f0:54" file="f0" line="54"/>
  </OperatorMethod>
  <Constructor id="_2738" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_516" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5240" location="f0:54" file="f0" line="54"/>
  </Constructor>
  <Constructor id="_2739" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_516" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" inline="1"/>
  <PointerType id="_2740" type="_1076" size="64" align="64"/>
  <Field id="_2741" name="modes" type="_90" offset="0" context="_519" access="public" location="f20:27" file="f20" line="27"/>
  <Field id="_2742" name="offset" type="_1747" offset="64" context="_519" access="public" location="f20:28" file="f20" line="28"/>
  <Field id="_2743" name="freq" type="_1747" offset="128" context="_519" access="public" location="f20:29" file="f20" line="29"/>
  <Field id="_2744" name="maxerror" type="_1747" offset="192" context="_519" access="public" location="f20:30" file="f20" line="30"/>
  <Field id="_2745" name="esterror" type="_1747" offset="256" context="_519" access="public" location="f20:31" file="f20" line="31"/>
  <Field id="_2746" name="status" type="_172" offset="320" context="_519" access="public" location="f20:32" file="f20" line="32"/>
  <Field id="_2747" name="constant" type="_1747" offset="384" context="_519" access="public" location="f20:33" file="f20" line="33"/>
  <Field id="_2748" name="precision" type="_1747" offset="448" context="_519" access="public" location="f20:34" file="f20" line="34"/>
  <Field id="_2749" name="tolerance" type="_1747" offset="512" context="_519" access="public" location="f20:35" file="f20" line="35"/>
  <Field id="_2750" name="time" type="_18" offset="576" context="_519" access="public" location="f20:36" file="f20" line="36"/>
  <Field id="_2751" name="tick" type="_1747" offset="704" context="_519" access="public" location="f20:37" file="f20" line="37"/>
  <Field id="_2752" name="ppsfreq" type="_1747" offset="768" context="_519" access="public" location="f20:38" file="f20" line="38"/>
  <Field id="_2753" name="jitter" type="_1747" offset="832" context="_519" access="public" location="f20:39" file="f20" line="39"/>
  <Field id="_2754" name="shift" type="_172" offset="896" context="_519" access="public" location="f20:40" file="f20" line="40"/>
  <Field id="_2755" name="stabil" type="_1747" offset="960" context="_519" access="public" location="f20:41" file="f20" line="41"/>
  <Field id="_2756" name="jitcnt" type="_1747" offset="1024" context="_519" access="public" location="f20:42" file="f20" line="42"/>
  <Field id="_2757" name="calcnt" type="_1747" offset="1088" context="_519" access="public" location="f20:43" file="f20" line="43"/>
  <Field id="_2758" name="errcnt" type="_1747" offset="1152" context="_519" access="public" location="f20:44" file="f20" line="44"/>
  <Field id="_2759" name="stbcnt" type="_1747" offset="1216" context="_519" access="public" location="f20:45" file="f20" line="45"/>
  <Field id="_2760" name="tai" type="_172" offset="1280" context="_519" access="public" location="f20:47" file="f20" line="47"/>
  <Field id="_2761" name="" bits="32" type="_172" offset="1312" context="_519" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2762" name="" bits="32" type="_172" offset="1344" context="_519" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2763" name="" bits="32" type="_172" offset="1376" context="_519" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2764" name="" bits="32" type="_172" offset="1408" context="_519" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2765" name="" bits="32" type="_172" offset="1440" context="_519" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2766" name="" bits="32" type="_172" offset="1472" context="_519" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2767" name="" bits="32" type="_172" offset="1504" context="_519" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2768" name="" bits="32" type="_172" offset="1536" context="_519" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2769" name="" bits="32" type="_172" offset="1568" context="_519" access="public" location="f20:52" file="f20" line="52"/>
  <Field id="_2770" name="" bits="32" type="_172" offset="1600" context="_519" access="public" location="f20:52" file="f20" line="52"/>
  <Field id="_2771" name="" bits="32" type="_172" offset="1632" context="_519" access="public" location="f20:52" file="f20" line="52"/>
  <Destructor id="_2772" name="timex" artificial="1" throw="" context="_519" access="public" mangled="_ZN5timexD1Ev *INTERNAL* " demangled="timex::~timex()" location="f20:26" file="f20" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_2773" name="=" returns="_5241" artificial="1" throw="" context="_519" access="public" mangled="_ZN5timexaSERKS_" demangled="timex::operator=(timex const&amp;)" location="f20:26" file="f20" line="26" endline="26" inline="1">
    <Argument type="_5242" location="f20:26" file="f20" line="26"/>
  </OperatorMethod>
  <Constructor id="_2774" name="timex" artificial="1" throw="" context="_519" access="public" mangled="_ZN5timexC1ERKS_ *INTERNAL* " demangled="timex::timex(timex const&amp;)" location="f20:26" file="f20" line="26" endline="26" inline="1">
    <Argument type="_5242" location="f20:26" file="f20" line="26"/>
  </Constructor>
  <Constructor id="_2775" name="timex" artificial="1" throw="" context="_519" access="public" mangled="_ZN5timexC1Ev *INTERNAL* " demangled="timex::timex()" location="f20:26" file="f20" line="26" inline="1"/>
  <Field id="_2776" name="__size" type="_5243" offset="0" context="_520" access="public" location="f8:232" file="f8" line="232"/>
  <Field id="_2777" name="__align" type="_29" offset="0" context="_520" access="public" location="f8:233" file="f8" line="233"/>
  <Destructor id="_2778" name="._11" artificial="1" throw="" context="_520" access="public" mangled="_ZN17pthread_barrier_tD1Ev *INTERNAL* " demangled="pthread_barrier_t::~pthread_barrier_t()" location="f8:234" file="f8" line="234" endline="234" inline="1">
  </Destructor>
  <OperatorMethod id="_2779" name="=" returns="_5244" artificial="1" throw="" context="_520" access="public" mangled="_ZN17pthread_barrier_taSERKS_" demangled="pthread_barrier_t::operator=(pthread_barrier_t const&amp;)" location="f8:234" file="f8" line="234" endline="234" inline="1">
    <Argument type="_5245" location="f8:231" file="f8" line="231"/>
  </OperatorMethod>
  <Constructor id="_2780" name="._11" artificial="1" throw="" context="_520" access="public" mangled="_ZN17pthread_barrier_tC1ERKS_ *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t(pthread_barrier_t const&amp;)" location="f8:234" file="f8" line="234" endline="234" inline="1">
    <Argument type="_5245" location="f8:231" file="f8" line="231"/>
  </Constructor>
  <Constructor id="_2781" name="._11" artificial="1" throw="" context="_520" access="public" mangled="_ZN17pthread_barrier_tC1Ev *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t()" location="f8:234" file="f8" line="234" inline="1"/>
  <Field id="_2782" name="major_opcode" type="_1416" offset="0" context="_523" access="public" location="f0:1942" file="f0" line="1942"/>
  <Field id="_2783" name="pad0" type="_1416" offset="8" context="_523" access="public" location="f0:1943" file="f0" line="1943"/>
  <Field id="_2784" name="length" type="_1343" offset="16" context="_523" access="public" location="f0:1944" file="f0" line="1944"/>
  <Field id="_2785" name="window" type="_649" offset="32" context="_523" access="public" location="f0:1945" file="f0" line="1945"/>
  <Destructor id="_2786" name="xcb_list_properties_request_t" artificial="1" throw="" context="_523" access="public" mangled="_ZN29xcb_list_properties_request_tD1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::~xcb_list_properties_request_t()" location="f0:1941" file="f0" line="1941" endline="1941" inline="1">
  </Destructor>
  <OperatorMethod id="_2787" name="=" returns="_5246" artificial="1" throw="" context="_523" access="public" mangled="_ZN29xcb_list_properties_request_taSERKS_" demangled="xcb_list_properties_request_t::operator=(xcb_list_properties_request_t const&amp;)" location="f0:1941" file="f0" line="1941" endline="1941" inline="1">
    <Argument type="_5247" location="f0:1941" file="f0" line="1941"/>
  </OperatorMethod>
  <Constructor id="_2788" name="xcb_list_properties_request_t" artificial="1" throw="" context="_523" access="public" mangled="_ZN29xcb_list_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t(xcb_list_properties_request_t const&amp;)" location="f0:1941" file="f0" line="1941" endline="1941" inline="1">
    <Argument type="_5247" location="f0:1941" file="f0" line="1941"/>
  </Constructor>
  <Constructor id="_2789" name="xcb_list_properties_request_t" artificial="1" throw="" context="_523" access="public" mangled="_ZN29xcb_list_properties_request_tC1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t()" location="f0:1941" file="f0" line="1941" inline="1"/>
  <PointerType id="_2790" type="_573" size="64" align="64"/>
  <Field id="_2791" name="status" type="_1416" offset="0" context="_536" access="public" location="f0:431" file="f0" line="431"/>
  <Field id="_2792" name="pad0" type="_5248" offset="8" context="_536" access="public" location="f0:432" file="f0" line="432"/>
  <Field id="_2793" name="length" type="_1343" offset="48" context="_536" access="public" location="f0:433" file="f0" line="433"/>
  <Destructor id="_2794" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_536" access="public" mangled="_ZN24xcb_setup_authenticate_tD1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::~xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" endline="430" inline="1">
  </Destructor>
  <OperatorMethod id="_2795" name="=" returns="_5249" artificial="1" throw="" context="_536" access="public" mangled="_ZN24xcb_setup_authenticate_taSERKS_" demangled="xcb_setup_authenticate_t::operator=(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5250" location="f0:430" file="f0" line="430"/>
  </OperatorMethod>
  <Constructor id="_2796" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_536" access="public" mangled="_ZN24xcb_setup_authenticate_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5250" location="f0:430" file="f0" line="430"/>
  </Constructor>
  <Constructor id="_2797" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_536" access="public" mangled="_ZN24xcb_setup_authenticate_tC1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" inline="1"/>
  <Field id="_2798" name="response_type" type="_1416" offset="0" context="_538" access="public" location="f0:734" file="f0" line="734"/>
  <Field id="_2799" name="pad0" type="_1416" offset="8" context="_538" access="public" location="f0:735" file="f0" line="735"/>
  <Field id="_2800" name="sequence" type="_1343" offset="16" context="_538" access="public" location="f0:736" file="f0" line="736"/>
  <Field id="_2801" name="drawable" type="_840" offset="32" context="_538" access="public" location="f0:737" file="f0" line="737"/>
  <Field id="_2802" name="minor_opcode" type="_1343" offset="64" context="_538" access="public" location="f0:738" file="f0" line="738"/>
  <Field id="_2803" name="major_opcode" type="_1416" offset="80" context="_538" access="public" location="f0:739" file="f0" line="739"/>
  <Field id="_2804" name="pad1" type="_1416" offset="88" context="_538" access="public" location="f0:740" file="f0" line="740"/>
  <Destructor id="_2805" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN23xcb_no_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::~xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" endline="733" inline="1">
  </Destructor>
  <OperatorMethod id="_2806" name="=" returns="_5251" artificial="1" throw="" context="_538" access="public" mangled="_ZN23xcb_no_exposure_event_taSERKS_" demangled="xcb_no_exposure_event_t::operator=(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5252" location="f0:733" file="f0" line="733"/>
  </OperatorMethod>
  <Constructor id="_2807" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN23xcb_no_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5252" location="f0:733" file="f0" line="733"/>
  </Constructor>
  <Constructor id="_2808" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN23xcb_no_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" inline="1"/>
  <PointerType id="_2809" type="_1607" size="64" align="64"/>
  <Field id="_2810" name="response_type" type="_1416" offset="0" context="_544" access="public" location="f0:914" file="f0" line="914"/>
  <Field id="_2811" name="pad0" type="_1416" offset="8" context="_544" access="public" location="f0:915" file="f0" line="915"/>
  <Field id="_2812" name="sequence" type="_1343" offset="16" context="_544" access="public" location="f0:916" file="f0" line="916"/>
  <Field id="_2813" name="event" type="_649" offset="32" context="_544" access="public" location="f0:917" file="f0" line="917"/>
  <Field id="_2814" name="window" type="_649" offset="64" context="_544" access="public" location="f0:918" file="f0" line="918"/>
  <Field id="_2815" name="x" type="_846" offset="96" context="_544" access="public" location="f0:919" file="f0" line="919"/>
  <Field id="_2816" name="y" type="_846" offset="112" context="_544" access="public" location="f0:920" file="f0" line="920"/>
  <Destructor id="_2817" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_544" access="public" mangled="_ZN26xcb_gravity_notify_event_tD1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::~xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" endline="913" inline="1">
  </Destructor>
  <OperatorMethod id="_2818" name="=" returns="_5253" artificial="1" throw="" context="_544" access="public" mangled="_ZN26xcb_gravity_notify_event_taSERKS_" demangled="xcb_gravity_notify_event_t::operator=(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5254" location="f0:913" file="f0" line="913"/>
  </OperatorMethod>
  <Constructor id="_2819" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_544" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5254" location="f0:913" file="f0" line="913"/>
  </Constructor>
  <Constructor id="_2820" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_544" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" inline="1"/>
  <PointerType id="_2821" type="_821" size="64" align="64"/>
  <Field id="_2822" name="response_type" type="_1416" offset="0" context="_547" access="public" location="f0:1727" file="f0" line="1727"/>
  <Field id="_2823" name="depth" type="_1416" offset="8" context="_547" access="public" location="f0:1728" file="f0" line="1728"/>
  <Field id="_2824" name="sequence" type="_1343" offset="16" context="_547" access="public" location="f0:1729" file="f0" line="1729"/>
  <Field id="_2825" name="length" type="_669" offset="32" context="_547" access="public" location="f0:1730" file="f0" line="1730"/>
  <Field id="_2826" name="root" type="_649" offset="64" context="_547" access="public" location="f0:1731" file="f0" line="1731"/>
  <Field id="_2827" name="x" type="_846" offset="96" context="_547" access="public" location="f0:1732" file="f0" line="1732"/>
  <Field id="_2828" name="y" type="_846" offset="112" context="_547" access="public" location="f0:1733" file="f0" line="1733"/>
  <Field id="_2829" name="width" type="_1343" offset="128" context="_547" access="public" location="f0:1734" file="f0" line="1734"/>
  <Field id="_2830" name="height" type="_1343" offset="144" context="_547" access="public" location="f0:1735" file="f0" line="1735"/>
  <Field id="_2831" name="border_width" type="_1343" offset="160" context="_547" access="public" location="f0:1736" file="f0" line="1736"/>
  <Field id="_2832" name="pad0" type="_5023" offset="176" context="_547" access="public" location="f0:1737" file="f0" line="1737"/>
  <Destructor id="_2833" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN24xcb_get_geometry_reply_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::~xcb_get_geometry_reply_t()" location="f0:1726" file="f0" line="1726" endline="1726" inline="1">
  </Destructor>
  <OperatorMethod id="_2834" name="=" returns="_5255" artificial="1" throw="" context="_547" access="public" mangled="_ZN24xcb_get_geometry_reply_taSERKS_" demangled="xcb_get_geometry_reply_t::operator=(xcb_get_geometry_reply_t const&amp;)" location="f0:1726" file="f0" line="1726" endline="1726" inline="1">
    <Argument type="_5256" location="f0:1726" file="f0" line="1726"/>
  </OperatorMethod>
  <Constructor id="_2835" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t(xcb_get_geometry_reply_t const&amp;)" location="f0:1726" file="f0" line="1726" endline="1726" inline="1">
    <Argument type="_5256" location="f0:1726" file="f0" line="1726"/>
  </Constructor>
  <Constructor id="_2836" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t()" location="f0:1726" file="f0" line="1726" inline="1"/>
  <Field id="_2837" name="__val" type="_5257" offset="0" context="_549" access="public" location="f13:134" file="f13" line="134"/>
  <Destructor id="_2838" name="._0" artificial="1" throw="" context="_549" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f13:134" file="f13" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_2839" name="=" returns="_5258" artificial="1" throw="" context="_549" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f13:134" file="f13" line="134" endline="134" inline="1">
    <Argument type="_5259" location="f13:134" file="f13" line="134"/>
  </OperatorMethod>
  <Constructor id="_2840" name="._0" artificial="1" throw="" context="_549" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f13:134" file="f13" line="134" endline="134" inline="1">
    <Argument type="_5259" location="f13:134" file="f13" line="134"/>
  </Constructor>
  <Constructor id="_2841" name="._0" artificial="1" throw="" context="_549" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f13:134" file="f13" line="134" inline="1"/>
  <Field id="_2842" name="__bits" type="_5260" offset="0" context="_551" access="public" location="f12:127" file="f12" line="127"/>
  <Destructor id="_2843" name="._13" artificial="1" throw="" context="_551" access="public" mangled="_ZN9cpu_set_tD1Ev *INTERNAL* " demangled="cpu_set_t::~cpu_set_t()" location="f12:128" file="f12" line="128" endline="128" inline="1">
  </Destructor>
  <OperatorMethod id="_2844" name="=" returns="_5261" artificial="1" throw="" context="_551" access="public" mangled="_ZN9cpu_set_taSERKS_" demangled="cpu_set_t::operator=(cpu_set_t const&amp;)" location="f12:128" file="f12" line="128" endline="128" inline="1">
    <Argument type="_5262" location="f12:126" file="f12" line="126"/>
  </OperatorMethod>
  <Constructor id="_2845" name="._13" artificial="1" throw="" context="_551" access="public" mangled="_ZN9cpu_set_tC1ERKS_ *INTERNAL* " demangled="cpu_set_t::cpu_set_t(cpu_set_t const&amp;)" location="f12:128" file="f12" line="128" endline="128" inline="1">
    <Argument type="_5262" location="f12:126" file="f12" line="126"/>
  </Constructor>
  <Constructor id="_2846" name="._13" artificial="1" throw="" context="_551" access="public" mangled="_ZN9cpu_set_tC1Ev *INTERNAL* " demangled="cpu_set_t::cpu_set_t()" location="f12:128" file="f12" line="128" inline="1"/>
  <Field id="_2847" name="response_type" type="_1416" offset="0" context="_558" access="public" location="f14:138" file="f14" line="138"/>
  <Field id="_2848" name="pad0" type="_1416" offset="8" context="_558" access="public" location="f14:139" file="f14" line="139"/>
  <Field id="_2849" name="sequence" type="_1343" offset="16" context="_558" access="public" location="f14:140" file="f14" line="140"/>
  <Field id="_2850" name="pad" type="_5263" offset="32" context="_558" access="public" location="f14:141" file="f14" line="141"/>
  <Field id="_2851" name="full_sequence" type="_669" offset="256" context="_558" access="public" location="f14:142" file="f14" line="142"/>
  <Destructor id="_2852" name="._28" artificial="1" throw="" context="_558" access="public" mangled="_ZN19xcb_generic_event_tD1Ev *INTERNAL* " demangled="xcb_generic_event_t::~xcb_generic_event_t()" location="f14:143" file="f14" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_2853" name="=" returns="_5264" artificial="1" throw="" context="_558" access="public" mangled="_ZN19xcb_generic_event_taSERKS_" demangled="xcb_generic_event_t::operator=(xcb_generic_event_t const&amp;)" location="f14:143" file="f14" line="143" endline="143" inline="1">
    <Argument type="_5265" location="f14:137" file="f14" line="137"/>
  </OperatorMethod>
  <Constructor id="_2854" name="._28" artificial="1" throw="" context="_558" access="public" mangled="_ZN19xcb_generic_event_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t(xcb_generic_event_t const&amp;)" location="f14:143" file="f14" line="143" endline="143" inline="1">
    <Argument type="_5265" location="f14:137" file="f14" line="137"/>
  </Constructor>
  <Constructor id="_2855" name="._28" artificial="1" throw="" context="_558" access="public" mangled="_ZN19xcb_generic_event_tC1Ev *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t()" location="f14:143" file="f14" line="143" inline="1"/>
  <PointerType id="_2856" type="_436" size="64" align="64"/>
  <Field id="_2857" name="major_opcode" type="_1416" offset="0" context="_563" access="public" location="f0:3399" file="f0" line="3399"/>
  <Field id="_2858" name="pad0" type="_1416" offset="8" context="_563" access="public" location="f0:3400" file="f0" line="3400"/>
  <Field id="_2859" name="length" type="_1343" offset="16" context="_563" access="public" location="f0:3401" file="f0" line="3401"/>
  <Field id="_2860" name="drawable" type="_840" offset="32" context="_563" access="public" location="f0:3402" file="f0" line="3402"/>
  <Field id="_2861" name="gc" type="_1719" offset="64" context="_563" access="public" location="f0:3403" file="f0" line="3403"/>
  <Destructor id="_2862" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN22xcb_poly_arc_request_tD1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::~xcb_poly_arc_request_t()" location="f0:3398" file="f0" line="3398" endline="3398" inline="1">
  </Destructor>
  <OperatorMethod id="_2863" name="=" returns="_5266" artificial="1" throw="" context="_563" access="public" mangled="_ZN22xcb_poly_arc_request_taSERKS_" demangled="xcb_poly_arc_request_t::operator=(xcb_poly_arc_request_t const&amp;)" location="f0:3398" file="f0" line="3398" endline="3398" inline="1">
    <Argument type="_5267" location="f0:3398" file="f0" line="3398"/>
  </OperatorMethod>
  <Constructor id="_2864" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN22xcb_poly_arc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t(xcb_poly_arc_request_t const&amp;)" location="f0:3398" file="f0" line="3398" endline="3398" inline="1">
    <Argument type="_5267" location="f0:3398" file="f0" line="3398"/>
  </Constructor>
  <Constructor id="_2865" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN22xcb_poly_arc_request_tC1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t()" location="f0:3398" file="f0" line="3398" inline="1"/>
  <PointerType id="_2866" type="_582" size="64" align="64"/>
  <PointerType id="_2867" type="_416c" size="64" align="64"/>
  <PointerType id="_2868" type="_1667" size="64" align="64"/>
  <Field id="_2869" name="data" type="_5269" offset="0" context="_572" access="public" location="f0:402" file="f0" line="402"/>
  <Field id="_2870" name="rem" type="_172" offset="64" context="_572" access="public" location="f0:403" file="f0" line="403"/>
  <Field id="_2871" name="index" type="_172" offset="96" context="_572" access="public" location="f0:404" file="f0" line="404"/>
  <Destructor id="_2872" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_572" access="public" mangled="_ZN28xcb_setup_request_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::~xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" endline="401" inline="1">
  </Destructor>
  <OperatorMethod id="_2873" name="=" returns="_5270" artificial="1" throw="" context="_572" access="public" mangled="_ZN28xcb_setup_request_iterator_taSERKS_" demangled="xcb_setup_request_iterator_t::operator=(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5271" location="f0:401" file="f0" line="401"/>
  </OperatorMethod>
  <Constructor id="_2874" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_572" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5271" location="f0:401" file="f0" line="401"/>
  </Constructor>
  <Constructor id="_2875" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_572" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" inline="1"/>
  <PointerType id="_2876" type="_551" size="64" align="64"/>
  <Field id="_2877" name="x1" type="_846" offset="0" context="_577" access="public" location="f0:3349" file="f0" line="3349"/>
  <Field id="_2878" name="y1" type="_846" offset="16" context="_577" access="public" location="f0:3350" file="f0" line="3350"/>
  <Field id="_2879" name="x2" type="_846" offset="32" context="_577" access="public" location="f0:3351" file="f0" line="3351"/>
  <Field id="_2880" name="y2" type="_846" offset="48" context="_577" access="public" location="f0:3352" file="f0" line="3352"/>
  <Destructor id="_2881" name="xcb_segment_t" artificial="1" throw="" context="_577" access="public" mangled="_ZN13xcb_segment_tD1Ev *INTERNAL* " demangled="xcb_segment_t::~xcb_segment_t()" location="f0:3348" file="f0" line="3348" endline="3348" inline="1">
  </Destructor>
  <OperatorMethod id="_2882" name="=" returns="_5272" artificial="1" throw="" context="_577" access="public" mangled="_ZN13xcb_segment_taSERKS_" demangled="xcb_segment_t::operator=(xcb_segment_t const&amp;)" location="f0:3348" file="f0" line="3348" endline="3348" inline="1">
    <Argument type="_5273" location="f0:3348" file="f0" line="3348"/>
  </OperatorMethod>
  <Constructor id="_2883" name="xcb_segment_t" artificial="1" throw="" context="_577" access="public" mangled="_ZN13xcb_segment_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t(xcb_segment_t const&amp;)" location="f0:3348" file="f0" line="3348" endline="3348" inline="1">
    <Argument type="_5273" location="f0:3348" file="f0" line="3348"/>
  </Constructor>
  <Constructor id="_2884" name="xcb_segment_t" artificial="1" throw="" context="_577" access="public" mangled="_ZN13xcb_segment_tC1Ev *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t()" location="f0:3348" file="f0" line="3348" inline="1"/>
  <Field id="_2885" name="depth" type="_1416" offset="0" context="_581" access="public" location="f0:253" file="f0" line="253"/>
  <Field id="_2886" name="bits_per_pixel" type="_1416" offset="8" context="_581" access="public" location="f0:254" file="f0" line="254"/>
  <Field id="_2887" name="scanline_pad" type="_1416" offset="16" context="_581" access="public" location="f0:255" file="f0" line="255"/>
  <Field id="_2888" name="pad0" type="_5248" offset="24" context="_581" access="public" location="f0:256" file="f0" line="256"/>
  <Destructor id="_2889" name="xcb_format_t" artificial="1" throw="" context="_581" access="public" mangled="_ZN12xcb_format_tD1Ev *INTERNAL* " demangled="xcb_format_t::~xcb_format_t()" location="f0:252" file="f0" line="252" endline="252" inline="1">
  </Destructor>
  <OperatorMethod id="_2890" name="=" returns="_5274" artificial="1" throw="" context="_581" access="public" mangled="_ZN12xcb_format_taSERKS_" demangled="xcb_format_t::operator=(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5275" location="f0:252" file="f0" line="252"/>
  </OperatorMethod>
  <Constructor id="_2891" name="xcb_format_t" artificial="1" throw="" context="_581" access="public" mangled="_ZN12xcb_format_tC1ERKS_ *INTERNAL* " demangled="xcb_format_t::xcb_format_t(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5275" location="f0:252" file="f0" line="252"/>
  </Constructor>
  <Constructor id="_2892" name="xcb_format_t" artificial="1" throw="" context="_581" access="public" mangled="_ZN12xcb_format_tC1Ev *INTERNAL* " demangled="xcb_format_t::xcb_format_t()" location="f0:252" file="f0" line="252" inline="1"/>
  <PointerType id="_2893" type="_371c" size="64" align="64"/>
  <Field id="_2894" name="major_opcode" type="_1416" offset="0" context="_589" access="public" location="f0:3385" file="f0" line="3385"/>
  <Field id="_2895" name="pad0" type="_1416" offset="8" context="_589" access="public" location="f0:3386" file="f0" line="3386"/>
  <Field id="_2896" name="length" type="_1343" offset="16" context="_589" access="public" location="f0:3387" file="f0" line="3387"/>
  <Field id="_2897" name="drawable" type="_840" offset="32" context="_589" access="public" location="f0:3388" file="f0" line="3388"/>
  <Field id="_2898" name="gc" type="_1719" offset="64" context="_589" access="public" location="f0:3389" file="f0" line="3389"/>
  <Destructor id="_2899" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN28xcb_poly_rectangle_request_tD1Ev *INTERNAL* " demangled="xcb_poly_rectangle_request_t::~xcb_poly_rectangle_request_t()" location="f0:3384" file="f0" line="3384" endline="3384" inline="1">
  </Destructor>
  <OperatorMethod id="_2900" name="=" returns="_5277" artificial="1" throw="" context="_589" access="public" mangled="_ZN28xcb_poly_rectangle_request_taSERKS_" demangled="xcb_poly_rectangle_request_t::operator=(xcb_poly_rectangle_request_t const&amp;)" location="f0:3384" file="f0" line="3384" endline="3384" inline="1">
    <Argument type="_5278" location="f0:3384" file="f0" line="3384"/>
  </OperatorMethod>
  <Constructor id="_2901" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN28xcb_poly_rectangle_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_rectangle_request_t::xcb_poly_rectangle_request_t(xcb_poly_rectangle_request_t const&amp;)" location="f0:3384" file="f0" line="3384" endline="3384" inline="1">
    <Argument type="_5278" location="f0:3384" file="f0" line="3384"/>
  </Constructor>
  <Constructor id="_2902" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN28xcb_poly_rectangle_request_tC1Ev *INTERNAL* " demangled="xcb_poly_rectangle_request_t::xcb_poly_rectangle_request_t()" location="f0:3384" file="f0" line="3384" inline="1"/>
  <PointerType id="_2903" type="_410" size="64" align="64"/>
  <Field id="_2904" name="major_opcode" type="_1416" offset="0" context="_600" access="public" location="f0:1633" file="f0" line="1633"/>
  <Field id="_2905" name="pad0" type="_1416" offset="8" context="_600" access="public" location="f0:1634" file="f0" line="1634"/>
  <Field id="_2906" name="length" type="_1343" offset="16" context="_600" access="public" location="f0:1635" file="f0" line="1635"/>
  <Field id="_2907" name="window" type="_649" offset="32" context="_600" access="public" location="f0:1636" file="f0" line="1636"/>
  <Destructor id="_2908" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN26xcb_unmap_window_request_tD1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::~xcb_unmap_window_request_t()" location="f0:1632" file="f0" line="1632" endline="1632" inline="1">
  </Destructor>
  <OperatorMethod id="_2909" name="=" returns="_5279" artificial="1" throw="" context="_600" access="public" mangled="_ZN26xcb_unmap_window_request_taSERKS_" demangled="xcb_unmap_window_request_t::operator=(xcb_unmap_window_request_t const&amp;)" location="f0:1632" file="f0" line="1632" endline="1632" inline="1">
    <Argument type="_5280" location="f0:1632" file="f0" line="1632"/>
  </OperatorMethod>
  <Constructor id="_2910" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN26xcb_unmap_window_request_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t(xcb_unmap_window_request_t const&amp;)" location="f0:1632" file="f0" line="1632" endline="1632" inline="1">
    <Argument type="_5280" location="f0:1632" file="f0" line="1632"/>
  </Constructor>
  <Constructor id="_2911" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN26xcb_unmap_window_request_tC1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t()" location="f0:1632" file="f0" line="1632" inline="1"/>
  <PointerType id="_2912" type="_1088" size="64" align="64"/>
  <PointerType id="_2913" type="_1257c" size="64" align="64"/>
  <Field id="_2914" name="response_type" type="_1416" offset="0" context="_611" access="public" location="f0:4186" file="f0" line="4186"/>
  <Field id="_2915" name="names_len" type="_1416" offset="8" context="_611" access="public" location="f0:4187" file="f0" line="4187"/>
  <Field id="_2916" name="sequence" type="_1343" offset="16" context="_611" access="public" location="f0:4188" file="f0" line="4188"/>
  <Field id="_2917" name="length" type="_669" offset="32" context="_611" access="public" location="f0:4189" file="f0" line="4189"/>
  <Field id="_2918" name="pad0" type="_5282" offset="64" context="_611" access="public" location="f0:4190" file="f0" line="4190"/>
  <Destructor id="_2919" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_611" access="public" mangled="_ZN27xcb_list_extensions_reply_tD1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::~xcb_list_extensions_reply_t()" location="f0:4185" file="f0" line="4185" endline="4185" inline="1">
  </Destructor>
  <OperatorMethod id="_2920" name="=" returns="_5283" artificial="1" throw="" context="_611" access="public" mangled="_ZN27xcb_list_extensions_reply_taSERKS_" demangled="xcb_list_extensions_reply_t::operator=(xcb_list_extensions_reply_t const&amp;)" location="f0:4185" file="f0" line="4185" endline="4185" inline="1">
    <Argument type="_5284" location="f0:4185" file="f0" line="4185"/>
  </OperatorMethod>
  <Constructor id="_2921" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_611" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t(xcb_list_extensions_reply_t const&amp;)" location="f0:4185" file="f0" line="4185" endline="4185" inline="1">
    <Argument type="_5284" location="f0:4185" file="f0" line="4185"/>
  </Constructor>
  <Constructor id="_2922" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_611" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t()" location="f0:4185" file="f0" line="4185" inline="1"/>
  <Field id="_2923" name="__sched_priority" type="_172" offset="0" context="_615" access="public" location="f12:74" file="f12" line="74"/>
  <Destructor id="_2924" name="sched_param" artificial="1" throw="" context="_615" access="public" mangled="_ZN11sched_paramD1Ev *INTERNAL* " demangled="sched_param::~sched_param()" location="f12:73" file="f12" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_2925" name="=" returns="_5285" artificial="1" throw="" context="_615" access="public" mangled="_ZN11sched_paramaSERKS_" demangled="sched_param::operator=(sched_param const&amp;)" location="f12:73" file="f12" line="73" endline="73" inline="1">
    <Argument type="_5286" location="f12:73" file="f12" line="73"/>
  </OperatorMethod>
  <Constructor id="_2926" name="sched_param" artificial="1" throw="" context="_615" access="public" mangled="_ZN11sched_paramC1ERKS_ *INTERNAL* " demangled="sched_param::sched_param(sched_param const&amp;)" location="f12:73" file="f12" line="73" endline="73" inline="1">
    <Argument type="_5286" location="f12:73" file="f12" line="73"/>
  </Constructor>
  <Constructor id="_2927" name="sched_param" artificial="1" throw="" context="_615" access="public" mangled="_ZN11sched_paramC1Ev *INTERNAL* " demangled="sched_param::sched_param()" location="f12:73" file="f12" line="73" inline="1"/>
  <Field id="_2928" name="status" type="_1416" offset="0" context="_621" access="public" location="f0:454" file="f0" line="454"/>
  <Field id="_2929" name="pad0" type="_1416" offset="8" context="_621" access="public" location="f0:455" file="f0" line="455"/>
  <Field id="_2930" name="protocol_major_version" type="_1343" offset="16" context="_621" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_2931" name="protocol_minor_version" type="_1343" offset="32" context="_621" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_2932" name="length" type="_1343" offset="48" context="_621" access="public" location="f0:458" file="f0" line="458"/>
  <Field id="_2933" name="release_number" type="_669" offset="64" context="_621" access="public" location="f0:459" file="f0" line="459"/>
  <Field id="_2934" name="resource_id_base" type="_669" offset="96" context="_621" access="public" location="f0:460" file="f0" line="460"/>
  <Field id="_2935" name="resource_id_mask" type="_669" offset="128" context="_621" access="public" location="f0:461" file="f0" line="461"/>
  <Field id="_2936" name="motion_buffer_size" type="_669" offset="160" context="_621" access="public" location="f0:462" file="f0" line="462"/>
  <Field id="_2937" name="vendor_len" type="_1343" offset="192" context="_621" access="public" location="f0:463" file="f0" line="463"/>
  <Field id="_2938" name="maximum_request_length" type="_1343" offset="208" context="_621" access="public" location="f0:464" file="f0" line="464"/>
  <Field id="_2939" name="roots_len" type="_1416" offset="224" context="_621" access="public" location="f0:465" file="f0" line="465"/>
  <Field id="_2940" name="pixmap_formats_len" type="_1416" offset="232" context="_621" access="public" location="f0:466" file="f0" line="466"/>
  <Field id="_2941" name="image_byte_order" type="_1416" offset="240" context="_621" access="public" location="f0:467" file="f0" line="467"/>
  <Field id="_2942" name="bitmap_format_bit_order" type="_1416" offset="248" context="_621" access="public" location="f0:468" file="f0" line="468"/>
  <Field id="_2943" name="bitmap_format_scanline_unit" type="_1416" offset="256" context="_621" access="public" location="f0:469" file="f0" line="469"/>
  <Field id="_2944" name="bitmap_format_scanline_pad" type="_1416" offset="264" context="_621" access="public" location="f0:470" file="f0" line="470"/>
  <Field id="_2945" name="min_keycode" type="_867" offset="272" context="_621" access="public" location="f0:471" file="f0" line="471"/>
  <Field id="_2946" name="max_keycode" type="_867" offset="280" context="_621" access="public" location="f0:472" file="f0" line="472"/>
  <Field id="_2947" name="pad1" type="_5135" offset="288" context="_621" access="public" location="f0:473" file="f0" line="473"/>
  <Destructor id="_2948" name="xcb_setup_t" artificial="1" throw="" context="_621" access="public" mangled="_ZN11xcb_setup_tD1Ev *INTERNAL* " demangled="xcb_setup_t::~xcb_setup_t()" location="f0:453" file="f0" line="453" endline="453" inline="1">
  </Destructor>
  <OperatorMethod id="_2949" name="=" returns="_5287" artificial="1" throw="" context="_621" access="public" mangled="_ZN11xcb_setup_taSERKS_" demangled="xcb_setup_t::operator=(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5288" location="f0:453" file="f0" line="453"/>
  </OperatorMethod>
  <Constructor id="_2950" name="xcb_setup_t" artificial="1" throw="" context="_621" access="public" mangled="_ZN11xcb_setup_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5288" location="f0:453" file="f0" line="453"/>
  </Constructor>
  <Constructor id="_2951" name="xcb_setup_t" artificial="1" throw="" context="_621" access="public" mangled="_ZN11xcb_setup_tC1Ev *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t()" location="f0:453" file="f0" line="453" inline="1"/>
  <PointerType id="_2952" type="_1648" size="64" align="64"/>
  <Field id="_2953" name="sequence" type="_90" offset="0" context="_624" access="public" location="f0:3733" file="f0" line="3733"/>
  <Destructor id="_2954" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_624" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tD1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::~xcb_alloc_named_color_cookie_t()" location="f0:3732" file="f0" line="3732" endline="3732" inline="1">
  </Destructor>
  <OperatorMethod id="_2955" name="=" returns="_5289" artificial="1" throw="" context="_624" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_taSERKS_" demangled="xcb_alloc_named_color_cookie_t::operator=(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3732" file="f0" line="3732" endline="3732" inline="1">
    <Argument type="_5290" location="f0:3732" file="f0" line="3732"/>
  </OperatorMethod>
  <Constructor id="_2956" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_624" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3732" file="f0" line="3732" endline="3732" inline="1">
    <Argument type="_5290" location="f0:3732" file="f0" line="3732"/>
  </Constructor>
  <Constructor id="_2957" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_624" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t()" location="f0:3732" file="f0" line="3732" inline="1"/>
  <PointerType id="_2958" type="_1863" size="64" align="64"/>
  <PointerType id="_2959" type="_1865" size="64" align="64"/>
  <PointerType id="_2960" type="_1604c" size="64" align="64"/>
  <Field id="_2961" name="data" type="_5292" offset="0" context="_638" access="public" location="f0:154" file="f0" line="154"/>
  <Field id="_2962" name="rem" type="_172" offset="64" context="_638" access="public" location="f0:155" file="f0" line="155"/>
  <Field id="_2963" name="index" type="_172" offset="96" context="_638" access="public" location="f0:156" file="f0" line="156"/>
  <Destructor id="_2964" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_638" access="public" mangled="_ZN24xcb_timestamp_iterator_tD1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::~xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" endline="153" inline="1">
  </Destructor>
  <OperatorMethod id="_2965" name="=" returns="_5293" artificial="1" throw="" context="_638" access="public" mangled="_ZN24xcb_timestamp_iterator_taSERKS_" demangled="xcb_timestamp_iterator_t::operator=(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5294" location="f0:153" file="f0" line="153"/>
  </OperatorMethod>
  <Constructor id="_2966" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_638" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5294" location="f0:153" file="f0" line="153"/>
  </Constructor>
  <Constructor id="_2967" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_638" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" inline="1"/>
  <Field id="_2968" name="response_type" type="_1416" offset="0" context="_641" access="public" location="f0:694" file="f0" line="694"/>
  <Field id="_2969" name="pad0" type="_1416" offset="8" context="_641" access="public" location="f0:695" file="f0" line="695"/>
  <Field id="_2970" name="sequence" type="_1343" offset="16" context="_641" access="public" location="f0:696" file="f0" line="696"/>
  <Field id="_2971" name="window" type="_649" offset="32" context="_641" access="public" location="f0:697" file="f0" line="697"/>
  <Field id="_2972" name="x" type="_1343" offset="64" context="_641" access="public" location="f0:698" file="f0" line="698"/>
  <Field id="_2973" name="y" type="_1343" offset="80" context="_641" access="public" location="f0:699" file="f0" line="699"/>
  <Field id="_2974" name="width" type="_1343" offset="96" context="_641" access="public" location="f0:700" file="f0" line="700"/>
  <Field id="_2975" name="height" type="_1343" offset="112" context="_641" access="public" location="f0:701" file="f0" line="701"/>
  <Field id="_2976" name="count" type="_1343" offset="128" context="_641" access="public" location="f0:702" file="f0" line="702"/>
  <Field id="_2977" name="pad1" type="_5023" offset="144" context="_641" access="public" location="f0:703" file="f0" line="703"/>
  <Destructor id="_2978" name="xcb_expose_event_t" artificial="1" throw="" context="_641" access="public" mangled="_ZN18xcb_expose_event_tD1Ev *INTERNAL* " demangled="xcb_expose_event_t::~xcb_expose_event_t()" location="f0:693" file="f0" line="693" endline="693" inline="1">
  </Destructor>
  <OperatorMethod id="_2979" name="=" returns="_5295" artificial="1" throw="" context="_641" access="public" mangled="_ZN18xcb_expose_event_taSERKS_" demangled="xcb_expose_event_t::operator=(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5296" location="f0:693" file="f0" line="693"/>
  </OperatorMethod>
  <Constructor id="_2980" name="xcb_expose_event_t" artificial="1" throw="" context="_641" access="public" mangled="_ZN18xcb_expose_event_tC1ERKS_ *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5296" location="f0:693" file="f0" line="693"/>
  </Constructor>
  <Constructor id="_2981" name="xcb_expose_event_t" artificial="1" throw="" context="_641" access="public" mangled="_ZN18xcb_expose_event_tC1Ev *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t()" location="f0:693" file="f0" line="693" inline="1"/>
  <Field id="_2982" name="major_opcode" type="_1416" offset="0" context="_643" access="public" location="f0:2923" file="f0" line="2923"/>
  <Field id="_2983" name="depth" type="_1416" offset="8" context="_643" access="public" location="f0:2924" file="f0" line="2924"/>
  <Field id="_2984" name="length" type="_1343" offset="16" context="_643" access="public" location="f0:2925" file="f0" line="2925"/>
  <Field id="_2985" name="pid" type="_1688" offset="32" context="_643" access="public" location="f0:2926" file="f0" line="2926"/>
  <Field id="_2986" name="drawable" type="_840" offset="64" context="_643" access="public" location="f0:2927" file="f0" line="2927"/>
  <Field id="_2987" name="width" type="_1343" offset="96" context="_643" access="public" location="f0:2928" file="f0" line="2928"/>
  <Field id="_2988" name="height" type="_1343" offset="112" context="_643" access="public" location="f0:2929" file="f0" line="2929"/>
  <Destructor id="_2989" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_643" access="public" mangled="_ZN27xcb_create_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::~xcb_create_pixmap_request_t()" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
  </Destructor>
  <OperatorMethod id="_2990" name="=" returns="_5297" artificial="1" throw="" context="_643" access="public" mangled="_ZN27xcb_create_pixmap_request_taSERKS_" demangled="xcb_create_pixmap_request_t::operator=(xcb_create_pixmap_request_t const&amp;)" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
    <Argument type="_5298" location="f0:2922" file="f0" line="2922"/>
  </OperatorMethod>
  <Constructor id="_2991" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_643" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t(xcb_create_pixmap_request_t const&amp;)" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
    <Argument type="_5298" location="f0:2922" file="f0" line="2922"/>
  </Constructor>
  <Constructor id="_2992" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_643" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t()" location="f0:2922" file="f0" line="2922" inline="1"/>
  <Field id="_2993" name="major_opcode" type="_1416" offset="0" context="_645" access="public" location="f0:3704" file="f0" line="3704"/>
  <Field id="_2994" name="pad0" type="_1416" offset="8" context="_645" access="public" location="f0:3705" file="f0" line="3705"/>
  <Field id="_2995" name="length" type="_1343" offset="16" context="_645" access="public" location="f0:3706" file="f0" line="3706"/>
  <Field id="_2996" name="cmap" type="_690" offset="32" context="_645" access="public" location="f0:3707" file="f0" line="3707"/>
  <Field id="_2997" name="red" type="_1343" offset="64" context="_645" access="public" location="f0:3708" file="f0" line="3708"/>
  <Field id="_2998" name="green" type="_1343" offset="80" context="_645" access="public" location="f0:3709" file="f0" line="3709"/>
  <Field id="_2999" name="blue" type="_1343" offset="96" context="_645" access="public" location="f0:3710" file="f0" line="3710"/>
  <Field id="_3000" name="pad1" type="_5023" offset="112" context="_645" access="public" location="f0:3711" file="f0" line="3711"/>
  <Destructor id="_3001" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_645" access="public" mangled="_ZN25xcb_alloc_color_request_tD1Ev *INTERNAL* " demangled="xcb_alloc_color_request_t::~xcb_alloc_color_request_t()" location="f0:3703" file="f0" line="3703" endline="3703" inline="1">
  </Destructor>
  <OperatorMethod id="_3002" name="=" returns="_5299" artificial="1" throw="" context="_645" access="public" mangled="_ZN25xcb_alloc_color_request_taSERKS_" demangled="xcb_alloc_color_request_t::operator=(xcb_alloc_color_request_t const&amp;)" location="f0:3703" file="f0" line="3703" endline="3703" inline="1">
    <Argument type="_5300" location="f0:3703" file="f0" line="3703"/>
  </OperatorMethod>
  <Constructor id="_3003" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_645" access="public" mangled="_ZN25xcb_alloc_color_request_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_color_request_t::xcb_alloc_color_request_t(xcb_alloc_color_request_t const&amp;)" location="f0:3703" file="f0" line="3703" endline="3703" inline="1">
    <Argument type="_5300" location="f0:3703" file="f0" line="3703"/>
  </Constructor>
  <Constructor id="_3004" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_645" access="public" mangled="_ZN25xcb_alloc_color_request_tC1Ev *INTERNAL* " demangled="xcb_alloc_color_request_t::xcb_alloc_color_request_t()" location="f0:3703" file="f0" line="3703" inline="1"/>
  <Field id="_3005" name="response_type" type="_1416" offset="0" context="_647" access="public" location="f0:2763" file="f0" line="2763"/>
  <Field id="_3006" name="draw_direction" type="_1416" offset="8" context="_647" access="public" location="f0:2764" file="f0" line="2764"/>
  <Field id="_3007" name="sequence" type="_1343" offset="16" context="_647" access="public" location="f0:2765" file="f0" line="2765"/>
  <Field id="_3008" name="length" type="_669" offset="32" context="_647" access="public" location="f0:2766" file="f0" line="2766"/>
  <Field id="_3009" name="font_ascent" type="_846" offset="64" context="_647" access="public" location="f0:2767" file="f0" line="2767"/>
  <Field id="_3010" name="font_descent" type="_846" offset="80" context="_647" access="public" location="f0:2768" file="f0" line="2768"/>
  <Field id="_3011" name="overall_ascent" type="_846" offset="96" context="_647" access="public" location="f0:2769" file="f0" line="2769"/>
  <Field id="_3012" name="overall_descent" type="_846" offset="112" context="_647" access="public" location="f0:2770" file="f0" line="2770"/>
  <Field id="_3013" name="overall_width" type="_1313" offset="128" context="_647" access="public" location="f0:2771" file="f0" line="2771"/>
  <Field id="_3014" name="overall_left" type="_1313" offset="160" context="_647" access="public" location="f0:2772" file="f0" line="2772"/>
  <Field id="_3015" name="overall_right" type="_1313" offset="192" context="_647" access="public" location="f0:2773" file="f0" line="2773"/>
  <Destructor id="_3016" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_647" access="public" mangled="_ZN30xcb_query_text_extents_reply_tD1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::~xcb_query_text_extents_reply_t()" location="f0:2762" file="f0" line="2762" endline="2762" inline="1">
  </Destructor>
  <OperatorMethod id="_3017" name="=" returns="_5301" artificial="1" throw="" context="_647" access="public" mangled="_ZN30xcb_query_text_extents_reply_taSERKS_" demangled="xcb_query_text_extents_reply_t::operator=(xcb_query_text_extents_reply_t const&amp;)" location="f0:2762" file="f0" line="2762" endline="2762" inline="1">
    <Argument type="_5302" location="f0:2762" file="f0" line="2762"/>
  </OperatorMethod>
  <Constructor id="_3018" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_647" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t(xcb_query_text_extents_reply_t const&amp;)" location="f0:2762" file="f0" line="2762" endline="2762" inline="1">
    <Argument type="_5302" location="f0:2762" file="f0" line="2762"/>
  </Constructor>
  <Constructor id="_3019" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_647" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t()" location="f0:2762" file="f0" line="2762" inline="1"/>
  <Field id="_3020" name="major_opcode" type="_1416" offset="0" context="_651" access="public" location="f0:2518" file="f0" line="2518"/>
  <Field id="_3021" name="pad0" type="_1416" offset="8" context="_651" access="public" location="f0:2519" file="f0" line="2519"/>
  <Field id="_3022" name="length" type="_1343" offset="16" context="_651" access="public" location="f0:2520" file="f0" line="2520"/>
  <Field id="_3023" name="src_window" type="_649" offset="32" context="_651" access="public" location="f0:2521" file="f0" line="2521"/>
  <Field id="_3024" name="dst_window" type="_649" offset="64" context="_651" access="public" location="f0:2522" file="f0" line="2522"/>
  <Field id="_3025" name="src_x" type="_846" offset="96" context="_651" access="public" location="f0:2523" file="f0" line="2523"/>
  <Field id="_3026" name="src_y" type="_846" offset="112" context="_651" access="public" location="f0:2524" file="f0" line="2524"/>
  <Field id="_3027" name="src_width" type="_1343" offset="128" context="_651" access="public" location="f0:2525" file="f0" line="2525"/>
  <Field id="_3028" name="src_height" type="_1343" offset="144" context="_651" access="public" location="f0:2526" file="f0" line="2526"/>
  <Field id="_3029" name="dst_x" type="_846" offset="160" context="_651" access="public" location="f0:2527" file="f0" line="2527"/>
  <Field id="_3030" name="dst_y" type="_846" offset="176" context="_651" access="public" location="f0:2528" file="f0" line="2528"/>
  <Destructor id="_3031" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN26xcb_warp_pointer_request_tD1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::~xcb_warp_pointer_request_t()" location="f0:2517" file="f0" line="2517" endline="2517" inline="1">
  </Destructor>
  <OperatorMethod id="_3032" name="=" returns="_5303" artificial="1" throw="" context="_651" access="public" mangled="_ZN26xcb_warp_pointer_request_taSERKS_" demangled="xcb_warp_pointer_request_t::operator=(xcb_warp_pointer_request_t const&amp;)" location="f0:2517" file="f0" line="2517" endline="2517" inline="1">
    <Argument type="_5304" location="f0:2517" file="f0" line="2517"/>
  </OperatorMethod>
  <Constructor id="_3033" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1ERKS_ *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t(xcb_warp_pointer_request_t const&amp;)" location="f0:2517" file="f0" line="2517" endline="2517" inline="1">
    <Argument type="_5304" location="f0:2517" file="f0" line="2517"/>
  </Constructor>
  <Constructor id="_3034" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t()" location="f0:2517" file="f0" line="2517" inline="1"/>
  <Field id="_3035" name="namelen" type="_172" offset="0" context="_653" access="public" location="f14:217" file="f14" line="217"/>
  <Field id="_3036" name="name" type="_1076" offset="64" context="_653" access="public" location="f14:218" file="f14" line="218"/>
  <Field id="_3037" name="datalen" type="_172" offset="128" context="_653" access="public" location="f14:219" file="f14" line="219"/>
  <Field id="_3038" name="data" type="_1076" offset="192" context="_653" access="public" location="f14:220" file="f14" line="220"/>
  <Destructor id="_3039" name="xcb_auth_info_t" artificial="1" throw="" context="_653" access="public" mangled="_ZN15xcb_auth_info_tD1Ev *INTERNAL* " demangled="xcb_auth_info_t::~xcb_auth_info_t()" location="f14:216" file="f14" line="216" endline="216" inline="1">
  </Destructor>
  <OperatorMethod id="_3040" name="=" returns="_5305" artificial="1" throw="" context="_653" access="public" mangled="_ZN15xcb_auth_info_taSERKS_" demangled="xcb_auth_info_t::operator=(xcb_auth_info_t const&amp;)" location="f14:216" file="f14" line="216" endline="216" inline="1">
    <Argument type="_5306" location="f14:216" file="f14" line="216"/>
  </OperatorMethod>
  <Constructor id="_3041" name="xcb_auth_info_t" artificial="1" throw="" context="_653" access="public" mangled="_ZN15xcb_auth_info_tC1ERKS_ *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t(xcb_auth_info_t const&amp;)" location="f14:216" file="f14" line="216" endline="216" inline="1">
    <Argument type="_5306" location="f14:216" file="f14" line="216"/>
  </Constructor>
  <Constructor id="_3042" name="xcb_auth_info_t" artificial="1" throw="" context="_653" access="public" mangled="_ZN15xcb_auth_info_tC1Ev *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t()" location="f14:216" file="f14" line="216" inline="1"/>
  <Field id="_3043" name="response_type" type="_1416" offset="0" context="_656" access="public" location="f0:1830" file="f0" line="1830"/>
  <Field id="_3044" name="pad0" type="_1416" offset="8" context="_656" access="public" location="f0:1831" file="f0" line="1831"/>
  <Field id="_3045" name="sequence" type="_1343" offset="16" context="_656" access="public" location="f0:1832" file="f0" line="1832"/>
  <Field id="_3046" name="length" type="_669" offset="32" context="_656" access="public" location="f0:1833" file="f0" line="1833"/>
  <Field id="_3047" name="name_len" type="_1343" offset="64" context="_656" access="public" location="f0:1834" file="f0" line="1834"/>
  <Field id="_3048" name="pad1" type="_5040" offset="80" context="_656" access="public" location="f0:1835" file="f0" line="1835"/>
  <Destructor id="_3049" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_656" access="public" mangled="_ZN25xcb_get_atom_name_reply_tD1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::~xcb_get_atom_name_reply_t()" location="f0:1829" file="f0" line="1829" endline="1829" inline="1">
  </Destructor>
  <OperatorMethod id="_3050" name="=" returns="_5307" artificial="1" throw="" context="_656" access="public" mangled="_ZN25xcb_get_atom_name_reply_taSERKS_" demangled="xcb_get_atom_name_reply_t::operator=(xcb_get_atom_name_reply_t const&amp;)" location="f0:1829" file="f0" line="1829" endline="1829" inline="1">
    <Argument type="_5308" location="f0:1829" file="f0" line="1829"/>
  </OperatorMethod>
  <Constructor id="_3051" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_656" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t(xcb_get_atom_name_reply_t const&amp;)" location="f0:1829" file="f0" line="1829" endline="1829" inline="1">
    <Argument type="_5308" location="f0:1829" file="f0" line="1829"/>
  </Constructor>
  <Constructor id="_3052" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_656" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t()" location="f0:1829" file="f0" line="1829" inline="1"/>
  <Field id="_3053" name="pixel" type="_669" offset="0" context="_658" access="public" location="f0:3867" file="f0" line="3867"/>
  <Field id="_3054" name="red" type="_1343" offset="32" context="_658" access="public" location="f0:3868" file="f0" line="3868"/>
  <Field id="_3055" name="green" type="_1343" offset="48" context="_658" access="public" location="f0:3869" file="f0" line="3869"/>
  <Field id="_3056" name="blue" type="_1343" offset="64" context="_658" access="public" location="f0:3870" file="f0" line="3870"/>
  <Field id="_3057" name="flags" type="_1416" offset="80" context="_658" access="public" location="f0:3871" file="f0" line="3871"/>
  <Field id="_3058" name="pad0" type="_1416" offset="88" context="_658" access="public" location="f0:3872" file="f0" line="3872"/>
  <Destructor id="_3059" name="xcb_coloritem_t" artificial="1" throw="" context="_658" access="public" mangled="_ZN15xcb_coloritem_tD1Ev *INTERNAL* " demangled="xcb_coloritem_t::~xcb_coloritem_t()" location="f0:3866" file="f0" line="3866" endline="3866" inline="1">
  </Destructor>
  <OperatorMethod id="_3060" name="=" returns="_5309" artificial="1" throw="" context="_658" access="public" mangled="_ZN15xcb_coloritem_taSERKS_" demangled="xcb_coloritem_t::operator=(xcb_coloritem_t const&amp;)" location="f0:3866" file="f0" line="3866" endline="3866" inline="1">
    <Argument type="_5310" location="f0:3866" file="f0" line="3866"/>
  </OperatorMethod>
  <Constructor id="_3061" name="xcb_coloritem_t" artificial="1" throw="" context="_658" access="public" mangled="_ZN15xcb_coloritem_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t(xcb_coloritem_t const&amp;)" location="f0:3866" file="f0" line="3866" endline="3866" inline="1">
    <Argument type="_5310" location="f0:3866" file="f0" line="3866"/>
  </Constructor>
  <Constructor id="_3062" name="xcb_coloritem_t" artificial="1" throw="" context="_658" access="public" mangled="_ZN15xcb_coloritem_tC1Ev *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t()" location="f0:3866" file="f0" line="3866" inline="1"/>
  <Field id="_3063" name="major_opcode" type="_1416" offset="0" context="_663" access="public" location="f0:3891" file="f0" line="3891"/>
  <Field id="_3064" name="pad0" type="_1416" offset="8" context="_663" access="public" location="f0:3892" file="f0" line="3892"/>
  <Field id="_3065" name="length" type="_1343" offset="16" context="_663" access="public" location="f0:3893" file="f0" line="3893"/>
  <Field id="_3066" name="cmap" type="_690" offset="32" context="_663" access="public" location="f0:3894" file="f0" line="3894"/>
  <Destructor id="_3067" name="xcb_store_colors_request_t" artificial="1" throw="" context="_663" access="public" mangled="_ZN26xcb_store_colors_request_tD1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::~xcb_store_colors_request_t()" location="f0:3890" file="f0" line="3890" endline="3890" inline="1">
  </Destructor>
  <OperatorMethod id="_3068" name="=" returns="_5311" artificial="1" throw="" context="_663" access="public" mangled="_ZN26xcb_store_colors_request_taSERKS_" demangled="xcb_store_colors_request_t::operator=(xcb_store_colors_request_t const&amp;)" location="f0:3890" file="f0" line="3890" endline="3890" inline="1">
    <Argument type="_5312" location="f0:3890" file="f0" line="3890"/>
  </OperatorMethod>
  <Constructor id="_3069" name="xcb_store_colors_request_t" artificial="1" throw="" context="_663" access="public" mangled="_ZN26xcb_store_colors_request_tC1ERKS_ *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t(xcb_store_colors_request_t const&amp;)" location="f0:3890" file="f0" line="3890" endline="3890" inline="1">
    <Argument type="_5312" location="f0:3890" file="f0" line="3890"/>
  </Constructor>
  <Constructor id="_3070" name="xcb_store_colors_request_t" artificial="1" throw="" context="_663" access="public" mangled="_ZN26xcb_store_colors_request_tC1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t()" location="f0:3890" file="f0" line="3890" inline="1"/>
  <PointerType id="_3071" type="_1361" size="64" align="64"/>
  <Field id="_3072" name="major_opcode" type="_1416" offset="0" context="_671" access="public" location="f0:3161" file="f0" line="3161"/>
  <Field id="_3073" name="pad0" type="_1416" offset="8" context="_671" access="public" location="f0:3162" file="f0" line="3162"/>
  <Field id="_3074" name="length" type="_1343" offset="16" context="_671" access="public" location="f0:3163" file="f0" line="3163"/>
  <Field id="_3075" name="cid" type="_1719" offset="32" context="_671" access="public" location="f0:3164" file="f0" line="3164"/>
  <Field id="_3076" name="drawable" type="_840" offset="64" context="_671" access="public" location="f0:3165" file="f0" line="3165"/>
  <Field id="_3077" name="value_mask" type="_669" offset="96" context="_671" access="public" location="f0:3166" file="f0" line="3166"/>
  <Destructor id="_3078" name="xcb_create_gc_request_t" artificial="1" throw="" context="_671" access="public" mangled="_ZN23xcb_create_gc_request_tD1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::~xcb_create_gc_request_t()" location="f0:3160" file="f0" line="3160" endline="3160" inline="1">
  </Destructor>
  <OperatorMethod id="_3079" name="=" returns="_5313" artificial="1" throw="" context="_671" access="public" mangled="_ZN23xcb_create_gc_request_taSERKS_" demangled="xcb_create_gc_request_t::operator=(xcb_create_gc_request_t const&amp;)" location="f0:3160" file="f0" line="3160" endline="3160" inline="1">
    <Argument type="_5314" location="f0:3160" file="f0" line="3160"/>
  </OperatorMethod>
  <Constructor id="_3080" name="xcb_create_gc_request_t" artificial="1" throw="" context="_671" access="public" mangled="_ZN23xcb_create_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t(xcb_create_gc_request_t const&amp;)" location="f0:3160" file="f0" line="3160" endline="3160" inline="1">
    <Argument type="_5314" location="f0:3160" file="f0" line="3160"/>
  </Constructor>
  <Constructor id="_3081" name="xcb_create_gc_request_t" artificial="1" throw="" context="_671" access="public" mangled="_ZN23xcb_create_gc_request_tC1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t()" location="f0:3160" file="f0" line="3160" inline="1"/>
  <Field id="_3082" name="x" type="_846" offset="0" context="_674" access="public" location="f0:213" file="f0" line="213"/>
  <Field id="_3083" name="y" type="_846" offset="16" context="_674" access="public" location="f0:214" file="f0" line="214"/>
  <Field id="_3084" name="width" type="_1343" offset="32" context="_674" access="public" location="f0:215" file="f0" line="215"/>
  <Field id="_3085" name="height" type="_1343" offset="48" context="_674" access="public" location="f0:216" file="f0" line="216"/>
  <Destructor id="_3086" name="xcb_rectangle_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN15xcb_rectangle_tD1Ev *INTERNAL* " demangled="xcb_rectangle_t::~xcb_rectangle_t()" location="f0:212" file="f0" line="212" endline="212" inline="1">
  </Destructor>
  <OperatorMethod id="_3087" name="=" returns="_5315" artificial="1" throw="" context="_674" access="public" mangled="_ZN15xcb_rectangle_taSERKS_" demangled="xcb_rectangle_t::operator=(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5316" location="f0:212" file="f0" line="212"/>
  </OperatorMethod>
  <Constructor id="_3088" name="xcb_rectangle_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN15xcb_rectangle_tC1ERKS_ *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5316" location="f0:212" file="f0" line="212"/>
  </Constructor>
  <Constructor id="_3089" name="xcb_rectangle_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN15xcb_rectangle_tC1Ev *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t()" location="f0:212" file="f0" line="212" inline="1"/>
  <PointerType id="_3090" type="_1446" size="64" align="64"/>
  <PointerType id="_3091" type="_1663c" size="64" align="64"/>
  <PointerType id="_3092" type="_416" size="64" align="64"/>
  <Field id="_3093" name="sequence" type="_90" offset="0" context="_685" access="public" location="f0:4098" file="f0" line="4098"/>
  <Destructor id="_3094" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN28xcb_query_best_size_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::~xcb_query_best_size_cookie_t()" location="f0:4097" file="f0" line="4097" endline="4097" inline="1">
  </Destructor>
  <OperatorMethod id="_3095" name="=" returns="_5318" artificial="1" throw="" context="_685" access="public" mangled="_ZN28xcb_query_best_size_cookie_taSERKS_" demangled="xcb_query_best_size_cookie_t::operator=(xcb_query_best_size_cookie_t const&amp;)" location="f0:4097" file="f0" line="4097" endline="4097" inline="1">
    <Argument type="_5319" location="f0:4097" file="f0" line="4097"/>
  </OperatorMethod>
  <Constructor id="_3096" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t(xcb_query_best_size_cookie_t const&amp;)" location="f0:4097" file="f0" line="4097" endline="4097" inline="1">
    <Argument type="_5319" location="f0:4097" file="f0" line="4097"/>
  </Constructor>
  <Constructor id="_3097" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t()" location="f0:4097" file="f0" line="4097" inline="1"/>
  <Field id="_3098" name="response_type" type="_1416" offset="0" context="_692" access="public" location="f0:4233" file="f0" line="4233"/>
  <Field id="_3099" name="keysyms_per_keycode" type="_1416" offset="8" context="_692" access="public" location="f0:4234" file="f0" line="4234"/>
  <Field id="_3100" name="sequence" type="_1343" offset="16" context="_692" access="public" location="f0:4235" file="f0" line="4235"/>
  <Field id="_3101" name="length" type="_669" offset="32" context="_692" access="public" location="f0:4236" file="f0" line="4236"/>
  <Field id="_3102" name="pad0" type="_5282" offset="64" context="_692" access="public" location="f0:4237" file="f0" line="4237"/>
  <Destructor id="_3103" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::~xcb_get_keyboard_mapping_reply_t()" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
  </Destructor>
  <OperatorMethod id="_3104" name="=" returns="_5320" artificial="1" throw="" context="_692" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_taSERKS_" demangled="xcb_get_keyboard_mapping_reply_t::operator=(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
    <Argument type="_5321" location="f0:4232" file="f0" line="4232"/>
  </OperatorMethod>
  <Constructor id="_3105" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
    <Argument type="_5321" location="f0:4232" file="f0" line="4232"/>
  </Constructor>
  <Constructor id="_3106" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t()" location="f0:4232" file="f0" line="4232" inline="1"/>
  <PointerType id="_3107" type="_38" size="64" align="64"/>
  <PointerType id="_3108" type="_240" size="64" align="64"/>
  <Field id="_3109" name="x" type="_846" offset="0" context="_699" access="public" location="f0:232" file="f0" line="232"/>
  <Field id="_3110" name="y" type="_846" offset="16" context="_699" access="public" location="f0:233" file="f0" line="233"/>
  <Field id="_3111" name="width" type="_1343" offset="32" context="_699" access="public" location="f0:234" file="f0" line="234"/>
  <Field id="_3112" name="height" type="_1343" offset="48" context="_699" access="public" location="f0:235" file="f0" line="235"/>
  <Field id="_3113" name="angle1" type="_846" offset="64" context="_699" access="public" location="f0:236" file="f0" line="236"/>
  <Field id="_3114" name="angle2" type="_846" offset="80" context="_699" access="public" location="f0:237" file="f0" line="237"/>
  <Destructor id="_3115" name="xcb_arc_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN9xcb_arc_tD1Ev *INTERNAL* " demangled="xcb_arc_t::~xcb_arc_t()" location="f0:231" file="f0" line="231" endline="231" inline="1">
  </Destructor>
  <OperatorMethod id="_3116" name="=" returns="_5322" artificial="1" throw="" context="_699" access="public" mangled="_ZN9xcb_arc_taSERKS_" demangled="xcb_arc_t::operator=(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5323" location="f0:231" file="f0" line="231"/>
  </OperatorMethod>
  <Constructor id="_3117" name="xcb_arc_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN9xcb_arc_tC1ERKS_ *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5323" location="f0:231" file="f0" line="231"/>
  </Constructor>
  <Constructor id="_3118" name="xcb_arc_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN9xcb_arc_tC1Ev *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t()" location="f0:231" file="f0" line="231" inline="1"/>
  <Field id="_3119" name="major_opcode" type="_1416" offset="0" context="_703" access="public" location="f0:3672" file="f0" line="3672"/>
  <Field id="_3120" name="pad0" type="_1416" offset="8" context="_703" access="public" location="f0:3673" file="f0" line="3673"/>
  <Field id="_3121" name="length" type="_1343" offset="16" context="_703" access="public" location="f0:3674" file="f0" line="3674"/>
  <Field id="_3122" name="window" type="_649" offset="32" context="_703" access="public" location="f0:3675" file="f0" line="3675"/>
  <Destructor id="_3123" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_703" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::~xcb_list_installed_colormaps_request_t()" location="f0:3671" file="f0" line="3671" endline="3671" inline="1">
  </Destructor>
  <OperatorMethod id="_3124" name="=" returns="_5324" artificial="1" throw="" context="_703" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_taSERKS_" demangled="xcb_list_installed_colormaps_request_t::operator=(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3671" file="f0" line="3671" endline="3671" inline="1">
    <Argument type="_5325" location="f0:3671" file="f0" line="3671"/>
  </OperatorMethod>
  <Constructor id="_3125" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_703" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3671" file="f0" line="3671" endline="3671" inline="1">
    <Argument type="_5325" location="f0:3671" file="f0" line="3671"/>
  </Constructor>
  <Constructor id="_3126" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_703" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t()" location="f0:3671" file="f0" line="3671" inline="1"/>
  <Field id="_3127" name="sequence" type="_90" offset="0" context="_707" access="public" location="f0:2070" file="f0" line="2070"/>
  <Destructor id="_3128" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::~xcb_grab_pointer_cookie_t()" location="f0:2069" file="f0" line="2069" endline="2069" inline="1">
  </Destructor>
  <OperatorMethod id="_3129" name="=" returns="_5326" artificial="1" throw="" context="_707" access="public" mangled="_ZN25xcb_grab_pointer_cookie_taSERKS_" demangled="xcb_grab_pointer_cookie_t::operator=(xcb_grab_pointer_cookie_t const&amp;)" location="f0:2069" file="f0" line="2069" endline="2069" inline="1">
    <Argument type="_5327" location="f0:2069" file="f0" line="2069"/>
  </OperatorMethod>
  <Constructor id="_3130" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t(xcb_grab_pointer_cookie_t const&amp;)" location="f0:2069" file="f0" line="2069" endline="2069" inline="1">
    <Argument type="_5327" location="f0:2069" file="f0" line="2069"/>
  </Constructor>
  <Constructor id="_3131" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t()" location="f0:2069" file="f0" line="2069" inline="1"/>
  <PointerType id="_3132" type="_1441" size="64" align="64"/>
  <Field id="_3133" name="major_opcode" type="_1416" offset="0" context="_713" access="public" location="f0:3612" file="f0" line="3612"/>
  <Field id="_3134" name="pad0" type="_1416" offset="8" context="_713" access="public" location="f0:3613" file="f0" line="3613"/>
  <Field id="_3135" name="length" type="_1343" offset="16" context="_713" access="public" location="f0:3614" file="f0" line="3614"/>
  <Field id="_3136" name="cmap" type="_690" offset="32" context="_713" access="public" location="f0:3615" file="f0" line="3615"/>
  <Destructor id="_3137" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_713" access="public" mangled="_ZN27xcb_free_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::~xcb_free_colormap_request_t()" location="f0:3611" file="f0" line="3611" endline="3611" inline="1">
  </Destructor>
  <OperatorMethod id="_3138" name="=" returns="_5328" artificial="1" throw="" context="_713" access="public" mangled="_ZN27xcb_free_colormap_request_taSERKS_" demangled="xcb_free_colormap_request_t::operator=(xcb_free_colormap_request_t const&amp;)" location="f0:3611" file="f0" line="3611" endline="3611" inline="1">
    <Argument type="_5329" location="f0:3611" file="f0" line="3611"/>
  </OperatorMethod>
  <Constructor id="_3139" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_713" access="public" mangled="_ZN27xcb_free_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t(xcb_free_colormap_request_t const&amp;)" location="f0:3611" file="f0" line="3611" endline="3611" inline="1">
    <Argument type="_5329" location="f0:3611" file="f0" line="3611"/>
  </Constructor>
  <Constructor id="_3140" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_713" access="public" mangled="_ZN27xcb_free_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t()" location="f0:3611" file="f0" line="3611" inline="1"/>
  <Field id="_3141" name="response_type" type="_1416" offset="0" context="_716" access="public" location="f0:663" file="f0" line="663"/>
  <Field id="_3142" name="detail" type="_1416" offset="8" context="_716" access="public" location="f0:664" file="f0" line="664"/>
  <Field id="_3143" name="sequence" type="_1343" offset="16" context="_716" access="public" location="f0:665" file="f0" line="665"/>
  <Field id="_3144" name="event" type="_649" offset="32" context="_716" access="public" location="f0:666" file="f0" line="666"/>
  <Field id="_3145" name="mode" type="_1416" offset="64" context="_716" access="public" location="f0:667" file="f0" line="667"/>
  <Field id="_3146" name="pad0" type="_5029" offset="72" context="_716" access="public" location="f0:668" file="f0" line="668"/>
  <Destructor id="_3147" name="xcb_focus_in_event_t" artificial="1" throw="" context="_716" access="public" mangled="_ZN20xcb_focus_in_event_tD1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::~xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" endline="662" inline="1">
  </Destructor>
  <OperatorMethod id="_3148" name="=" returns="_5330" artificial="1" throw="" context="_716" access="public" mangled="_ZN20xcb_focus_in_event_taSERKS_" demangled="xcb_focus_in_event_t::operator=(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5331" location="f0:662" file="f0" line="662"/>
  </OperatorMethod>
  <Constructor id="_3149" name="xcb_focus_in_event_t" artificial="1" throw="" context="_716" access="public" mangled="_ZN20xcb_focus_in_event_tC1ERKS_ *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5331" location="f0:662" file="f0" line="662"/>
  </Constructor>
  <Constructor id="_3150" name="xcb_focus_in_event_t" artificial="1" throw="" context="_716" access="public" mangled="_ZN20xcb_focus_in_event_tC1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" inline="1"/>
  <Field id="_3151" name="data" type="_477" offset="0" context="_718" access="public" location="f14:115" file="f14" line="115"/>
  <Field id="_3152" name="rem" type="_172" offset="64" context="_718" access="public" location="f14:116" file="f14" line="116"/>
  <Field id="_3153" name="index" type="_172" offset="96" context="_718" access="public" location="f14:117" file="f14" line="117"/>
  <Destructor id="_3154" name="._26" artificial="1" throw="" context="_718" access="public" mangled="_ZN22xcb_generic_iterator_tD1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::~xcb_generic_iterator_t()" location="f14:118" file="f14" line="118" endline="118" inline="1">
  </Destructor>
  <OperatorMethod id="_3155" name="=" returns="_5332" artificial="1" throw="" context="_718" access="public" mangled="_ZN22xcb_generic_iterator_taSERKS_" demangled="xcb_generic_iterator_t::operator=(xcb_generic_iterator_t const&amp;)" location="f14:118" file="f14" line="118" endline="118" inline="1">
    <Argument type="_5333" location="f14:114" file="f14" line="114"/>
  </OperatorMethod>
  <Constructor id="_3156" name="._26" artificial="1" throw="" context="_718" access="public" mangled="_ZN22xcb_generic_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t(xcb_generic_iterator_t const&amp;)" location="f14:118" file="f14" line="118" endline="118" inline="1">
    <Argument type="_5333" location="f14:114" file="f14" line="114"/>
  </Constructor>
  <Constructor id="_3157" name="._26" artificial="1" throw="" context="_718" access="public" mangled="_ZN22xcb_generic_iterator_tC1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t()" location="f14:118" file="f14" line="118" inline="1"/>
  <PointerType id="_3158" type="_25c" size="64" align="64"/>
  <Field id="_3159" name="major_opcode" type="_1416" offset="0" context="_722" access="public" location="f0:4591" file="f0" line="4591"/>
  <Field id="_3160" name="mode" type="_1416" offset="8" context="_722" access="public" location="f0:4592" file="f0" line="4592"/>
  <Field id="_3161" name="length" type="_1343" offset="16" context="_722" access="public" location="f0:4593" file="f0" line="4593"/>
  <Destructor id="_3162" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_force_screen_saver_request_tD1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::~xcb_force_screen_saver_request_t()" location="f0:4590" file="f0" line="4590" endline="4590" inline="1">
  </Destructor>
  <OperatorMethod id="_3163" name="=" returns="_5335" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_force_screen_saver_request_taSERKS_" demangled="xcb_force_screen_saver_request_t::operator=(xcb_force_screen_saver_request_t const&amp;)" location="f0:4590" file="f0" line="4590" endline="4590" inline="1">
    <Argument type="_5336" location="f0:4590" file="f0" line="4590"/>
  </OperatorMethod>
  <Constructor id="_3164" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1ERKS_ *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t(xcb_force_screen_saver_request_t const&amp;)" location="f0:4590" file="f0" line="4590" endline="4590" inline="1">
    <Argument type="_5336" location="f0:4590" file="f0" line="4590"/>
  </Constructor>
  <Constructor id="_3165" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t()" location="f0:4590" file="f0" line="4590" inline="1"/>
  <Field id="_3166" name="__prev" type="_5337" offset="0" context="_724" access="public" location="f8:77" file="f8" line="77"/>
  <Field id="_3167" name="__next" type="_5337" offset="64" context="_724" access="public" location="f8:78" file="f8" line="78"/>
  <Destructor id="_3168" name="__pthread_internal_list" artificial="1" throw="" context="_724" access="public" mangled="_ZN23__pthread_internal_listD1Ev *INTERNAL* " demangled="__pthread_internal_list::~__pthread_internal_list()" location="f8:76" file="f8" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_3169" name="=" returns="_5338" artificial="1" throw="" context="_724" access="public" mangled="_ZN23__pthread_internal_listaSERKS_" demangled="__pthread_internal_list::operator=(__pthread_internal_list const&amp;)" location="f8:76" file="f8" line="76" endline="76" inline="1">
    <Argument type="_5339" location="f8:76" file="f8" line="76"/>
  </OperatorMethod>
  <Constructor id="_3170" name="__pthread_internal_list" artificial="1" throw="" context="_724" access="public" mangled="_ZN23__pthread_internal_listC1ERKS_ *INTERNAL* " demangled="__pthread_internal_list::__pthread_internal_list(__pthread_internal_list const&amp;)" location="f8:76" file="f8" line="76" endline="76" inline="1">
    <Argument type="_5339" location="f8:76" file="f8" line="76"/>
  </Constructor>
  <Constructor id="_3171" name="__pthread_internal_list" artificial="1" throw="" context="_724" access="public" mangled="_ZN23__pthread_internal_listC1Ev *INTERNAL* " demangled="__pthread_internal_list::__pthread_internal_list()" location="f8:76" file="f8" line="76" inline="1"/>
  <Field id="_3172" name="response_type" type="_1416" offset="0" context="_728" access="public" location="f0:4695" file="f0" line="4695"/>
  <Field id="_3173" name="status" type="_1416" offset="8" context="_728" access="public" location="f0:4696" file="f0" line="4696"/>
  <Field id="_3174" name="sequence" type="_1343" offset="16" context="_728" access="public" location="f0:4697" file="f0" line="4697"/>
  <Field id="_3175" name="length" type="_669" offset="32" context="_728" access="public" location="f0:4698" file="f0" line="4698"/>
  <Destructor id="_3176" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_728" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::~xcb_set_modifier_mapping_reply_t()" location="f0:4694" file="f0" line="4694" endline="4694" inline="1">
  </Destructor>
  <OperatorMethod id="_3177" name="=" returns="_5340" artificial="1" throw="" context="_728" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_taSERKS_" demangled="xcb_set_modifier_mapping_reply_t::operator=(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4694" file="f0" line="4694" endline="4694" inline="1">
    <Argument type="_5341" location="f0:4694" file="f0" line="4694"/>
  </OperatorMethod>
  <Constructor id="_3178" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_728" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::xcb_set_modifier_mapping_reply_t(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4694" file="f0" line="4694" endline="4694" inline="1">
    <Argument type="_5341" location="f0:4694" file="f0" line="4694"/>
  </Constructor>
  <Constructor id="_3179" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_728" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::xcb_set_modifier_mapping_reply_t()" location="f0:4694" file="f0" line="4694" inline="1"/>
  <Field id="_3180" name="major_opcode" type="_1416" offset="0" context="_730" access="public" location="f0:2179" file="f0" line="2179"/>
  <Field id="_3181" name="pad0" type="_1416" offset="8" context="_730" access="public" location="f0:2180" file="f0" line="2180"/>
  <Field id="_3182" name="length" type="_1343" offset="16" context="_730" access="public" location="f0:2181" file="f0" line="2181"/>
  <Field id="_3183" name="cursor" type="_1016" offset="32" context="_730" access="public" location="f0:2182" file="f0" line="2182"/>
  <Field id="_3184" name="time" type="_1208" offset="64" context="_730" access="public" location="f0:2183" file="f0" line="2183"/>
  <Field id="_3185" name="event_mask" type="_1343" offset="96" context="_730" access="public" location="f0:2184" file="f0" line="2184"/>
  <Field id="_3186" name="pad1" type="_5023" offset="112" context="_730" access="public" location="f0:2185" file="f0" line="2185"/>
  <Destructor id="_3187" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tD1Ev *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::~xcb_change_active_pointer_grab_request_t()" location="f0:2178" file="f0" line="2178" endline="2178" inline="1">
  </Destructor>
  <OperatorMethod id="_3188" name="=" returns="_5342" artificial="1" throw="" context="_730" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_taSERKS_" demangled="xcb_change_active_pointer_grab_request_t::operator=(xcb_change_active_pointer_grab_request_t const&amp;)" location="f0:2178" file="f0" line="2178" endline="2178" inline="1">
    <Argument type="_5343" location="f0:2178" file="f0" line="2178"/>
  </OperatorMethod>
  <Constructor id="_3189" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::xcb_change_active_pointer_grab_request_t(xcb_change_active_pointer_grab_request_t const&amp;)" location="f0:2178" file="f0" line="2178" endline="2178" inline="1">
    <Argument type="_5343" location="f0:2178" file="f0" line="2178"/>
  </Constructor>
  <Constructor id="_3190" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tC1Ev *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::xcb_change_active_pointer_grab_request_t()" location="f0:2178" file="f0" line="2178" inline="1"/>
  <PointerType id="_3191" type="_902" size="64" align="64"/>
  <Field id="_3192" name="tv_sec" type="_1010" offset="0" context="_743" access="public" location="f1:122" file="f1" line="122"/>
  <Field id="_3193" name="tv_nsec" type="_1747" offset="64" context="_743" access="public" location="f1:123" file="f1" line="123"/>
  <Destructor id="_3194" name="timespec" artificial="1" throw="" context="_743" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f1:121" file="f1" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_3195" name="=" returns="_5344" artificial="1" throw="" context="_743" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f1:121" file="f1" line="121" endline="121" inline="1">
    <Argument type="_5345" location="f1:121" file="f1" line="121"/>
  </OperatorMethod>
  <Constructor id="_3196" name="timespec" artificial="1" throw="" context="_743" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f1:121" file="f1" line="121" endline="121" inline="1">
    <Argument type="_5345" location="f1:121" file="f1" line="121"/>
  </Constructor>
  <Constructor id="_3197" name="timespec" artificial="1" throw="" context="_743" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f1:121" file="f1" line="121" inline="1"/>
  <Field id="_3198" name="major_opcode" type="_1416" offset="0" context="_745" access="public" location="f0:2753" file="f0" line="2753"/>
  <Field id="_3199" name="odd_length" type="_1416" offset="8" context="_745" access="public" location="f0:2754" file="f0" line="2754"/>
  <Field id="_3200" name="length" type="_1343" offset="16" context="_745" access="public" location="f0:2755" file="f0" line="2755"/>
  <Field id="_3201" name="font" type="_223" offset="32" context="_745" access="public" location="f0:2756" file="f0" line="2756"/>
  <Destructor id="_3202" name="xcb_query_text_extents_request_t" artificial="1" throw="" context="_745" access="public" mangled="_ZN32xcb_query_text_extents_request_tD1Ev *INTERNAL* " demangled="xcb_query_text_extents_request_t::~xcb_query_text_extents_request_t()" location="f0:2752" file="f0" line="2752" endline="2752" inline="1">
  </Destructor>
  <OperatorMethod id="_3203" name="=" returns="_5346" artificial="1" throw="" context="_745" access="public" mangled="_ZN32xcb_query_text_extents_request_taSERKS_" demangled="xcb_query_text_extents_request_t::operator=(xcb_query_text_extents_request_t const&amp;)" location="f0:2752" file="f0" line="2752" endline="2752" inline="1">
    <Argument type="_5347" location="f0:2752" file="f0" line="2752"/>
  </OperatorMethod>
  <Constructor id="_3204" name="xcb_query_text_extents_request_t" artificial="1" throw="" context="_745" access="public" mangled="_ZN32xcb_query_text_extents_request_tC1ERKS_ *INTERNAL* " demangled="xcb_query_text_extents_request_t::xcb_query_text_extents_request_t(xcb_query_text_extents_request_t const&amp;)" location="f0:2752" file="f0" line="2752" endline="2752" inline="1">
    <Argument type="_5347" location="f0:2752" file="f0" line="2752"/>
  </Constructor>
  <Constructor id="_3205" name="xcb_query_text_extents_request_t" artificial="1" throw="" context="_745" access="public" mangled="_ZN32xcb_query_text_extents_request_tC1Ev *INTERNAL* " demangled="xcb_query_text_extents_request_t::xcb_query_text_extents_request_t()" location="f0:2752" file="f0" line="2752" inline="1"/>
  <Field id="_3206" name="sequence" type="_90" offset="0" context="_749" access="public" location="f0:1744" file="f0" line="1744"/>
  <Destructor id="_3207" name="xcb_query_tree_cookie_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN23xcb_query_tree_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_tree_cookie_t::~xcb_query_tree_cookie_t()" location="f0:1743" file="f0" line="1743" endline="1743" inline="1">
  </Destructor>
  <OperatorMethod id="_3208" name="=" returns="_5348" artificial="1" throw="" context="_749" access="public" mangled="_ZN23xcb_query_tree_cookie_taSERKS_" demangled="xcb_query_tree_cookie_t::operator=(xcb_query_tree_cookie_t const&amp;)" location="f0:1743" file="f0" line="1743" endline="1743" inline="1">
    <Argument type="_5349" location="f0:1743" file="f0" line="1743"/>
  </OperatorMethod>
  <Constructor id="_3209" name="xcb_query_tree_cookie_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN23xcb_query_tree_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_tree_cookie_t::xcb_query_tree_cookie_t(xcb_query_tree_cookie_t const&amp;)" location="f0:1743" file="f0" line="1743" endline="1743" inline="1">
    <Argument type="_5349" location="f0:1743" file="f0" line="1743"/>
  </Constructor>
  <Constructor id="_3210" name="xcb_query_tree_cookie_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN23xcb_query_tree_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_tree_cookie_t::xcb_query_tree_cookie_t()" location="f0:1743" file="f0" line="1743" inline="1"/>
  <Field id="_3211" name="root" type="_649" offset="0" context="_752" access="public" location="f0:358" file="f0" line="358"/>
  <Field id="_3212" name="default_colormap" type="_690" offset="32" context="_752" access="public" location="f0:359" file="f0" line="359"/>
  <Field id="_3213" name="white_pixel" type="_669" offset="64" context="_752" access="public" location="f0:360" file="f0" line="360"/>
  <Field id="_3214" name="black_pixel" type="_669" offset="96" context="_752" access="public" location="f0:361" file="f0" line="361"/>
  <Field id="_3215" name="current_input_masks" type="_669" offset="128" context="_752" access="public" location="f0:362" file="f0" line="362"/>
  <Field id="_3216" name="width_in_pixels" type="_1343" offset="160" context="_752" access="public" location="f0:363" file="f0" line="363"/>
  <Field id="_3217" name="height_in_pixels" type="_1343" offset="176" context="_752" access="public" location="f0:364" file="f0" line="364"/>
  <Field id="_3218" name="width_in_millimeters" type="_1343" offset="192" context="_752" access="public" location="f0:365" file="f0" line="365"/>
  <Field id="_3219" name="height_in_millimeters" type="_1343" offset="208" context="_752" access="public" location="f0:366" file="f0" line="366"/>
  <Field id="_3220" name="min_installed_maps" type="_1343" offset="224" context="_752" access="public" location="f0:367" file="f0" line="367"/>
  <Field id="_3221" name="max_installed_maps" type="_1343" offset="240" context="_752" access="public" location="f0:368" file="f0" line="368"/>
  <Field id="_3222" name="root_visual" type="_1707" offset="256" context="_752" access="public" location="f0:369" file="f0" line="369"/>
  <Field id="_3223" name="backing_stores" type="_1416" offset="288" context="_752" access="public" location="f0:370" file="f0" line="370"/>
  <Field id="_3224" name="save_unders" type="_1416" offset="296" context="_752" access="public" location="f0:371" file="f0" line="371"/>
  <Field id="_3225" name="root_depth" type="_1416" offset="304" context="_752" access="public" location="f0:372" file="f0" line="372"/>
